[{"id":"b24f69f4-573a-4607-9941-613c99de26b2","type":"Full Time","url":"https://jobs.github.com/positions/b24f69f4-573a-4607-9941-613c99de26b2","created_at":"Sat Aug 08 16:57:04 UTC 2020","company":"3DEO","company_url":"http:","location":"Los Angeles","title":"Full-Stack Engineer","description":"\u003cp\u003e\u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBased in Los Angeles, 3DEO’s breakthrough Intelligent Layering® technology unlocks high-volume metal 3D printing by drastically reducing final part cost. Despite the low cost, our parts meet the high industry benchmark MPIF Standard 35 while still achieving tight tolerances and an industry leading surface finish. Intelligent Layering® opens metal 3D printing to most of the industries that can’t afford today’s expensive options.\u003c/p\u003e\n\u003cp\u003e3DEO recently reached a huge industry milestone - 150,000 metal 3D printed production components sent to customers! The company is focused on the industries of aerospace, medical, and defense. 3DEO currently has over 60 employees and is upgrading to a 60,000 sq ft manufacturing facility in Los Angeles.\u003c/p\u003e\n\u003cp\u003eReporting to: Chief Technology Officer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Position\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for a passionate, motivated and innovative individual that’s looking to make an impact in a highly-skilled, core technology team through strong software engineering talent. Our current intelligence core includes Additive Manufacturing Research Scientists, Mechanical Engineers, a Materials Scientist, Software Developers and an Electrical Engineer. As a key member of our intelligence core, you will help develop and operate a new wave of high-quality part manufacturing capabilities in metal AM. This is a full-time position.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e will be a software engineer supporting our expanding automation efforts and data collection initiatives. The successful applicant will be an expert in Python and web frameworks such as Django. They will also have experience with well-known front-end frameworks including React and Bootstrap.\u003c/p\u003e\n\u003cp\u003eSpecifically, the \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and deploy software for internal use.\u003c/li\u003e\n\u003cli\u003eBe the primary owner of the codebase and our application stack, from frontend to database.\u003c/li\u003e\n\u003cli\u003eSet up an agile development pipeline using the principles of continuous integration and the Twelve Factor App Methodology\u003c/li\u003e\n\u003cli\u003eEnsure the entire stack is designed and built for speed and scalability.\u003c/li\u003e\n\u003cli\u003eDesign user interfaces with frameworks such as Bootstrap and integrate interfaces with our MES (Manufacturing Execution System) software.\u003c/li\u003e\n\u003cli\u003eWrite clear, documented and maintainable code\u003c/li\u003e\n\u003cli\u003eWork with manufacturing and operations teams to develop new software projects and processes\u003c/li\u003e\n\u003cli\u003eCommunicate with internal customers \u0026amp; collect user feedback\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications \u0026amp; Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn undergraduate software engineering degree is required and a master’s or PhD are a plus. The \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e should have at least five years of experience, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience in a full-stack engineering role\u003c/li\u003e\n\u003cli\u003eAbsolute Python expert – over five years of experience and very deep in multiple frameworks including Django\u003c/li\u003e\n\u003cli\u003eSignificant experience with database technologies such as MySQL, PostgreSQL, Oracle and MongoDB.\u003c/li\u003e\n\u003cli\u003eProficiency with fundamental front-end languages such as HTML, CSS and JavaScript.\u003c/li\u003e\n\u003cli\u003eFamiliarity with JavaScript frameworks such as Angular, React and Ember.\u003c/li\u003e\n\u003cli\u003ePassion for conquering challenging problems\u003c/li\u003e\n\u003cli\u003eCreativity and analytical skills\u003c/li\u003e\n\u003cli\u003eAbility to communicate technical knowledge in a clear and   understandable manner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePersonal Characteristics\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchievement Orientation\u003c/strong\u003e - High energy, results-driven, determined, and flexible, with a strong and disciplined work ethic. Sets a quick pace, and constantly raises the bar and presses themselves toward higher levels of achievement while at the same time fostering a collaborative culture.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePersistence\u003c/strong\u003e – Tenacious in the pursuit of excellence. Is not easily swayed by short-term swings in fortune and maintains strong vision on long-term goals. Understands that success comes from effectively executing a plan on a consistent basis and with high intensity, despite any obstacles or challenges.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCommunication Skills\u003c/strong\u003e - Excellent verbal and written communication skills with the ability to effectively deliver and reinforce consistent messages. Leverages these capabilities to interact with, and persuade, potential customers. Excellent listening skills.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTeam Player\u003c/strong\u003e - Has the ability to work effectively with all people within the organization to ensure customers’ needs are being met or exceeded. Has a collegial, inclusive working style and is professional and courteous. Builds strong relationships both internally and externally.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to me at \u003ca href=\"mailto:lance.kallman@3deo.co\"\u003elance.kallman@3deo.co\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU9IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8a0c09f8cb57abbbe3aec63ffce7da6e02f9edf4/3DEO.png"},{"id":"10ef553e-b63a-484b-870f-4b040ccdd61b","type":"Full Time","url":"https://jobs.github.com/positions/10ef553e-b63a-484b-870f-4b040ccdd61b","created_at":"Fri Aug 07 21:22:57 UTC 2020","company":"MOO ","company_url":"http://moo.com","location":"London","title":" Java and Python Engineering Opportunities! ","description":"\u003cp\u003eMOO set out to shake up the world of print back in 2006. And we’ve come a long way since. Today we’re a global team (we’re thinking of getting matching jackets) who create print and digital products for companies of all sizes – from Google and AirBnB to the guy who makes those amazing prints you found at a craft fair.\u003c/p\u003e\n\u003cp\u003eOur HQ is in London, UK, while we also have premises in Dagenham. In the US, you’ll find us in Boston, MA, as well as Lincoln, RI and Denver, CO.\u003c/p\u003e\n\u003cp\u003eWant to join one of our amazing teams?\u003c/p\u003e\n\u003cp\u003eWe are looking for Software Engineers and Team Leads in a few different areas. Build, Buy, and Managed Services.  Details and roles listed below:\u003c/p\u003e\n\u003cp\u003eSenior Full Stack Engineer (Python/Javascript) - London/WFH\nSenior Java Engineer – eComm - London/WFH\nTeam Lead - Java (Buy/eComm) - London\nTeam Lead-Java (Manage Services) - London\nTeam Lead -Python/Javascript (Build) – London\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBUILD\u003c/strong\u003e\nOur Build team focuses on design creation and customisation tools. This team is at the heart of the MOO experience. We provide our customers with the tools to create bespoke unique print products.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBUY\u003c/strong\u003e\nIt is responsible for building all customer-facing parts of the digital moo.com experience that ensures that customers get to know our brand/products via our website, can customize them and place an order. In the Buy area (cart, checkout, product, pricing, cross sell, ..) we tackle a fascinating problem domain that impacts user experience and conversion directly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMANAGED SERVICES\u003c/strong\u003e\nThe business services engineering team focuses on the B2B experience, and continuously evolves services in supporting our MBS (MOO Business Services) app and supports MOO’s long term focus from a technical point of view.\u003c/p\u003e\n\u003cp\u003eNot familiar with MOO?  Check out the video below to see what we are all about and how tech is at the core of everything we do.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vimeo.com/354880404\"\u003e\u003cstrong\u003eVIDEO\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\"\u003eLink to job site to apply\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s it like to work at MOO?\u003c/strong\u003e\nMOO’s the kind of workplace where you can really be yourself. Dye your hair purple. Hit the sofa with your laptop. Whatever helps you feel comfortable and happy at work. We want to help you grow in your career and set you up for success – while also recognising the importance of a healthy work/life balance.\u003c/p\u003e\n\u003cp\u003eThat’s why we offer 25 days holiday rising by one day for each year here (for 5 years), a matched pension scheme, MOO’s share option scheme, and paid parental leave. We’ll offer you private healthcare, life insurance, a season ticket loan, subsidised gym membership and a cycle to work scheme. Finally, we’ll treat you to breakfast and fresh fruit every day, lunch on Fridays and all the ice cream you can eat (just watch for the brain freeze).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity Statement\u003c/strong\u003e\nWe are working hard to create a representative, inclusive and super-friendly team, because we know that different experiences, perspectives and backgrounds make for a better workplace. And that creates a better experience for our customers. MOO doesn’t discriminate on the basis of race, colour, religion or belief, gender, national origin, age, sexual orientation, marital status, disability or any other protected class.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\"\u003ehttps://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2094ccce91a287c6bf5c665a18e6245fcb38bae0/MOO_Logo_Hero-Green_RGB-01%20(1).png"},{"id":"420e735f-2ee4-4ab8-b61e-77f42714a9e9","type":"Full Time","url":"https://jobs.github.com/positions/420e735f-2ee4-4ab8-b61e-77f42714a9e9","created_at":"Fri Aug 07 21:21:55 UTC 2020","company":"Playco","company_url":"http:","location":"Remote, Seoul, Tokyo, San Francisco, Mountain View","title":"Senior Game Engineer","description":"\u003cp\u003eHere at \u003cstrong\u003ePlayco\u003c/strong\u003e, we make games that bring the world closer together through play.\u003c/p\u003e\n\u003cp\u003eOur ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you’ll enrich our team with your enthusiasm and passion, both for games and for life.\u003c/p\u003e\n\u003cp\u003eWe are currently looking for Senior Game Engineers to join our global growing team. We  have offices in San Francisco, Mountain View, and Tokyo, Japan, but remote is 100% fine with us! If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eWe want to talk to people who are proficient with JS and passionate about making games, but It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features.\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end.\u003c/li\u003e\n\u003cli\u003eBe the champion for the user!\u003c/li\u003e\n\u003cli\u003eInsist on the highest standards and create functional and engaging features that will delight our users.\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product.\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team.\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements.\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gamingInnovate and iterate on process, systems and technology to deliver world­-class social games.\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eProficient at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with analytics and A/B testing in mobile games.\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf starter, analytical and creative.\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eUnderstanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work.\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles.\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.).\u003c/li\u003e\n\u003cli\u003eExpert knowledge of TypeScript.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/playco/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003eAPPLY HERE\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGFIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0fa9b48edb8f52d899dfc93962c463442d19ac5c/Square_Logo1.png"},{"id":"08ebe26e-a078-4c69-9b02-eab84320fce9","type":"Full Time","url":"https://jobs.github.com/positions/08ebe26e-a078-4c69-9b02-eab84320fce9","created_at":"Thu Aug 06 13:14:46 UTC 2020","company":"Uplink","company_url":"http://www.uplinktalent.com","location":"Remote - United States","title":"Sr. Full Stack Software Engineer - Cybersecurity","description":"\u003cp\u003eSenior Software Developer\nFull-Time\n100% Remote\u003c/p\u003e\n\u003cp\u003ePlease note: You must be authorized to work for any employer in the US to be considered for this opportunity\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBase salary from $120 to $180k/yr. plus stock options, plus bonus\u003c/li\u003e\n\u003cli\u003eStack is Java, JavaScript, React, Angular, Node.js (also uses Python)\u003c/li\u003e\n\u003cli\u003eThe client is growing (hiring) 40% this year, with revenue of $20 Million annually\u003c/li\u003e\n\u003cli\u003eThey secure customer applications and integrate w/client source code \u0026amp; infrastructure to find vulnerabilities (and fix them).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI’m working directly with the hiring manager at a Cybersecurity company in Austin, TX to fill four (4) Senior Software Engineer positions. Will consider back-end experience with Java, C#, or Python\u003c/p\u003e\n\u003cp\u003eFrom software hacking to hardware hacking, we help secure everything from cryptocurrency exchanges and space telescopes to autonomous vehicles and the electric grid. Today, our client is making significant investments in terms of financial and engineering resources to develop a radically new customer experience we call “Security-as-a-Service” to provide customers with a unified, efficient, and data-driven security platform. We are looking to add the right individual to our growing team supporting the next wave of cybersecurity products and solutions.\u003c/p\u003e\n\u003cp\u003eAs a full stack software engineer, you’ll have the opportunity to work with some of the best security engineers in the world who hail from organizations such as Amazon, CIA, Facebook, Google, Microsoft, NSA, Redhat, Sun Microsystems, and US Air Force. As an Inc. Best Places to Work, Inc. 500 | 5000, Cybersecurity 500, and Austin Fast 50 Award recipient, we are seeking an individual that understands the professional and personal growth attached to this opportunity and who has the corresponding internal drive to maximize it.\u003c/p\u003e\n\u003cp\u003eCareer opportunity:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJoin an industry with massive socio, economic, and political importance in the 21st century\u003c/li\u003e\n\u003cli\u003ePartner with prominent clients and help them solve hard security problems\u003c/li\u003e\n\u003cli\u003eWork alongside some of the best and the brightest minds in the security industry\u003c/li\u003e\n\u003cli\u003eLeave an indelible mark on a company where individual input has real impact\u003c/li\u003e\n\u003cli\u003eBe recognized, internally and publicly, for your contributions in a high profile position\u003c/li\u003e\n\u003cli\u003eAlign your career trajectory with a hyper-growth company that is on the move\u003c/li\u003e\n\u003cli\u003eBe part of the initial team designing and building out this product\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCore responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate uncanny amounts of complex code in a short order\u003c/li\u003e\n\u003cli\u003eDevelop, test, and maintain code throughout the code base\u003c/li\u003e\n\u003cli\u003eProvide development effort estimation and story point new features\u003c/li\u003e\n\u003cli\u003eTroubleshoot and resolve reported bugs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Java or Python, Javascript, and front end frameworks like Angular\u003c/li\u003e\n\u003cli\u003eBS in computer science or computer engineering\u003c/li\u003e\n\u003cli\u003eAt least 5 years professional experience in a software engineering position\u003c/li\u003e\n\u003cli\u003eExperience with modern technology stacks\u003c/li\u003e\n\u003cli\u003eExperience with React (may be the front-end), Node.js, (server side runtime environment back end to run JavaScript) or similar libraries and frameworks\u003c/li\u003e\n\u003cli\u003eExperience with micro-services architectures\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with cloud platforms and SaaS solutions\u003c/li\u003e\n\u003cli\u003eExperience with agile/scrum development practices\u003c/li\u003e\n\u003cli\u003eExperience with test driven development, continuous integration, continuous deployment\u003c/li\u003e\n\u003cli\u003eExperience with Git, JIRA, Confluence\u003c/li\u003e\n\u003cli\u003eExperience with Google Compute, Firebase, Docker, and GKE\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired behaviors:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRelentless restlessness to solve customer problems throughout the codebase\u003c/li\u003e\n\u003cli\u003eAbility to maintain high levels of output and work ethic\u003c/li\u003e\n\u003cli\u003ePersonable individual who enjoys working in a team-oriented environment\u003c/li\u003e\n\u003cli\u003eComfort dealing with ambiguity in an environment where we build the plane as we fly it\u003c/li\u003e\n\u003cli\u003eAbility to work within constraints and to challenge the status quo\u003c/li\u003e\n\u003cli\u003eAbility to self-direct work, orient to action, and truly own the position in a hyper-growth environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation package:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHighly competitive base-salary\u003c/li\u003e\n\u003cli\u003eEligible for performance-based incentive compensation\u003c/li\u003e\n\u003cli\u003eEmployee stock option plan\u003c/li\u003e\n\u003cli\u003eHealth insurance\u003c/li\u003e\n\u003cli\u003e4% company 401K matching vested immediately\u003c/li\u003e\n\u003cli\u003eCompany contributions to training and conferences\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail resume to \u003ca href=\"mailto:jay.miller@uplinktalent.com\"\u003ejay.miller@uplinktalent.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1264511bcee45490ad7a5ca5d165e4e38ce85081/LI111.png"},{"id":"202228a1-a793-447d-861d-6c6a38e1cfef","type":"Full Time","url":"https://jobs.github.com/positions/202228a1-a793-447d-861d-6c6a38e1cfef","created_at":"Wed Aug 05 20:54:41 UTC 2020","company":"SmartFinancial.com","company_url":"http://www.smartfinancial.com","location":"Remote","title":"Full Stack Engineer","description":"\u003cp\u003eVoted as one of the Best Places to Work and one of the fastest-growing tech companies!\u003c/p\u003e\n\u003cp\u003eSmartFinancial is a leading insurance technology company working on building tools to make the insurance shopping process better, simpler, and more effective. ﻿We are experiencing exponential growth so we are seeking a Full-Stack Engineer to help us maintain our growth by improving and adding new features to our current code bases as well as build new applications that will help us move forward with new products and services.\u003c/p\u003e\n\u003cp\u003eOur immediate need is to help solidify our existing applications by cleaning up code bases as well as adding additional test coverage. In addition, we have a growing need to harness various workflows and processes for both internal staff as well as our public-facing business – that is to say you will help from idea generation through project completion on new application development.\u003c/p\u003e\n\u003cp\u003eWe are a small engineering team based in Newport Beach, CA and Columbus, OH. We prefer someone who can work at our offices but are willing to fill this position with a remote candidate. What matters most to us is finding someone who is professional and mature and requires as little oversight as needed in terms of management.\u003c/p\u003e\n\u003cp\u003eA typical week will start off with a quick meeting to review the current iteration and plan out the week. Thereafter, we are heads down and work on our tasks via our project management system and conventions. We are looking for a person who not only can grok the job at hand but know the best approach to doing it right. We are primarily a Rails shop but have some JS apps as well, so we’ll want a person who is very knowledgeable on Rails best practices from coding to hosting.\u003c/p\u003e\n\u003cp\u003eWe focus on results and would rather allow freedom of leading a project as a professional vs. having to be managed the entire way. ﻿\u003c/p\u003e\n\u003cp\u003eDuties and Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork closely with the Design and Development team to create high-quality web apps\u003c/li\u003e\n\u003cli\u003eDesign and develop testable production-level code\u003c/li\u003e\n\u003cli\u003eWrite effective and powerful APIs\u003c/li\u003e\n\u003cli\u003eDevelop efficient algorithms and data-structures to improve key business logic and processes\u003c/li\u003e\n\u003cli\u003eResearch and provide alternatives to existing development practices, tools, etc.\u003c/li\u003e\n\u003cli\u003eOptimize web pages and back-end UIs\u003c/li\u003e\n\u003cli\u003eModify existing software to correct errors, or to improve its performance\u003c/li\u003e\n\u003cli\u003eDevelop and direct software system testing and validation procedures, programming, and technical documentation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience: 4-6 years in a production environment\u003c/li\u003e\n\u003cli\u003eAbility to communicate clearly both verbally and text\u003c/li\u003e\n\u003cli\u003eHave a strong sense of awareness of our business and how you are contributing to it\u003c/li\u003e\n\u003cli\u003eSelf-Motivated – we seek mature professionals vs. people who need to be micromanaged\u003c/li\u003e\n\u003cli\u003eBe available for meetings weekly to cover existing and upcoming projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTechnical Requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLanguage/Frameworks: Ruby on Rails, Ruby, JavaScript, Node, Angular\u003c/li\u003e\n\u003cli\u003eTesting: RSpec, Capybara, Jasmine\u003c/li\u003e\n\u003cli\u003eDatabase: MySQL, Redis, Mongo\u003c/li\u003e\n\u003cli\u003eOS: Linux, Bash, MacOS\u003c/li\u003e\n\u003cli\u003eUtility: Git, AWS\u003c/li\u003e\n\u003cli\u003eFront-End: Bootstrap, CSS, HTML5\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus Items:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevOps: Ansible, Chef, Jenkins we may many hats so if you’re comfortable with provisioning servers and being in a shell environment you’ll have an extra edge.\u003c/li\u003e\n\u003cli\u003eCI Systems: Semaphore\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e﻿WHAT WE OFFER\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive Pay\u003c/li\u003e\n\u003cli\u003e401k with Company Match\n﻿- Health Insurance\u003c/li\u003e\n\u003cli\u003eStock Option\u003c/li\u003e\n\u003cli\u003eWeekly team lunches\u003c/li\u003e\n\u003cli\u003eAdvancement opportunities - we promote within\u003c/li\u003e\n\u003cli\u003eRemote Position\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e﻿If you are looking for a challenge, yet have the freedom to work as you need as a professional then send us your resume, Github, and sample work.﻿\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eemail your resume to \u003ca href=\"mailto:lev@smartfinancial.com\"\u003elev@smartfinancial.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcENIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42577c53350abffb4fc6aa57cd6e185ed9cdbdd8/new_logo%20(1).png"},{"id":"f5d122aa-45be-4ec8-95d7-462cdfc3c364","type":"Full Time","url":"https://jobs.github.com/positions/f5d122aa-45be-4ec8-95d7-462cdfc3c364","created_at":"Wed Aug 05 19:51:27 UTC 2020","company":"Convergence Blended Finance","company_url":"http://convergence.finance","location":"Flexible, Preferred Toronto, Ontario","title":"Senior Full-stack Developer","description":"\u003cp\u003eConvergence is the global network for blended finance. We generate blended finance data, intelligence, and deal flow to increase private sector investment in developing countries. \u003ca href=\"https://www.convergence.finance/blended-finance\"\u003eBlended finance\u003c/a\u003e is the use of catalytic public or philanthropic capital to increase private sector investment in places that need it most. Convergence’s global \u003ca href=\"https://www.convergence.finance/membership\"\u003emembership\u003c/a\u003e includes public, private, and philanthropic investors as well as sponsors of transactions and funds. Members include institutions such as MacArthur Foundation, FinDev Canada, The Nature Conservancy, and Credit Suisse. Convergence offers its members a curated, online platform to connect with each other on blended finance transactions in progress, as well as exclusive access to original market intelligence and knowledge products such as case studies, reports, training, and webinars. To accelerate advances in the field, Convergence also provides grants through its \u003ca href=\"https://www.convergence.finance/design-funding\"\u003eDesign Funding\u003c/a\u003e program, for the design of blended finance vehicles that could attract private capital at scale to sustainable development.\u003c/p\u003e\n\u003cp\u003eConvergence is currently seeking a Senior Full-stack Developer to lead the development and expansion of the company’s technology offerings.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION DESCRIPTION\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis role will report to the Associate Director of Client Services and will be primarily responsible for the development and maintenance of the company’s web platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and plan new technology-related projects\u003c/li\u003e\n\u003cli\u003eImplement new features and maintain the existing web platform\u003c/li\u003e\n\u003cli\u003eImplement new CRM integrations, while maintaining existing implantations\u003c/li\u003e\n\u003cli\u003eHelp guide the company in developing its technology offering\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDESIRED QUALIFICATIONS \u0026amp; EXPERIENCE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for candidates with full-stack web development experience and a proven track record of designing, building, and maintaining services. The ideal candidate will have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExtensive experience designing and developing APIs that have been deployed to production\u003c/li\u003e\n\u003cli\u003eExperience developing front-end components for web applications\u003c/li\u003e\n\u003cli\u003eProven ability to manage projects from conception to deployment\u003c/li\u003e\n\u003cli\u003eBachelors or Master’s degree in Engineering, Computer Science, Math or relevant experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe following additional experience is highly desired:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in TypeScript, and vanilla JavaScript\u003c/li\u003e\n\u003cli\u003eExperience developing React components and developing Node.js services\u003c/li\u003e\n\u003cli\u003eDevOps experience using Amazon Web Services and Docker containers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eConvergence is headquartered in Toronto and has a flexible work environment.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eInterested and qualified applicants should send a single PDF document containing a cover letter and CV to \u003ca href=\"mailto:hr@convergence.finance\"\u003ehr@convergence.finance\u003c/a\u003e, with Senior Full-stack Developer in the subject line. We are looking to hire quickly and so will be reviewing applications on a rolling basis; the application deadline is August 14, 2020. Please note that due to the high volume of applications, we will only contact applicants selected for an interview.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e4221003f7fff618ffe3f4ac7ce260a06342f96/eventbrite%20logo.png"},{"id":"c331ea45-9ee9-4017-803b-6ff534706420","type":"Full Time","url":"https://jobs.github.com/positions/c331ea45-9ee9-4017-803b-6ff534706420","created_at":"Wed Aug 05 04:21:47 UTC 2020","company":"Xillum LLC","company_url":"https://xillum.com/","location":"Remote","title":"Full-stack Cloud Applications Developer for Xillum","description":"\u003cp\u003e\u003cstrong\u003eLocations:\u003c/strong\u003e Remote\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFull-stack Cloud Applications Developer for Xillum\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a full-stack cloud applications engineer, you will have the opportunity to help build a revolutionary software suite to transform healthcare organizations. The software suite will be a subscription-based set of hosted applications that will include operations and revenue analytics to allow healthcare organizations to focus on providing world class healthcare. The system will be focused on driving value in healthcare from revenue cycle optimization to clinical variation management.\u003c/p\u003e\n\u003cp\u003eYou will be working with the founders to build and enhance the web-based applications needed to power analytics, with a specific focus on leveraging cloud technologies to add advanced capabilities and improve application efficiency.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe expect you to have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA BA/BS degree in Computer Science, Engineering, or a related field\u003c/li\u003e\n\u003cli\u003e2-4 years of hands-on experience developing cloud, enterprise applications or analytical applications with a focus on back-end data processing and data analysis pipelines\u003c/li\u003e\n\u003cli\u003eFamiliarity with healthcare data (e.g., HL7, EDI, bills, claims) and a general interest in the healthcare industry\u003c/li\u003e\n\u003cli\u003eProven experience leveraging AWS cloud-native technologies, with specific focus on:\nBackend:  EC2, Elastic Beanstalk, S3, Route 53\nDatabase:  RDS, mySQL, SQL Server\nMachine Learning:  Amazon SageMaker\u003c/li\u003e\n\u003cli\u003eWeb application development skills including:\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eWordPress\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eCryptography Implementation (Encryption, PKI, and Hashing)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eHTML/CSS\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eWeb/database integration\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eFamiliarity with a Web scripting language (e.g., ColdFusion, .Net, JSP, PHP, Python, and/or Perl).\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eMobile application development skills including:\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eDevelopment experience in building Android/iOS Applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Java/C#\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Swift\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eA desire to identify opportunities, work independently, and lead initiatives\u003c/li\u003e\n\u003cli\u003eExcellent problem identification, analysis and solving skills.\u003c/li\u003e\n\u003cli\u003eAn innate ability to utilize all resources at your disposal to find a creative solution to a problem, whether business/functional or technical in nature\u003c/li\u003e\n\u003cli\u003eA general interest in relevant emerging technologies and a constant thirst to further your own technical abilities\u003c/li\u003e\n\u003cli\u003eExperience working in an Agile development environment\u003c/li\u003e\n\u003cli\u003eThe ability to work well independently and as a team player\u003c/li\u003e\n\u003cli\u003eExcellent conversational and written communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe would love you to have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with QlikSense or other BI/analytics tools such as Tableau, including experience integrating them into custom web applications\u003c/li\u003e\n\u003cli\u003eExperience with the full text search engine such as Elasticsearch\u003c/li\u003e\n\u003cli\u003eData modeling and solution design experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow you'll grow\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Xillum, you will have the opportunity to join the business at the ground floor helping shape the software and grow into technical, management, and leadership positions based on your interests.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Xillum, we know that happy employees make a business great.  We provide competitive benefits to attract and retain the best talent available.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eXillum’s culture\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInclusion is a major part of how we lead. It invites authenticity, leverages our diversity, and fosters well-being. We seek out and involve individuals with diverse experiences and backgrounds because we know how critical this can be in making an impact that matters to our clients and our people.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCategory:\u003c/strong\u003e Healthcare\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Xillum\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a startup company excited about bringing healthcare into a new era of leveraging machine learning and business analytics to allow healthcare providers to do what they do best, take care of their patients.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume and cover letter to \u003ca href=\"mailto:careers@xillum.com\"\u003ecareers@xillum.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8941cf66614218ac0393a27858229d578e401388/Xillum_Logo.png"},{"id":"421871bb-05d3-4fbe-b00c-3f372fa35584","type":"Full Time","url":"https://jobs.github.com/positions/421871bb-05d3-4fbe-b00c-3f372fa35584","created_at":"Tue Aug 04 17:23:12 UTC 2020","company":"Sticker Mule","company_url":"https://www.stickermule.com/careers","location":"Anywhere","title":"Javascript Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Sticker Mule\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\u003c/p\u003e\n\u003cp\u003eThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.stickermule.com/about\"\u003eSee more about our teams here\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eRemote work with flexible schedules\u003c/li\u003e\n\u003cli\u003eVaried, interesting technical challenges to solve\u003c/li\u003e\n\u003cli\u003eA fun \"no bullshit\" work environment\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWe like you to know\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eNextJS\u003c/li\u003e\n\u003cli\u003eReact\u003c/li\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eFamiliarity with Ruby\u003c/li\u003e\n\u003cli\u003eExcellent communication skills (English)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent practical experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and benefits\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e$99,000-$135,000+\u003c/li\u003e\n\u003cli\u003e$10,000 signing bonus\u003c/li\u003e\n\u003cli\u003e4 weeks vacation\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eApply here only:\u003c/strong\u003e \u003ca href=\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\"\u003ehttps://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04344d944b21465d33ecd7bd62098692640a8658/herman%206.jpg"},{"id":"12002611-44b5-42f0-b75c-1cc3c2b6eee7","type":"Full Time","url":"https://jobs.github.com/positions/12002611-44b5-42f0-b75c-1cc3c2b6eee7","created_at":"Tue Aug 04 17:05:59 UTC 2020","company":"Thought Industries","company_url":"https://www.thoughtindustries.com/","location":"Remote (USA)","title":"JavaScript Application Engineer (Remote)","description":"\u003cp\u003eWe're looking for a JavaScript Application Engineer to help us build out our SaaS Learning Business Platform. Your day to day would be split between improving existing functionality, building \u0026amp; shipping new functionality \u0026amp; integrations, and improving the platform as a whole, such as introducing bundle splitting, working on performance, and upgrading our dependencies.\u003c/p\u003e\n\u003cp\u003eYou would be a good fit if:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are excited about new JavaScript technologies like Prettier and GraphQL, but also comfortable mixing them with older technology.\u003c/li\u003e\n\u003cli\u003eYou sweat the small stuff, but know when to ship it.\u003c/li\u003e\n\u003cli\u003eYou are passionate about listening to users \u0026amp; building elegant web products.\u003c/li\u003e\n\u003cli\u003eYou are comfortable navigating a large existing codebase and learning new technologies and techniques along the way.\u003c/li\u003e\n\u003cli\u003eYou have 2+ years of experience working in a team production environment shipping code.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking to add multiple team members across frontend and backend roles, so we are open to your experience across the stack.\u003c/p\u003e\n\u003cp\u003eOur stack consists primarily of Node.js with Koa, GraphQL, and Ember.js. Although we are an Ember shop, we are open to any framework experience you might have as the concepts will likely be familiar.\u003c/p\u003e\n\u003cp\u003eThroughout the day, we rely on Slack and GitHub pull requests. The development team is completely distributed across the US, and has been since the inception of Thought Industries — we haven't bolted on remote processes due to COVID-19, we've always done it this way, so you'll feel right at home.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Thought Industries\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThought Industries is a startup in the Online Learning space. We enable training and software companies to launch and monetize external learning programs — think Shopify meets Udemy/Coursera.\u003c/p\u003e\n\u003cp\u003eThis is a full-time position that is based at your remote U.S. based office. No Recruiters, please.\u003c/p\u003e\n\u003cp\u003eHeadquartered in Boston, Massachusetts, Thought Industries is one of the world’s fastest-growing online learning companies in the U.S. We are helping consumer brands and for-profit learning organizations change how they build, deploy and grow online learning businesses. Today, hundreds of customers and brands are using the Thought Industries’ Learning Business Platform to transform the way they reach, teach, and engage audiences.\u003c/p\u003e\n\u003cp\u003eWe are a growing, well-funded technology company, with a talented team and a clear vision. This is a unique opportunity to take a lead role at an exciting SaaS software company with a robust cloud-based platform. We hire talented people who are self-motivated and team orientated. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or veteran status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease submit a cover letter explaining what kind of role you are looking for and why Thought Industries specifically interests you along with your resume to \u003ca href=\"mailto:devjob@thoughtindustries.com\"\u003edevjob@thoughtindustries.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbk9IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf8ef4a52a69fc2375b11d224b655c662fecd537/logo.png"},{"id":"df4c0214-e31f-4bed-9d8c-3222c35ac914","type":"Full Time","url":"https://jobs.github.com/positions/df4c0214-e31f-4bed-9d8c-3222c35ac914","created_at":"Tue Aug 04 00:28:28 UTC 2020","company":"Car Registration, inc. ","company_url":"http://www.carregistration.com","location":"Elk Grove, CA","title":"Software Engineer","description":"\u003cp\u003eCar Registration, Inc.\u003c/p\u003e\n\u003cp\u003eCar Registration, Inc. (CRI) provides comprehensive, on-line vehicle registration and titling services for consumers who desire or need a DMV alternative.  Currently licensed and bonded under the California DMV’s Business Partner Automation program, CRI successfully processes over 250,000 transactions per year while reducing wait times and allowing the CA DMV to reallocate its resources to other services and administrative tasks.  With CRI, customers can get same-day processing, next day delivery and comprehensive telephone and email support.  Through its website, CRI collects fees from vehicle owners, transmits fees to the DMV in real time and issues registration cards and stickers to the customer via USPS or express courier.\u003c/p\u003e\n\u003cp\u003eJob Description\nCRI, is a leader in providing consumers direct access to DMV services through our online technology. We provide customers the ability to skip the line at the DMV by using our online platform to renew, replace, or transfer their vehicle registration and title. You will join a small but profitable start-up with the ability to shape and grow our software. We are looking for a self-motivated developer that is comfortable working on a cloud-based full stack built with Go, PHP, and JavaScript for both customer-facing and internal applications. In your role, you will join a small team of software developers to build new software, new features, and maintain existing functionality.\u003c/p\u003e\n\u003cp\u003eThis is a full-time remote position with competitive salary and benefits including medical, dental, vision, 401K plan and more. We are based in Elk Grove, CA. Though you won’t work in the office, we regularly communicate via Slack and Google Meets. Our annual holiday party is fun and inclusive and offers a great opportunity to catch-up with the team in person.\u003c/p\u003e\n\u003cp\u003eSkills \u0026amp; Requirements\n1+ year professional coding with Golang\n3+ years professional coding with PHP, Python, Ruby, or another server-side scripting language\n2+ years professional coding with JavaScript\n3+ years professional experience using a SQL database such as PostgreSQL, MySQL, Oracle, or MSSQL\nExperience integrating RESTful and/or gRPC APIs\nAbility to design and implement solutions to both frontend and backend problems from a non-technical specification into a finished feature\nExposure to DevOps practices including infrastructure as code, continuous integration, monitoring, and logging\nComfortable developing in a Mac or Linux environment\nFamiliarity with event-based functional architectures\nFamiliarity with MVC or MVVM architectures\nSecurity-conscious practices in any software built\u003c/p\u003e\n\u003cp\u003eDesirable Qualifications\nExperience with cloud-based distributed systems on providers such as AWS\nExperience with docker or container technologies\nExperience with CDNs\nExperience developing web-based business applications with complex workflows\nDatabase administration experience including setting up and maintaining replication servers\nBachelor’s degree, preferably in Computer Science or related discipline\u003c/p\u003e\n\u003cp\u003eIf you are interested, please send your resume to \u003ca href=\"mailto:Jobs@carregistration.com\"\u003eJobs@carregistration.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCANDIDATES only please.\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer\nCRI is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.\u003c/p\u003e\n\u003cp\u003eIt is an objective of CRI to achieve a drug-free workplace. Any applicant for  employment will be expected to behave in accordance with this objective.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf you are interested, please send your resume to \u003ca href=\"mailto:Jobs@carregistration.com\"\u003eJobs@carregistration.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbG1IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--72882d4c37d2fd5cf977485d033eeaafee596f34/CarRegistration_Logo-02.png"},{"id":"534af056-a770-421a-afd0-4734c464fb5e","type":"Full Time","url":"https://jobs.github.com/positions/534af056-a770-421a-afd0-4734c464fb5e","created_at":"Mon Aug 03 20:26:45 UTC 2020","company":"Agiloft","company_url":"http://agiloft.com","location":"Russia","title":"Sr. Front End Developer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Front End Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Front End Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Senior Front-End Developer will join the development team responsible for implementation, improvement and maintenance of the Agiloft frontend architecture. The ideal candidate will have demonstrated experience with the development and maintenance of Enterprise-grade applications as well as the application of modern frontend frameworks.\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, and maintain efficient, reusable, and reliable front-end code.\u003c/li\u003e\n\u003cli\u003eBuild cross-browser solutions optimized for a wide range of devices.\u003c/li\u003e\n\u003cli\u003eIdentify UI problems and bugs and devise elegant solutions.\u003c/li\u003e\n\u003cli\u003eMake strategic technical decisions related to new products and functionalities.\u003c/li\u003e\n\u003cli\u003eHelp maintain code quality.\u003c/li\u003e\n\u003cli\u003eOnboard and mentor new team members.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA minimum of three years of experience in working on large projects/Enterprise applications including, but not limited to version control tools, automated software testing, automating software build tools\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong knowledge of HTML5, CSS3, JavaScript and modern frontend development frameworks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledgeable about UI development concepts like Responsive Design, SPA, Modular Design\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking knowledge of Java\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStruts 2, JSP\u003c/li\u003e\n\u003cli\u003ePopular JS frameworks like Vue, React, Angular\u003c/li\u003e\n\u003cli\u003eRelational databases such as MySQL, MSSQL, Oracle\u003c/li\u003e\n\u003cli\u003eRest API implementation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eINTERESTED? APPLY NOW!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor a full list of open positions and to submit your application, go to our website \u003ca href=\"http://www.agiloft.com/jobs.htm\"\u003ehttp://www.agiloft.com/jobs.htm\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3FIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--405c1ff0ada5560604737daa783da21f32fd1349/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"2c8e5e58-e151-41c8-936a-3036eb9e91d6","type":"Full Time","url":"https://jobs.github.com/positions/2c8e5e58-e151-41c8-936a-3036eb9e91d6","created_at":"Mon Aug 03 19:19:22 UTC 2020","company":"Agiloft","company_url":"http://agiloft.com","location":"Russia","title":"Dev Ops Engineer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Java Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Java Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003eWe are seeking a DevOps Engineer to join our engineering team. The ideal candidate is someone who has a solid background in software development infrastructure architecture, automation, configuration management, monitoring, and tools development for enterprise software and systems. The candidate must have a passion for automating everything, and a sense of ownership.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop new automation systems and improve existing ones that enable fast delivery and replace manual operating procedures wherever they exist\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDrive analysis, design, and development of automation tools for deployment, development, and operational tasks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead architectural improvements in our software development- and delivery infrastructure and evaluate new technologies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAssume ownership of Agiloft’s installer\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least two years of hands-on experience as DevOps engineer\u003c/li\u003e\n\u003cli\u003eExperience with configuration management systems\u003c/li\u003e\n\u003cli\u003eExperience with the configuration of Linux and Windows operating systems\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Python- or Perl scripting languages\u003c/li\u003e\n\u003cli\u003eExperienced with Java\u003c/li\u003e\n\u003cli\u003eGood knowledge of Install4J\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePREFERRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComputer Science degree or equivalent\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration / either continuous delivery tools\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Unix bash or Windows powershell\u003c/li\u003e\n\u003cli\u003eExperience using containers\u003c/li\u003e\n\u003cli\u003eExperience supporting MySQL/MSSQL databases\u003c/li\u003e\n\u003cli\u003eExperience with public cloud platforms\u003c/li\u003e\n\u003cli\u003eExperience working in distributed teams\u003c/li\u003e\n\u003cli\u003eFluent in English language\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTo Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--559a8bf372b62f7222ca5bc3fc7fc8868d20e089/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"aa274e93-f888-4180-899a-4c13de6dd637","type":"Full Time","url":"https://jobs.github.com/positions/aa274e93-f888-4180-899a-4c13de6dd637","created_at":"Fri Jul 31 22:43:56 UTC 2020","company":"Agiloft","company_url":"http://agiloft.com","location":"India","title":"Dev Ops Engineer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Java Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Java Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003eWe are seeking a DevOps Engineer to join our engineering team. The ideal candidate is someone who has a solid background in software development infrastructure architecture, automation, configuration management, monitoring, and tools development for enterprise software and systems. The candidate must have a passion for automating everything, and a sense of ownership.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop new automation systems and improve existing ones that enable fast delivery and replace manual operating procedures wherever they exist\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDrive analysis, design, and development of automation tools for deployment, development, and operational tasks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead architectural improvements in our software development- and delivery infrastructure and evaluate new technologies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAssume ownership of Agiloft’s installer\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least two years of hands-on experience as DevOps engineer\u003c/li\u003e\n\u003cli\u003eExperience with configuration management systems\u003c/li\u003e\n\u003cli\u003eExperience with the configuration of Linux and Windows operating systems\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Python- or Perl scripting languages\u003c/li\u003e\n\u003cli\u003eExperienced with Java\u003c/li\u003e\n\u003cli\u003eGood knowledge of Install4J\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePREFERRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComputer Science degree or equivalent\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration / either continuous delivery tools\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Unix bash or Windows powershell\u003c/li\u003e\n\u003cli\u003eExperience using containers\u003c/li\u003e\n\u003cli\u003eExperience supporting MySQL/MSSQL databases\u003c/li\u003e\n\u003cli\u003eExperience with public cloud platforms\u003c/li\u003e\n\u003cli\u003eExperience working in distributed teams\u003c/li\u003e\n\u003cli\u003eFluent in English language\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTo Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--db2c5c1d04e63a9c74d2eececa0240a6ca5eea93/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"467c9673-9f0f-4ecf-af99-1a91a790f8b2","type":"Full Time","url":"https://jobs.github.com/positions/467c9673-9f0f-4ecf-af99-1a91a790f8b2","created_at":"Fri Jul 31 21:36:32 UTC 2020","company":"Agiloft ","company_url":"http://www.agiloft.com","location":"India","title":" Sr. Front End Developer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Front End Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Front End Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Senior Front-End Developer will join the development team responsible for implementation, improvement and maintenance of the Agiloft frontend architecture. The ideal candidate will have demonstrated experience with the development and maintenance of Enterprise-grade applications as well as the application of modern frontend frameworks.\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, and maintain efficient, reusable, and reliable front-end code.\u003c/li\u003e\n\u003cli\u003eBuild cross-browser solutions optimized for a wide range of devices.\u003c/li\u003e\n\u003cli\u003eIdentify UI problems and bugs and devise elegant solutions.\u003c/li\u003e\n\u003cli\u003eMake strategic technical decisions related to new products and functionalities.\u003c/li\u003e\n\u003cli\u003eHelp maintain code quality.\u003c/li\u003e\n\u003cli\u003eOnboard and mentor new team members.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA minimum of three years of experience in working on large projects/Enterprise applications including, but not limited to version control tools, automated software testing, automating software build tools\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong knowledge of HTML5, CSS3, JavaScript and modern frontend development frameworks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledgeable about UI development concepts like Responsive Design, SPA, Modular Design\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking knowledge of Java\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStruts 2, JSP\u003c/li\u003e\n\u003cli\u003ePopular JS frameworks like Vue, React, Angular\u003c/li\u003e\n\u003cli\u003eRelational databases such as MySQL, MSSQL, Oracle\u003c/li\u003e\n\u003cli\u003eRest API implementation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eINTERESTED? APPLY NOW!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor a full list of open positions and to submit your application, go to our website \u003ca href=\"http://www.agiloft.com/jobs.htm\"\u003ehttp://www.agiloft.com/jobs.htm\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d382a9619048c4335f6a0c9d5e7a003d4daf4ae4/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"3be8c3d7-88a1-47c7-b6fa-9027e35b3d1b","type":"Full Time","url":"https://jobs.github.com/positions/3be8c3d7-88a1-47c7-b6fa-9027e35b3d1b","created_at":"Fri Jul 31 19:01:00 UTC 2020","company":"Last Call Media","company_url":"https://lastcallmedia.com/","location":"Remote","title":"Backend JavaScript Developer (Remote)","description":"\u003cp\u003e\u003ca href=\"https://lastcallmedia.com/careers\"\u003eLast Call Media\u003c/a\u003e is looking for a backend JavaScript developer with experience building and testing web applications!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLast Call Media is looking for someone with a passion for building and testing modern, state-of-the-art web applications. We are seeking either a full-time employee or a contract-to-hire arrangement.\u003c/p\u003e\n\u003cp\u003eThe ideal candidate will have experience using NodeJS, Typescript, and Cypress, and backend framework experience (Express, Koa or similar).  Continuous Integration/Testing experience (GitHub Actions, CircleCI) would be a bonus, as would frontend experience (React, Vue, Svelte).  We are looking for an advocate of best practices and someone who is willing to be opinionated about what they believe in when it comes to building successful programming projects. The ideal candidate will be able to discuss requirements, provide feedback, and eventually develop the final product to specification.\u003c/p\u003e\n\u003cp\u003eLast Call Media is a \u003ca href=\"https://www.youtube.com/watch?v=O8-PxC_-KtA\u0026amp;feature=youtu.be\"\u003efully distributed company\u003c/a\u003e, so you can work from anywhere, but we ask that you be able to commit to at least 5 hours of overlap with New York time (ET), Monday through Friday.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with team members to design and implement automated tests for large, distributed systems.\u003c/li\u003e\n\u003cli\u003eWork with team members to develop and implement large, distributed systems.\u003c/li\u003e\n\u003cli\u003eParticipate in team and company retrospectives to help define and refine working agreements and processes to help us work more effectively together as a team.\u003c/li\u003e\n\u003cli\u003eWork with frontend and full-stack developers to define data requirements and interoperability.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA proven track record of leading the delivery of digital products and services that delight customers. Specifically, we’re looking for completed projects that leverage NodeJS, Typescript, and/or Cypress.\u003c/li\u003e\n\u003cli\u003e*2+ years of similar experience in a digital agency, consultancy, or equivalent setting where you were accountable to several client engagements.\u003c/li\u003e\n\u003cli\u003eAn obvious drive to grow and learn from the highly-skilled team around you.\u003c/li\u003e\n\u003cli\u003eExperience and/or a desire to work remotely.\u003c/li\u003e\n\u003cli\u003eAbility to work efficiently, sometimes under tight deadlines\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIt’d be nice if you also had:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong opinions about testing.\u003c/li\u003e\n\u003cli\u003eExperience implementing Continuous Integration solutions using GitHub Actions, CircleCI, or similar.\u003c/li\u003e\n\u003cli\u003eExperience with Serverless deployment (the concept, not the framework).\u003c/li\u003e\n\u003cli\u003eExperience with frontend JavaScript frameworks (eg: React), either as a developer, or working directly with frontend developers.\u003c/li\u003e\n\u003cli\u003eExperience working on a project integrating many different languages or components.\u003c/li\u003e\n\u003cli\u003eUnderstanding of backend performance, and experience optimizing performance, including API call optimization.\u003c/li\u003e\n\u003cli\u003eGeneral comfort with Linux environments.\u003c/li\u003e\n\u003cli\u003eFamiliarity with Atlassian tools, such as Jira and Confluence.\u003c/li\u003e\n\u003cli\u003eAll of us at LCM pride ourselves on being:\u003c/li\u003e\n\u003cli\u003eAble to empathize, which helps us understand the needs of the client, the customer, the product, and the team at LCM.\u003c/li\u003e\n\u003cli\u003eHighly communicative\u003c/li\u003e\n\u003cli\u003eAble to work independently\u003c/li\u003e\n\u003cli\u003eComfortable asking for help\u003c/li\u003e\n\u003cli\u003eExperienced with communicating directly with clients\u003c/li\u003e\n\u003cli\u003eEager and motivated to learn new concepts\u003c/li\u003e\n\u003cli\u003eA team player in a collaborative environment\u003c/li\u003e\n\u003cli\u003eA fast learner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication Process:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApplicants should submit through the \u003ca href=\"https://lastcallmedia.freshteam.com/jobs/qFwXZ6MLqT4V/backend-javascript-developer-remote?jobId=qFwXZ6MLqT4V\u0026amp;utm_source=GitHub_2000146421\u0026amp;utm_medium=Premium%20Job%20Boards_2000022221\"\u003ecareers section\u003c/a\u003e a current resume and cover letter that includes links to a few digital products you completed recently and an answer to the following question: In 3-5 sentences describe 1 thing you would change about working remotely. If you haven’t worked remotely, please try and answer the question anyway! Lastly, while resumes and interviews are a great way to learn more about you, all candidates should be prepared to complete a brief hypothetical virtual recruitment exercise and submit reference(s) upon request.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTo apply visit our \u003ca href=\"https://lastcallmedia.freshteam.com/jobs/qFwXZ6MLqT4V/backend-javascript-developer-remote?jobId=qFwXZ6MLqT4V\u0026amp;utm_source=GitHub_2000146421\u0026amp;utm_medium=Premium%20Job%20Boards_2000022221\"\u003ecareers section\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe starting salary for this position is $50-90k, commensurate with experience, with comprehensive benefits including an annual professional development budget, and varied, engaging work for enterprise-level clients. If this position already sounds like you or sounds like where you're headed, please reach out! Applicants should submit a current resume and cover letter through the \u003ca href=\"https://lastcallmedia.freshteam.com/jobs/qFwXZ6MLqT4V/backend-javascript-developer-remote?jobId=qFwXZ6MLqT4V\u0026amp;utm_source=GitHub_2000146421\u0026amp;utm_medium=Premium%20Job%20Boards_2000022221\"\u003ecareers section\u003c/a\u003e and should be prepared to submit a code sample(s) and reference(s) upon request.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApplicants should submit through the \u003ca href=\"https://lastcallmedia.freshteam.com/jobs/qFwXZ6MLqT4V/backend-javascript-developer-remote?jobId=qFwXZ6MLqT4V\u0026amp;utm_source=GitHub_2000146421\u0026amp;utm_medium=Premium%20Job%20Boards_2000022221\"\u003ecareers section\u003c/a\u003e a current resume and cover letter that includes links to a few digital products you completed recently and an answer to the following question: In 3-5 sentences describe 1 thing you would change about working remotely. If you haven’t worked remotely, please try and answer the question anyway! Lastly, while resumes and interviews are a great way to learn more about you, all candidates should be prepared to complete a brief hypothetical virtual recruitment exercise and submit reference(s) upon request.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaW1IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae392a545e74aa9cf544d07cc1c739d4a868af93/LOGO.png"},{"id":"ea13c3a1-07fa-4e4e-8a35-dd830d37d38f","type":"Full Time","url":"https://jobs.github.com/positions/ea13c3a1-07fa-4e4e-8a35-dd830d37d38f","created_at":"Fri Jul 31 09:15:20 UTC 2020","company":"i22 Digitalagentur GmbH","company_url":"https://www.i22.de/","location":"Bonn","title":"Senior Software Developer – Front-End (m/w/x)","description":"\u003cp\u003eWir bieten Dir ein smartes Team, eine moderne Arbeitsumgebung und die Möglichkeit, Dich ständig weiterzuentwickeln.\u003c/p\u003e\n\u003ch2\u003eDAS UNTERNEHMEN\u003c/h2\u003e\n\u003cp\u003eWir sind die Agentur für eine softwarebasierte Welt. Unsere DNA ist zu 100 % digital – wir konzipieren, designen und entwickeln technologiegetriebene Produkte und Services für die digitale Zukunft und helfen Unternehmen, wie eine moderne Software Company zu denken.\u003c/p\u003e\n\u003ch2\u003eDIE STELLE\u003c/h2\u003e\n\u003cp\u003eWir suchen einen ambitionierten Coder, der für sein Fachgebiet brennt. Dabei ist uns egal, ob Du Autodidakt, Student, graduiert oder Professional bist: für uns zählen Motivation, Kompetenz und Einsatz. Wir bieten Dir ein attraktives Gehalt plus Erfolgsbeteiligung und hervorragende Entwicklungsmöglichkeiten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNEUES DENKEN:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVue, React oder doch Vanilla? Bei uns hast Du die Freiheit, Dein eigenes Know-how einzubringen und auszubauen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNEUES ARBEITEN:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVertrauensarbeitszeit, freie Wahl des Arbeitsortes, moderne Organisationsprinzipien\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNEUE TOOLS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOffice mit Top-Ausstattung, freie Wahl Deiner Hard- und Software\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU BRINGST MIT\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDu kennst Dich bestens mit HTML5 und SCSS aus und benennst Deine Klassen nach System, idealerweise nach BEM\u003c/li\u003e\n\u003cli\u003eDu sprichst fließend JavaScript und beherrschst zumindest ein SPA-Framework bzw. eine Library wie Vue oder React\u003c/li\u003e\n\u003cli\u003eDu bist Git-Experte und hast bereits Erfahrungen mit automatisierten Software-Tests gesammelt\u003c/li\u003e\n\u003cli\u003eDu hast Spaß daran, deine Erfahrungen und Learnings im Team zu teilen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU BIST VERANTWORTLICH FÜR\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEntwicklung, Konzeption und Programmierung anspruchsvoller Frontend-Anwendungen\u003c/li\u003e\n\u003cli\u003eErstellung von Frontend-Komponenten und responsiven Websites\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDER STANDORT\u003c/h2\u003e\n\u003cp\u003eBonn gehört in puncto Lebensqualität zu den Top-Städten in Deutschland. Die Agentur befindet sich in direkter Nähe zum Rheinufer und bietet eine hervorragende Verkehrsanbindung und Infrastruktur.\u003c/p\u003e\n\u003ch2\u003eWARUM DU DICH NOCH HEUTE BEI UNS BEWERBEN SOLLTEST\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAttraktives Gehalt plus Erfolgsbeteiligung\u003c/li\u003e\n\u003cli\u003eWeiterbildungsmöglichkeiten \u0026amp; Austausch unter Gleichgesinnten\u003c/li\u003e\n\u003cli\u003eEin Team, mit dem man auch nach Feierabend noch ein Bier trinken kann!\u003c/li\u003e\n\u003cli\u003eVertrauensarbeitszeit und komplette Flexibilität in der Wahl deines Arbeitsorts\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU WILLST DABEI SEIN?\u003c/h2\u003e\n\u003cp\u003eDann schicke Deine Bewerbung mit Gehaltswunsch, einer umwerfenden Referenz und dem nächstmöglichem Starttermin an \u003ca href=\"mailto:jobs@i22.de\"\u003ejobs@i22.de\u003c/a\u003e oder nutze das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e oder unser Online-Tool .\u003c/p\u003e\n\u003ch2\u003eDEIN KONTAKT\u003c/h2\u003e\n\u003cp\u003eNina Cöster\nDirector HR\n+49 228 9498354\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2BFFnWT\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2BFFnWT\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7a235b37d825a60ef5c9b410bea40dafd0152ac0/i22%202.jpg"},{"id":"baf67d2a-47ab-4198-9168-abaeb48b2dee","type":"Full Time","url":"https://jobs.github.com/positions/baf67d2a-47ab-4198-9168-abaeb48b2dee","created_at":"Fri Jul 31 08:45:54 UTC 2020","company":"i22 Digitalagentur GmbH","company_url":"https://www.i22.de/","location":"deutschlandweit","title":"Senior Software Developer (m/w/x)- Front-End (Remote)","description":"\u003cp\u003eWir suchen einen ambitionierten Coder, der für sein Fachgebiet brennt und auch mal über den Tellerrand etablierter Prozesse schaut.\u003c/p\u003e\n\u003ch2\u003eDAS UNTERNEHMEN\u003c/h2\u003e\n\u003cp\u003ei22 arbeitet für technologieaffine Marken, die das Potenzial der digitalen Transformation voll ausschöpfen wollen. Mit über 100 Experten kreieren wir digitale Lösungen, die Bedürfnisse und Technologien intelligent miteinander verbinden. Wenn Du Dir viel vorgenommen hast und noch mehr erreichen willst, bist Du bei uns genau richtig. Denn wir haben für die Zukunft Großes vor.\u003c/p\u003e\n\u003ch2\u003eDIE STELLE\u003c/h2\u003e\n\u003cp\u003eWir suchen einen ambitionierten Coder, der für sein Fachgebiet brennt und auch mal über den Tellerrand etablierter Prozesse schaut. Dabei ist uns egal, ob Du Autodidakt, Student, graduiert oder Professional bist: für uns zählen Motivation, Kompetenz und Einsatz. Wir bieten Dir ein attraktives Gehalt plus Erfolgsbeteiligung und hervorragende Entwicklungsmöglichkeiten. Bei uns zählt nicht von wo du arbeitest, sondern nur, was du kannst.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNEUES DENKEN:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVue, React oder doch Vanilla? Bei uns hast Du die Freiheit, Dein eigenes Know-how einzubringen und auszubauen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNEUES ARBEITEN:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eVertrauensarbeitszeit, freie Wahl des Arbeitsortes, moderne Organisationsprinzipien\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNEUE TOOLS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOffice mit Top-Ausstattung, freie Wahl Deiner Hard- und Software\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU BRINGST MIT\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eDu kennst Dich bestens mit HTML5 und SCSS aus und benennst Deine Klassen nach System, idealerweise nach BEM\u003c/li\u003e\n\u003cli\u003eDu sprichst fließend JavaScript und beherrschst zumindest ein SPA-Framework bzw. eine Library wie Vue oder React\u003c/li\u003e\n\u003cli\u003eDu bist Git-Experte und hast bereits Erfahrungen mit automatisierten Software-Tests gesammelt\u003c/li\u003e\n\u003cli\u003eDu hast Spaß daran, deine Erfahrungen und Learnings im Team zu teilen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU BIST VERANTWORTLICH FÜR\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEntwicklung, Konzeption und Programmierung anspruchsvoller Frontend-Anwendungen\u003c/li\u003e\n\u003cli\u003eErstellung von Frontend-Komponenten und responsiven Websites\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDER STANDORT\u003c/h2\u003e\n\u003cp\u003eUm dir unnötiges Pendeln zu ersparen, kannst du gerne bequem von zu Hause oder unterwegs arbeiten. Du entscheidest, von wo du arbeitest!\u003c/p\u003e\n\u003cp\u003eDie Agentur selbst befindet sich in direkter Nähe zum Rheinufer und bietet eine hervorragende Verkehrsanbindung und Infrastruktur.\u003c/p\u003e\n\u003ch2\u003eWARUM DU DICH NOCH HEUTE BEI UNS BEWERBEN SOLLTEST\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAttraktives Gehalt plus Erfolgsbeteiligung\u003c/li\u003e\n\u003cli\u003eWeiterbildungsmöglichkeiten \u0026amp; Austausch unter Gleichgesinnten\u003c/li\u003e\n\u003cli\u003eEin Team, mit dem man auch nach Feierabend noch ein Bier trinken kann!\u003c/li\u003e\n\u003cli\u003eVertrauensarbeitszeit und komplette Flexibilität in der Wahl deines Arbeitsorts\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eDU WILLST DABEI SEIN?\u003c/h2\u003e\n\u003cp\u003eDann schicke Deine Bewerbung mit Gehaltswunsch, einer umwerfenden Referenz und dem nächstmöglichem Starttermin an \u003ca href=\"mailto:jobs@i22.de\"\u003ejobs@i22.de\u003c/a\u003e oder nutze das \u003cstrong\u003eBewerbungsformular\u003c/strong\u003e oder unser Online-Tool .\u003c/p\u003e\n\u003ch2\u003eDEIN KONTAKT\u003c/h2\u003e\n\u003cp\u003eNina Cöster\nDirector HR\n+49 228 9498354\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/2EouTfm\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2EouTfm\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5925e6221e88ac6adae077e204c97d72b6015c74/i22%202.jpg"},{"id":"208271fd-c8f4-4e50-a2e0-adef58bb9ef0","type":"Full Time","url":"https://jobs.github.com/positions/208271fd-c8f4-4e50-a2e0-adef58bb9ef0","created_at":"Thu Jul 30 14:28:18 UTC 2020","company":"i22 Digitalagentur GmbH","company_url":"http://www.i122.de","location":"Bonn","title":"SOFTWARE DEVELOPER (M/W/X) – RUBY ON RAILS \u0026 ELIXIR (REMOTE)","description":"\u003ch2\u003e\u003cstrong\u003eWIR SUCHEN:\u003c/strong\u003e\u003c/h2\u003e\n\u003ch2\u003e\u003cstrong\u003eSOFTWARE DEVELOPER (M/W/X) – RUBY ON RAILS \u0026amp; ELIXIR (REMOTE)\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWir bieten Dir eine fantastische Teamkultur, freie Sprachen- \u0026amp; Frameworkwahl und eine moderne Arbeitsumgebung\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDAS UNTERNEHMEN\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWir sind die Agentur für eine softwarebasierte Welt. Unsere DNA ist zu 100 % digital – wir konzipieren, designen und entwickeln technologiegetriebene Produkte und Services für die digitale Zukunft und helfen Unternehmen, wie eine moderne Software Company zu denken.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDIE STELLE\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWir suchen einen ambitionierten Software-Entwickler, der für sein Fachgebiet brennt. Dabei ist uns egal, ob Du Autodidakt, Student, graduiert oder Professional bist: Für uns zählen Motivation, Kompetenz und Einsatz. Wir bieten Dir ein attraktives Gehalt plus Erfolgsbeteiligung, hervorragende Entwicklungsmöglichkeiten und eine wunderbare Teamkultur. Bei uns zählt nicht von wo du arbeitest, sondern nur, was du kannst.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eNEUES DENKEN:\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eUmsetzungsfreiheit mit freier Sprachen- \u0026amp; Frameworkwahl\u003c/p\u003e\n\u003ch2\u003e​\n\u003cstrong\u003eNEUES ARBEITEN:\u003c/strong\u003e\n\u003c/h2\u003e\n\u003cp\u003eVertrauensarbeitszeit, freie Wahl des Arbeitsortes, moderne Organisationsprinzipien, ein sympathisches und versiertes Team\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eNEUE TOOLS:\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eOffice mit Top-Ausstattung, freie Wahl Deiner Hard- und Software\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDU BRINGST MIT\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003esehr gute Kenntnisse in Ruby on Rails, Phoenix (Elixir)\u003c/li\u003e\n\u003cli\u003egute Expertise im Bereich Datenbanken (bspw, PostgreSQL, MySQL, Redis, Elasticsearch etc.)\u003c/li\u003e\n\u003cli\u003eidealerweise Erfahrung mit gängigen Test-Frameworks (z.B. RSpec, Minitest, ExUnit etc.) und Versionierung Git/Gitlab\u003c/li\u003e\n\u003cli\u003eBonus: Als Full-Stack-Developer besitzt Du zusätlich gute Kenntnisse in Vue.js oder React, inklusive JavaScript, HTML und CSS\n​\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eDU BIST VERANTWORTLICH FÜR\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eKonzeption und Entwicklung von komplexen Software- und E-Commerce-Lösungen, Software-Systemen, Intranet-Anwendungen und Schnittstellen\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eDER STANDORT\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eUm dir unnötiges Pendeln zu ersparen, kannst du gerne bequem von zu Hause oder unterwegs arbeiten. Du entscheidest, von wo du arbeitest!\u003c/p\u003e\n\u003cp\u003eDie Agentur selbst befindet sich in direkter Nähe zum Rheinufer und bietet eine hervorragende Verkehrsanbindung und Infrastruktur.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eWARUM DU DICH NOCH HEUTE BEI UNS BEWERBEN SOLLTEST\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAttraktives Gehalt plus Erfolgsbeteiligung\u003c/li\u003e\n\u003cli\u003eEin Team, mit dem man auch nach Feierabend noch ein Bier trinken kann\u003c/li\u003e\n\u003cli\u003eVertrauensarbeitszeit und komplette Flexibilität in der Wahl deines Arbeitsorts\n​\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eDU WILLST DABEI SEIN?\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eDann schicke Deine Bewerbung mit Gehaltswunsch, einer umwerfenden Referenz und dem nächstmöglichem Starttermin über den \u003cstrong\u003eBewerben-Button\u003c/strong\u003e, an \u003ca href=\"mailto:jobs@i22.de\"\u003ejobs@i22.de\u003c/a\u003e oder nutze unser Online-Tool .\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3fbcpeW\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eDEIN KONTAKT\nNina Cöster\nDirector HR\n+49 228 9498354\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3fbcpeW\"\u003eKlick hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c31caf0666b587ddd248ec6a28ac3a14a51d20e0/companyLogo-i22-profilepic@3x%20(1).jpg"},{"id":"92d9a727-0ef3-40bf-a967-17d9e8d8449b","type":"Full Time","url":"https://jobs.github.com/positions/92d9a727-0ef3-40bf-a967-17d9e8d8449b","created_at":"Fri Jul 31 06:52:53 UTC 2020","company":"CERN","company_url":"http:","location":"Geneva","title":"Full-stack Software Engineer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eAt CERN, the European Organization for Nuclear Research, physicists and engineers are probing the fundamental structure of the universe. Using the world's largest and most complex scientific instruments, they study the basic constituents of matter - fundamental particles that are made to collide together at close to the speed of light. The process gives physicists clues about how particles interact, and provides insights into the fundamental laws of nature. Find out more on \u003ca href=\"http://home.cern\"\u003ehttp://home.cern\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eIntroduction\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced and motivated Java developer with a passion for delivering complex and compelling information systems end-to-end? Are you at ease with server-side technologies, and also with writing frontends in JavaScript and not afraid to optimise database queries, to dive into data integration processes or to configure and debug messaging/eventing systems? Then join an agile team of talented software developers and contribute to application software for CERN's Corporate Information Systems. CERN, take part!\u003c/p\u003e\n\u003cp\u003eYou will join the Business Computing Group (BC), where 70+ talented international colleagues are responsible for delivering information systems for all of CERN’s business functions.\u003c/p\u003e\n\u003cp\u003eThe product management driven group is working for clients across the whole Organisation (HR, Finance, Planning, Safety, Security, Purchasing, Logistics, and Accelerator Operations). The type of products under the group’s responsibility ranges from custom-made solutions for a few users to large and widely integrated systems with 15,000+ users. Hence, working for the BC group provides numerous perspectives for being in touch with different technologies and business areas.\u003c/p\u003e\n\u003ch2\u003eFunctions\u003c/h2\u003e\n\u003cp\u003eAs a Full Stack Software Engineer, you will join a self-organised agile product team and you will be responsible for maintaining, evolving, and re-engineering CERN’s administrative information systems, aligned with the group's strategy to modernise, replace, and consolidate legacy architectures and business-critical applications. More specifically, you will take on the following responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, develop, and test new features and software components for all layers of modern applications (e.g. frontend, backend, persistence, search, ETL, messaging, reporting etc.).\u003c/li\u003e\n\u003cli\u003eConfigure third-party provided software systems and integrate them into the group's application infrastructure.\u003c/li\u003e\n\u003cli\u003eParticipate in, and lead cross-team technical initiatives and deliver proof of concepts demonstrating product feasibility.\u003c/li\u003e\n\u003cli\u003eMaintain and improve group-wide high standards and guidelines of software engineering practices.\u003c/li\u003e\n\u003cli\u003eIdentify areas of improvement in the technology landscape of the group, and recommend solutions.\u003c/li\u003e\n\u003cli\u003eMentor junior software developers.\u003c/li\u003e\n\u003cli\u003eProvide user support including analysing user requirements, synthesizing, specifying and following-up on both software- and non-software related issues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cp\u003eMaster's degree or equivalent relevant experience in the field of computer science or a related field.\u003c/p\u003e\n\u003ch2\u003eExperience:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in the design and development of Java-based enterprise solutions built on top of industry standards (e.g. Spring Framework, Spring Boot).\u003c/li\u003e\n\u003cli\u003eExperience with modern software architectures and API design.\u003c/li\u003e\n\u003cli\u003eExperience with object-oriented and functional programming paradigms, design and architectural patterns, and their application in the Java ecosystem.\u003c/li\u003e\n\u003cli\u003eExperience with modern software development life cycles and CI/CD processes.\u003c/li\u003e\n\u003cli\u003eExperience with SQL, database systems, and their integration with Java applications.\u003c/li\u003e\n\u003cli\u003eExperience with frontend technologies, and in particular JavaScript and related key frameworks (e.g. React, Vue etc.).\u003c/li\u003e\n\u003cli\u003eAt ease with Java build tools, and especially with Gradle.\u003c/li\u003e\n\u003cli\u003ePassionate about software craftsmanship, acquiring new skills, and exploring learning opportunities.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEach of the following skills would be a plus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with modern CI/CD tools (e.g. GitLab CI/CD, Jenkins, Atlassian Bamboo).\u003c/li\u003e\n\u003cli\u003eFamiliarity with NodeJS based JavaScript tool chains.\u003c/li\u003e\n\u003cli\u003eFamiliarity with rule-based systems, particularly Drools.\u003c/li\u003e\n\u003cli\u003eFamiliarity with Elasticsearch, Docker and Kubernetes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eTechnical competencies:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of programming techniques and languages: deep understanding of object-oriented and functional programming paradigms, design and architectural patterns used for modern Web application development, and proficiency with Java and JavaScript (ES6+).\u003c/li\u003e\n\u003cli\u003eKnowledge of best practices for developing secure software: knowledge of web application vulnerabilities (as defined by OWASP) and how to prevent them.\u003c/li\u003e\n\u003cli\u003eDesign of databases/repositories: experience with relational databases and database modelling.\u003c/li\u003e\n\u003cli\u003eRe-use, refactoring, integration and porting of existing software: working effectively with legacy code through continuous improvement, refactoring, and technology migration. Provide re-usable components that can be shared between multiple repositories.\u003c/li\u003e\n\u003cli\u003eKnowledge and application of software life-cycle tools and procedures: working in lean-agile environments with methodologies such as Scrum or Kanban, issue tracking systems, Git, dependencies and build tools (Maven, Gradle).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBehavioural competencies:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBuilding Relationships: showing appreciation for the ideas and contributions of others and encourages others to express their views, even if controversial. Understanding how individual differences bring added value to the Organization; promoting complementarities. Being able to put self in the shoes of others in order to understand their needs and interests.\u003c/li\u003e\n\u003cli\u003eWorking in Teams: working well in groups and readily fitting into a team; participating fully and taking an active role in team activities. Cooperating constructively with others in the pursuit of team goals; balancing personal goals with team goals. Sharing and letting others participate in own work/project; encouraging team development.\u003c/li\u003e\n\u003cli\u003eDemonstrating Accountability: working conscientiously and reliably; delivering on promises. Taking responsibility for own actions and decisions Readily admitting to mistakes.\u003c/li\u003e\n\u003cli\u003eLearning and Sharing Knowledge: taking steps to expand knowledge in other areas of expertise beyond own field. Questioning traditional assumptions and ways of doing things. Learning from own successes and failures.\u003c/li\u003e\n\u003cli\u003eCommunicating Effectively: expressing opinions, ideas and suggestions with conviction and in a logical/structured manner; keeping to the point. Successfully changing other people's opinions by persuasive arguments. Delivering presentations in a structured and clear way; adjusting style and content to the audience; responding calmly and confidently to questions.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eLanguage skills:\u003c/h2\u003e\n\u003cp\u003eEnglish spoken and written, with the ability to draw-up specifications and/or reports, and/or to make oral presentations. And the ability to understand and speak French or an undertaking to acquire it.\u003c/p\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eEligibility and closing date:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDiversity has been an integral part of CERN's mission since its foundation and is an established value of the Organization. Employing a diverse workforce is central to our success. We welcome applications from all Member States and Associate Member States.\u003c/p\u003e\n\u003cp\u003eThis vacancy will be filled as soon as possible, and applications should normally reach us no later than 16.08.2020\u003c/p\u003e\n\u003ch2\u003eEmployment Conditions\u003c/h2\u003e\n\u003cp\u003eContract type: Limited duration contract (5 years). Subject to certain conditions, holders of limited-duration contracts may apply for an indefinite position.\u003c/p\u003e\n\u003cp\u003eThese functions require:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork during nights, Sundays and official holidays, when required by the needs of the Organization.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJob grade: 6-7\u003c/p\u003e\n\u003cp\u003eJob reference: FAP-BC-AS-2020-69-LD\u003c/p\u003e\n\u003cp\u003eBenchmark Job Title: Computing Engineer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlease make sure you have all the documents needed to hand as you start your application, as once it is submitted, you will not be able to upload any documents or edit your application further. You can apply via \u003ca href=\"https://vonq.io/33blyln\"\u003ethis link!\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/33blyln\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ09IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0df8842f194acceec9bdb0eaeaed5b4a583edd40/CERN.jpeg"},{"id":"fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e","type":"Full Time","url":"https://jobs.github.com/positions/fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e","created_at":"Thu Jul 30 12:13:55 UTC 2020","company":"HBM nCode Federal LLC","company_url":"http://www.hbmprenscia.com","location":"Starkville, MS","title":"Software Engineer","description":"\u003cp\u003eHBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Starkville, MS office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware product configuration, design and implementation\u003c/li\u003e\n\u003cli\u003eAssist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs\u003c/li\u003e\n\u003cli\u003eCreate detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations\u003c/li\u003e\n\u003cli\u003eCollaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency\u003c/li\u003e\n\u003cli\u003eWork with project and product managers to achieve on-time, on-cost delivery\u003c/li\u003e\n\u003cli\u003eResearch and test new technologies and software plus identify and recommend their applicability\u003c/li\u003e\n\u003cli\u003ePresentations to team members, management and customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEDUCATION / CERTIFICATIONS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.\u003c/li\u003e\n\u003cli\u003eA minimum of 3 years of relevant experience and related technology professional certifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePERSONAL SKILLS/EXPERIENCES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUS Citizens Only (REQUIREMENT)\u003c/li\u003e\n\u003cli\u003eSolid understanding of Object Oriented Programming\u003c/li\u003e\n\u003cli\u003eSolid understanding of modern Web based Programming techniques\u003c/li\u003e\n\u003cli\u003eExperience with database architectures, scripting and web services\u003c/li\u003e\n\u003cli\u003eExperience in working with both unstructured and structured data\u003c/li\u003e\n\u003cli\u003eA solid foundation in computer science, with strong competencies in data structures, algorithms and software design\u003c/li\u003e\n\u003cli\u003eAbility to apply software techniques to the development of real world engineering solutions\nExperience with one or more of the following technologies in each category:\u003c/li\u003e\n\u003cli\u003eMongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\n*Kafka, Spark, Power BI, Tableau, Grafana;\n*C/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\n*Version control systems (e.g. Git, SVN, Mercurial, etc.);\n*Project management software (e.g. Jira, Confluence);\n*Unix based and Windows operating systems;\u003c/li\u003e\n\u003cli\u003ePrior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies\u003c/li\u003e\n\u003cli\u003eDetail oriented with a keen focus on User Experience (Ux) and customer satisfaction.\u003c/li\u003e\n\u003cli\u003eFamiliarity and prior experience with Agile / Scrum development methodologies\u003c/li\u003e\n\u003cli\u003eMulti core / machine development experience (Linux and Windows)\u003c/li\u003e\n\u003cli\u003eExperience with developing scalable / parallel processing applications\u003c/li\u003e\n\u003cli\u003eHigh level of interpersonal skills to work independently and effectively with others\u003c/li\u003e\n\u003cli\u003eExceptional skills related to time management and decision making\u003c/li\u003e\n\u003cli\u003eWillingness to travel to support customer projects and implementations\u003c/li\u003e\n\u003cli\u003eGood communication skills, both verbal and written\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:vacancies@ncodefederal.com\"\u003evacancies@ncodefederal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"7d84945b-893d-493e-957a-4ed9e6f84607","type":"Full Time","url":"https://jobs.github.com/positions/7d84945b-893d-493e-957a-4ed9e6f84607","created_at":"Thu Jul 30 12:02:59 UTC 2020","company":"HBM nCode Federal LLC","company_url":"http://www.hbmprenscia.com","location":"Southfield, MI","title":"Software Engineer","description":"\u003cp\u003eHBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Southfield, MI office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware product configuration, design and implementation\u003c/li\u003e\n\u003cli\u003eAssist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs\u003c/li\u003e\n\u003cli\u003eCreate detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations\u003c/li\u003e\n\u003cli\u003eCollaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency\u003c/li\u003e\n\u003cli\u003eWork with project and product managers to achieve on-time, on-cost delivery\u003c/li\u003e\n\u003cli\u003eResearch and test new technologies and software plus identify and recommend their applicability\u003c/li\u003e\n\u003cli\u003ePresentations to team members, management and customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEDUCATION / CERTIFICATIONS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.\u003c/li\u003e\n\u003cli\u003eA minimum of 3 years of relevant experience and related technology professional certifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePERSONAL SKILLS/EXPERIENCES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUS Citizens Only (REQUIREMENT)\u003c/li\u003e\n\u003cli\u003eSolid understanding of Object Oriented Programming\u003c/li\u003e\n\u003cli\u003eSolid understanding of modern Web based Programming techniques\u003c/li\u003e\n\u003cli\u003eExperience with database architectures, scripting and web services\u003c/li\u003e\n\u003cli\u003eExperience in working with both unstructured and structured data\u003c/li\u003e\n\u003cli\u003eA solid foundation in computer science, with strong competencies in data structures, algorithms and software design\u003c/li\u003e\n\u003cli\u003eAbility to apply software techniques to the development of real world engineering solutions\u003c/li\u003e\n\u003cli\u003eExperience with one or more of the following technologies in each category:\nMongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\nKafka, Spark, Power BI, Tableau, Grafana;\nC/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\nVersion control systems (e.g. Git, SVN, Mercurial, etc.);\nProject management software (e.g. Jira, Confluence);\nUnix based and Windows operating systems\u003c/li\u003e\n\u003cli\u003ePrior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies\u003c/li\u003e\n\u003cli\u003eDetail oriented with a keen focus on User Experience (Ux) and customer satisfaction.\u003c/li\u003e\n\u003cli\u003eFamiliarity and prior experience with Agile / Scrum development methodologies\u003c/li\u003e\n\u003cli\u003eMulti core / machine development experience (Linux and Windows)\u003c/li\u003e\n\u003cli\u003eExperience with developing scalable / parallel processing applications\u003c/li\u003e\n\u003cli\u003eHigh level of interpersonal skills to work independently and effectively with others\u003c/li\u003e\n\u003cli\u003eExceptional skills related to time management and decision making\u003c/li\u003e\n\u003cli\u003eWillingness to travel to support customer projects and implementations\u003c/li\u003e\n\u003cli\u003eGood communication skills, both verbal and written\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:vacancies@ncodefederal.com\"\u003evacancies@ncodefederal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"94ba4a11-a86e-46da-bec6-0e64d767d2cd","type":"Full Time","url":"https://jobs.github.com/positions/94ba4a11-a86e-46da-bec6-0e64d767d2cd","created_at":"Wed Jul 29 11:46:39 UTC 2020","company":"Miele X","company_url":"http://Miele-x.com","location":"Amsterdam","title":"Frontend Architect","description":"\u003cp\u003eThe Frontend Architect is responsible for implementing the digital brand face to the customer. The role is managing the integration of front-end code and technologies for websites and online shops. By developing and implementing global coding standards, this role is focusing on ensuring effective communication through websites on a global scale. The ideal candidate has in-depth knowledge of front-end technologies and is able to implement a seamless user experience.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYOUR RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate a best in class frontend development for the global Miele websites and online shops with strong attention to detail and understanding of frontend technologies\u003c/li\u003e\n\u003cli\u003eDevelop, revise and manage coding and guidelines to steer the website performance\u003c/li\u003e\n\u003cli\u003eManage external partners to ensure efficient delivery of frontend components and their implementation in the CMS\u003c/li\u003e\n\u003cli\u003eEstablish comprehensive coding, review and documentation processes across all websites and teams\u003c/li\u003e\n\u003cli\u003eIdentify new technologies to be integrated in our frontend technology stack\u003c/li\u003e\n\u003cli\u003eCreate project estimates, define scope requirements and strucutre projects; collaborate closely with business to ensure sufficient implementation of new features\u003c/li\u003e\n\u003cli\u003eParticipate in cross-functional projects to increase global website turnover\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYOUR PROFILE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdeally university degree in computer science or other relevant fields\u003c/li\u003e\n\u003cli\u003eIn-depth experience of programming in JavaScript or TypeScript\u003c/li\u003e\n\u003cli\u003eStrong professional experience with JavaScript framework and libraries (e.g. Vue.js, React.js, Angular.js)\u003c/li\u003e\n\u003cli\u003eDeep expertise in HTML5, CSS and building mobile, responsive applications\u003c/li\u003e\n\u003cli\u003eExperience with Agile development methodologies and working knowledge of DevOps principles\u003c/li\u003e\n\u003cli\u003ePassion to solve complex technical problems and strong quality focus, with leadership skills to coach team members on quality practices/ mindsets\u003c/li\u003e\n\u003cli\u003eAbility to interact with people at all levels in an organization and communicate complex ideas in fluent English, German is a plus\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.miele-x.com/jobs/job-frontend-architect/?utm_source=GitHub%20Jobs\u0026amp;utm_medium=Referral\u0026amp;utm_campaign=EN_MX_frontendarchitect\u0026amp;utm_term=\u0026amp;utm_content=\"\u003eApply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1HIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--707c876ad76723f99cf2d2a612a166f29ab8a77b/miele-logo-700x513.jpg"},{"id":"29a73ee3-667c-47c5-b644-f9d62f853e90","type":"Full Time","url":"https://jobs.github.com/positions/29a73ee3-667c-47c5-b644-f9d62f853e90","created_at":"Tue Jul 28 23:08:38 UTC 2020","company":"Anivive Lifesciences","company_url":"https://www.anivive.com","location":"Long Beach, CA or Remote","title":"Senior Design Engineer","description":"\u003cp\u003eJOB DESCRIPTION:\u003c/p\u003e\n\u003cp\u003eAnivive is changing the landscape of the pet health through proprietary software that discovers, develops and delivers new companion animal pharmaceuticals, while also changing the way that we interact and care for our pets on a daily basis.\u003c/p\u003e\n\u003cp\u003eWe are looking for a highly-skilled, versatile 3D WebGL Developer to help with the creation of big, impactful, immersive storytelling experiences through web technologies. The ideal candidate is someone who is passionate about creating beautiful and sophisticated websites and mobile apps and is an expert in creating immersive 2D/3D experiences. Our goal is to change the way people interact with and understand pet health. If you want to be a part of changing animal health, we would love to meet you.\u003c/p\u003e\n\u003cp\u003eAnivive offers a salary commensurate with experience and qualifications as well as a fun, hard-working, entrepreneurial work environment. Perks include casual dress, unlimited vacation and insurance benefits.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate and deploy scalable, 3D immersive web projects as well as other types of web applications utilizing the latest technologies and frameworks (i.e. Babylon.js, Three.js, or similar WebGL)\u003c/li\u003e\n\u003cli\u003eCollaborating with the design team to refine ideas and functionality\u003c/li\u003e\n\u003cli\u003eCreating immersive/interactive 3D projects for marketing/branding events\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSKILLS \u0026amp; REQUIREMENTS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 5+ years expertise with WebGL/Three.js.\u003c/li\u003e\n\u003cli\u003eAdvanced knowledge in the following areas: JavaScript, WebGL/Three.js, HTML, CSS, Webpack/npm/yarn.\u003c/li\u003e\n\u003cli\u003eKnowledge of the 3D asset pipeline (models, textures, rigs, animations, etc)\u003c/li\u003e\n\u003cli\u003eGeneral knowledge of game development principles\u003c/li\u003e\n\u003cli\u003eGeneral knowledge of lighting, shadows and reflections\u003c/li\u003e\n\u003cli\u003eGeneral knowledge of particle systems\u003c/li\u003e\n\u003cli\u003eResponsive design fundamental\u003c/li\u003e\n\u003cli\u003eDemonstrable experience of delivering large projects as part of an agile team.\u003c/li\u003e\n\u003cli\u003eA passion for technology, innovation, and an understanding of software development cycles\u003c/li\u003e\n\u003cli\u003eAbility to work closely with product managers and designers to quickly iterate on features and products.\u003c/li\u003e\n\u003cli\u003eStrong attention to detail with an eye for UX and product design.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBONUS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency with Vue and/or any other major JS framework, HTML, CSS experience\u003c/li\u003e\n\u003cli\u003eComfortable with version control systems such as Git.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT US:\u003c/p\u003e\n\u003cp\u003eWe are a fast growing and well-funded biotech start-up based in beautiful Long Beach, California. Our software platforms allow us to bring life changing medicines to pet faster than ever before, while also changing the way that we interact with our pets on a daily basis. If you want to join a company that is truly shaping an industry and is already recognized as a strong innovator, please submit your resume.\u003c/p\u003e\n\u003cp\u003ePERKS \u0026amp; BENEFITS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive Salary \u0026amp; Stock Options\u003c/li\u003e\n\u003cli\u003eComprehensive Medical, Eye, \u0026amp; Dental Benefits\u003c/li\u003e\n\u003cli\u003ePaid time off including all major holidays\u003c/li\u003e\n\u003cli\u003eLunches \u0026amp; Unlimited Snacks\u003c/li\u003e\n\u003cli\u003eProfessional Development \u0026amp; Training\u003c/li\u003e\n\u003cli\u003eSupportive \u0026amp; Positive Environment\u003c/li\u003e\n\u003cli\u003eBrand new laptop, 4K Dual Monitors, \u0026amp; accessories of choice\u003c/li\u003e\n\u003cli\u003eNew Office Environment\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease respond to this job post by submitting your resume and a portfolio of WebGL related work to \u003ca href=\"mailto:jobs@anivive.com\"\u003ejobs@anivive.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5ce15f0ab64da1fd143bcd574c5e11904278c6e5/Anivive%20Logo%20w%20name.jpg"},{"id":"9a05af9c-9f58-41f7-b0a0-3890fb75dd85","type":"Full Time","url":"https://jobs.github.com/positions/9a05af9c-9f58-41f7-b0a0-3890fb75dd85","created_at":"Tue Jul 28 14:19:46 UTC 2020","company":"General Motors","company_url":null,"location":"Warren, Michigan","title":"Entry Level Controls and Software Engineer ","description":"\u003cp\u003eAbout GM\nThere’s never been a more exciting time to work for General Motors.\u003c/p\u003e\n\u003cp\u003eTo achieve our vision of a world with Zero Crashes, Zero Emissions and Zero Congestion, we need people to join us who are passionate about creating safer, better and more sustainable ways for people to get around. This bold vision won’t happen overnight, but just as we transformed how the world moved in the last century, we are committed to transforming how we move today and in the future.\u003c/p\u003e\n\u003cp\u003eWhy Work for Us\nOur culture is focused on building inclusive teams, where differences and unique perspectives are embraced so you can contribute to your fullest potential as you pursue your career. Our locations feature a variety of work environments, including open work spaces and virtual connection platforms to inspire productivity and flexible collaboration. And we are proud to support our employees volunteer interests, and make it a priority to join together in efforts that give back to our communities.\u003c/p\u003e\n\u003cp\u003eJob Description\nGeneral Motors is looking for innovative Entry Level Cyber-Physical Systems Engineers to help us build state-of-the-art platforms. This rotational opportunity is an early career development initiative for new hires designed to build foundational skills, to gain greater exposure and to better understand our business. This role aims to develop and strengthen the future of our organization through rotational development, networking and annual development opportunities. This program requires a two-year commitment and consists of 4 six-month assignments. Upon completion of the program, participants are matched to opportunities based on interest and business needs.\u003c/p\u003e\n\u003cp\u003eIn this entry level rotational opportunity, you will help design, develop and test software codes, algorithms, embedded systems and architect software to optimize controller resources and throughput.  These codes will run throughout almost every aspect of the vehicle controllers so you will be able to do hands on work that can directly affect the vehicle. Your work could be driving around on the roads! All of this work will be done on multiple levels so you will have a chance to develop interpersonal and relationship management skills with the ability to effectively collaborate with varying levels of the organization.\u003c/p\u003e\n\u003cp\u003ePrimary responsibilities:\nConvert/interpret algorithms and other required documents into software code\nAccountable to develop software that runs within GM’s embedded controllers using the GM software tool chain\nDesign, develop and test feature behavior and interaction between controls hardware and controls software\nDevelop test cases aligned with requirements using manual and automated test environments in the local PC, Hardware-In-the-Loop (HIL) bench, and system level bench environments\nCompile software into executable files and to test/evaluate executable files\nData analysis and research to assess vehicle feature feasibility\nAdditional Job DescriptionQualifications:\nCurrently pursuing a Bachelor’s Degree or Master’s Degree in the following fields of study: Computer Engineering, Software Engineering, Computer Science, Controls Engineering, Controls Systems Engineering, or Mechatronics\nMust be graduating between October 2020 and June 2021\u003c/p\u003e\n\u003cp\u003eABET accredited program Preferred\nMust have a minimum of a 3.0 cumulative GPA on a 4.0 scale\nDemonstrated coding efficiency, speed \u0026amp; quality\nEfficient use of MATLAB/Simulink\nDesired Skills:\nPrior internship experience in automotive or technology\nEngineering degree with focus on Robotics, Data Analytics, Machine Learning, Sensing, Automation, or Computation\nExperience with programming languages Ex: Python, C++, Java, etc.\nDemonstrated algorithm generation and connection to the physical requirements\nSoftware Programs: CAN messaging, GIT change management tool, Rhapsody, DOORS Requirements management software\nDemonstrated knowledge and application of Software and/or Controls Engineering Principles\nExcellent written and verbal communication skills with the ability to distill sophisticated subjects to a wider audience\nEmerging partnership and teamwork skills and ability to learn from and share knowledge with co-workers in a rapidly moving environment\nHigh level of integrity, ability to deal with ambiguity, takes initiative/self-directed\nEvidence of strong character with integrity, honesty, accountability and trust\nDeliver new and creative solutions to complex problems\nRelocation assistance is available to candidates who meet eligibility requirements.\u003c/p\u003e\n\u003cp\u003ePLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP.\u003c/p\u003e\n\u003cp\u003eDiversity Information\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities.\u003c/p\u003e\n\u003cp\u003eWe encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eJoin our General Motors Team! Apply here: \u003ca href=\"https://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group\"\u003ehttps://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--97a0aab03f74a44cfd5b07ca3c85493fa88ee247/GM_Logo.png"},{"id":"315ce7c1-2ec0-4141-b012-907a05d0084c","type":"Full Time","url":"https://jobs.github.com/positions/315ce7c1-2ec0-4141-b012-907a05d0084c","created_at":"Mon Jul 27 15:54:04 UTC 2020","company":"Upserve","company_url":"http://Upserve","location":"Remote","title":"Principal Frontend Engineer","description":"\u003cp\u003eThe Opportunity\u003c/p\u003e\n\u003cp\u003eUpserve is looking for a Principal Frontend Engineer with a design-centric approach and a passion for mentoring to join our web applications team. This team designs and creates both core and supplemental products for Upserve’s customers. Frontend Engineers on this team create compelling and functional UX in collaboration with backend engineers to meet new and existing product requirements with robust, maintainable solutions.\u003c/p\u003e\n\u003cp\u003eWhat You’ll Do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a technical leader, gaining ownership and mutual respect over existing and new areas of the product, and collaboratively design with our customer’s needs as paramount.\u003c/li\u003e\n\u003cli\u003eImbue your team with passion for delightful user experiences.\u003c/li\u003e\n\u003cli\u003eDrive quality and testing methodologies to ensure only robust solutions are delivered.\u003c/li\u003e\n\u003cli\u003eCreate maintainable solutions that meet Product and Engineering needs to grow the business.\u003c/li\u003e\n\u003cli\u003eCollaborate with our Product and UX teams to disambiguate requirements and understand context to create the appropriate interfaces.\u003c/li\u003e\n\u003cli\u003eParticipate in sprint planning, code reviews, and retrospectives.\u003c/li\u003e\n\u003cli\u003eGuide and mentor other engineers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWho You Are\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have extensively worked with web technologies and frameworks such as React, TypeScript, JavaScript, Elm, webpack, babel, GraphQL and functional programming concepts such as ramda, reselect, React Hooks.\u003c/li\u003e\n\u003cli\u003eYou understand the web is consumed on many varied platforms with many varied levels of connectivity and bandwidth, and you design accordingly.\u003c/li\u003e\n\u003cli\u003eYou are an experienced and passionate technical leader who is comfortable defining technical solutions to stimulating challenges.\u003c/li\u003e\n\u003cli\u003eYou believe in building robust, rigorously-tested systems and components, and driving our quality bar cross-functionally.\u003c/li\u003e\n\u003cli\u003eYou take pride in your work and the value that it creates, enabling instrumentation and diagnostics post-release phase.\u003c/li\u003e\n\u003cli\u003eYou are a pragmatic idealist -- you strive for efficient and practical solutions not just theoretically ideal ones.\u003c/li\u003e\n\u003cli\u003eYou are a believer in moving fast with care and quality as key tenets.\u003c/li\u003e\n\u003cli\u003eYou enjoy talking about user functionality as much as you enjoy talking about functional programming.\u003c/li\u003e\n\u003cli\u003eYou feel a tremendous sense of urgency to get value to end users, and you tap into that energy to drive, lead, and motivate your colleagues.\u003c/li\u003e\n\u003cli\u003eYou get excited about types and algorithms, and know when to choose the right data structure for the right task.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease follow this link to apply: \u003ca href=\"https://recruit.hirebridge.com/v3/application/applink.aspx?cid=7958\u0026amp;jid=526164\"\u003ehttps://recruit.hirebridge.com/v3/application/applink.aspx?cid=7958\u0026amp;jid=526164\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--421183925e3943f46d6d246b2fbb25fbd8f85fc5/Upserve.Symbol.%20Black.png"},{"id":"37eb4d89-56d0-4b90-914f-9e3b0e13c877","type":"Full Time","url":"https://jobs.github.com/positions/37eb4d89-56d0-4b90-914f-9e3b0e13c877","created_at":"Fri Jul 24 15:11:34 UTC 2020","company":"Triblio, Inc.","company_url":"http://Triblio.com","location":"Reston, VA","title":"Software Developer","description":"\u003cp\u003eTriblio is a fun, fast-growing, and innovative company seeking a technically oriented team player to help our software development initiatives. Triblio's flagship product is a Codie award-winning marketing technology platform.  Our leadership team is comprised of highly successful and experienced technology executives with a proven track record of success.  We believe in a positive team culture, innovation, and a commitment to serving our customers.\u003c/p\u003e\n\u003cp\u003eRole:\nThis position, reporting to the Chief Technology Officer (CTO), will work with our CTO and development team to contribute to all aspects of software development, including architecture, design, implementation, and testing.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities:\n-Design, write and test code for the Triblio’s software platform\u003c/p\u003e\n\u003cp\u003e-Interact with team members to learn, refine and implement new capabilities\u003c/p\u003e\n\u003cp\u003e-Assess, utilize, maintain and update development operational tools and frameworks\u003c/p\u003e\n\u003cp\u003e-Maintain and enhance ongoing software product codebase\u003c/p\u003e\n\u003cp\u003e-Collaborate with Product Management and Customer Success teams on technical issues\u003c/p\u003e\n\u003cp\u003eSoftware Developer Requirements and Qualifications\u003c/p\u003e\n\u003cp\u003e-Bachelor’s degree or higher in Computer Science or related field\u003c/p\u003e\n\u003cp\u003e-Minimally 2 years experience in the design and implementation of browser-based applications and APIs\u003c/p\u003e\n\u003cp\u003e-Familiarity with MVC\u003c/p\u003e\n\u003cp\u003e-Hands-on experience with Javascript frameworks - React, Angular, NodeJ\u003c/p\u003e\n\u003cp\u003e-Ability to learn and apply new technologies quickly\u003c/p\u003e\n\u003cp\u003e-Ability to communicate and collaborate on technical projects with fellow developers\u003c/p\u003e\n\u003cp\u003e-Strict attention to detail, highly organized and efficient\u003c/p\u003e\n\u003cp\u003e-Strong written and verbal communication skills\u003c/p\u003e\n\u003cp\u003eMust be able to commute to Reston, VA, however due to COVID Triblio staff currently works from home.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eemail: \u003ca href=\"mailto:recruiting@triblio.com\"\u003erecruiting@triblio.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEtHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--83665b4a5f3a437a5d2f6acb21c9dbaec03b21cd/Logo.png"},{"id":"fd0163dc-0edb-4be6-aec0-1b39653a2ff3","type":"Full Time","url":"https://jobs.github.com/positions/fd0163dc-0edb-4be6-aec0-1b39653a2ff3","created_at":"Fri Jul 24 15:11:00 UTC 2020","company":"Thermondo GmbH","company_url":"https://www.thermondo.de/","location":"Berlin","title":"(Senior) Python Developer / Software Engineer (m/f/d)","description":"\u003cp\u003eWir bauen mit Thermondo ein besonderes Unternehmen. Wir sind der klare Innovator und First-Mover in unserem Markt. Wir haben starke Gesellschafter und sind gut finanziert. Wir sind ein dynamisches Startup mit starkem Wachstum. Bei uns findest Du ein tolles Arbeitsumfeld in einer besonderen Unternehmenskultur, in der Dein Talent und Deine Persönlichkeit einen Platz finden. In flachen Strukturen arbeitet bei uns ein aufgeschlossenes und motiviertes Team. Wir sind alle mit Leidenschaft dabei, erwarten dasselbe von Dir und freuen uns auf Deine Unterstützung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe're looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e... a (Senior) Python Developer / Software Engineer (m/f/d) in Berlin who will join our international tech team as soon as possible in creating one of the fastest growing companies in the heating market.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThermondo was founded in 2012 to advance the energy revolution with innovative heating solutions. More than 16,000 heating-system transformations later, we are not only No. 1 in heating system construction, but have also made a lasting difference to the heating market. We are the pioneer and innovation leader in the digitalisation of the trade. The basis for this is the resourceful teamwork of our tech, marketing, sales, development, IT and HR experts. With passion and verve, they fulfill our vision of \u0026lt;2° (less than two degrees).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull time or part time, permanent contract.\u003c/li\u003e\n\u003cli\u003ePlenty of opportunities for new ideas and responsibilities.\u003c/li\u003e\n\u003cli\u003eAny tech equipment you need (Mac/Linux/Windows).\u003c/li\u003e\n\u003cli\u003eFlexible working hours and a professional development environment.\u003c/li\u003e\n\u003cli\u003eThe possibility to work 3 days a week in your mobile office.\u003c/li\u003e\n\u003cli\u003eAn international team, team-building events and 30 days of vacation.\u003c/li\u003e\n\u003cli\u003eYour work has a direct impact on the German energy market.\u003c/li\u003e\n\u003cli\u003eRegular feedback as an integral part of employee development (e. g. paid educational leave, conference budget etc.).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are mainly using Python along with Django or Wagtail connected to PostgreSQL. We also have some JavaScript applications written in Typescript using ReactJS.  You even find some exotic things like LaTeX in our stack.\nMost of our hosting is done on Heroku. We’re trying to make use of a lot of Heroku’s tools like pipelines, backups, buildpacks and some monitoring plugins. We try to keep DevOps work to a minimum since we want to focus on building and shipping functionality. We are using some AWS services like S3.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur Python based backend is the backbone of our Germany wide operation and key to the digitization of the energy business. It’s an enterprise-grade application which connects our own services to third party platforms like Salesforce.\u003c/p\u003e\n\u003cp\u003eOur business is constantly growing and changing. New feature requests or requirement changes may emerge every day. As a result we build software that is highly maintainable to satisfy those needs. Your job will be to work in small teams on independent projects alongside your non technical colleagues. You will analyze our business needs and implement solutions while maintaining a high quality standard and developing at startup speed. You will have the freedom to use any tools and resources to achieve your goals. Our team of more than ten experienced engineers will support you to reach your full potential. For more information visit: \u003ca href=\"http://t3u1.mjt.lu/lnk/AUgAAAf06nMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfGt9gqIsxRLCkSoi9-mTTpiJ8nAAGCXo/2/ou_CfSrhP8Oa6LWPKirzcg/aHR0cHM6Ly90aGVybW9uZG8uZ2l0aHViLmlvLw\"\u003ehttps://thermondo.github.io\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity degree in a technical field, or a comparable qualification\u003c/li\u003e\n\u003cli\u003eRelevant experience in programming and web technology\u003c/li\u003e\n\u003cli\u003eVery good understanding of back-end technologies – Python or JavaScript\u003c/li\u003e\n\u003cli\u003eFamiliar in working with frameworks like Django or Celery\u003c/li\u003e\n\u003cli\u003eExperience with Heroku is a plus\u003c/li\u003e\n\u003cli\u003eKnowledge of version control systems - Git or SVN\u003c/li\u003e\n\u003cli\u003eExperience with agile methodologies - Kanban, Scrum or similar\u003c/li\u003e\n\u003cli\u003eFluency in English. German skills are a plus but not important for this position\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIt's on\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThat's exactly the challenge you're looking for? We look forward to getting to know you!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/4808bade5b7e7e7006ab2c9a5f42c0838053d524/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f62353462646134636437643833616436393032306336663761326161353331373730636261616134376132396365376332363236653234376635393732316663\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/9b36c340c50b432432aa6dfb9a41a8f8b08fbebdecd92c30697015c4b7218e22\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb3d7320d68717a67d97e9e068b6e4449bba9bbe/Thermondo%20GmbH.png"},{"id":"b74e0c4c-c57b-47bb-b9ed-1222cd841b62","type":"Full Time","url":"https://jobs.github.com/positions/b74e0c4c-c57b-47bb-b9ed-1222cd841b62","created_at":"Wed Jul 22 19:17:41 UTC 2020","company":"QSC, LLC","company_url":"https://www.qsc.com/","location":"Boulder, CO","title":"Software Engineer - Windows C# Developer","description":"\u003cp\u003eQSC thrives where innovative technology and compelling audio-visual experiences intersect. For over 50 years, QSC has pioneered the technology and solutions that enable immersive cinema, live performance audio, themed entertainment, digital collaboration and meeting experiences for our customers and partners around the world. A globally recognized innovator in the design, engineering, and manufacture of category leading high-performance loudspeakers, digital mixers, power amplifiers, audio processors, digital cinema solutions, and the Q-SYS™ software-based audio, video and control Ecosystem.\u003c/p\u003e\n\u003cp\u003eBy joining the QSC team, you will be in a challenging, collaborative, fun, and innovative environment. We encourage employees to take ownership, to color outside the lines, and to imagine possibilities. Our culture is casual but dynamic, with cross-functional teams collaborating on creating memorable audio-visual experiences that deliver joy to people, wherever they are. At QSC, fun and hard work go hand in hand. Join us and make a difference in the way people experience movies, meetings, presentations, live performances, and much more.\u003c/p\u003e\n\u003cp\u003eThe Software Engineer - Windows C# Developer will work with an experienced team of software, firmware, and hardware engineers to develop our Q-Sys platform.  Q-Sys is a fast growing, award winning, software and hardware platform built on cutting-edge audio, video and control products.  This position is based in Boulder, Colorado.\u003c/p\u003e\n\u003cp\u003eCheck out our Q-sys - An Emmy Award winning technology for 2020\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e•Develop world-class software within the pro audio, video \u0026amp; control industry\u003c/p\u003e\n\u003cp\u003e•Add features to a top tier Windows application using C#, WPF, and JavaScript\u003c/p\u003e\n\u003cp\u003e•Assist in continuously improving the architecture of the Q-SYS Designer application\u003c/p\u003e\n\u003cp\u003e•Maintain a strong focus on software quality, quickly addressing defects as they occur\u003c/p\u003e\n\u003cp\u003e•Work with Software Quality Assurance to develop appropriate test strategies\u003c/p\u003e\n\u003cp\u003e•Perform other duties as assigned\u003c/p\u003e\n\u003cp\u003eQualifications\u003c/p\u003e\n\u003cp\u003e•B.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent\u003c/p\u003e\n\u003cp\u003e•Minimum of 3 years plus of work experience in a professional software development environment\u003c/p\u003e\n\u003cp\u003e•Hands on experience coding large C# code bases\u003c/p\u003e\n\u003cp\u003e•Excellent SW design, engineering, implementation, and debugging skills\u003c/p\u003e\n\u003cp\u003e•Passionate, persistent, creative – you are excited to find solutions to difficult problems\u003c/p\u003e\n\u003cp\u003e•Must be self-motivated in order to achieve assigned objectives with minimal supervision\u003c/p\u003e\n\u003cp\u003e•The successful candidate will have the following skills:◦Strong knowledge of modern C#\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e ◦Working knowledge of git source control\n\n ◦Experience with WPF framework using XAML\n\n ◦Application development for shipping Windows-based software products\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e•The ideal candidate will have experience with one or more the following:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e ◦Experience with C# asynchronous programming\n\n ◦C++ experience in a large scale codebase\n\n ◦Development of hardware/software solutions\n\n ◦Experience with real-time audio or video applications\n\n ◦Interfacing with REST APIs\n\u003c/code\u003e\u003c/pre\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers site: \u003ca href=\"https://qsccareers-qsc.icims.com/jobs/2613/software-engineer---windows-c%23-developer/job\"\u003ehttps://qsccareers-qsc.icims.com/jobs/2613/software-engineer---windows-c%23-developer/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbitHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cab4f0d05409e1b6ce10d5c0e37688de041ccaab/QSC_LOGO_BLUE.jpg"},{"id":"58571cae-9714-49a9-a3a9-f72c1c99cff6","type":"Full Time","url":"https://jobs.github.com/positions/58571cae-9714-49a9-a3a9-f72c1c99cff6","created_at":"Wed Jul 22 08:25:01 UTC 2020","company":"International NGO Safety Organisation","company_url":"http://www.ngosafety.org","location":"The Hague, The Netherlands","title":"Full Stack Developer","description":"\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eFull-Stack Developer\u003c/p\u003e\n\u003cp\u003eThe Hague, Netherlands\u003c/p\u003e\n\u003cp\u003eOrganisation Background\u003c/p\u003e\n\u003cp\u003eThe International NGO Safety Organisation (INSO) is an international charity that supports the safety of aid workers by establishing safety coordination platforms in insecure contexts. INSO provides registered NGOs with a range of free services including real-time incident tracking, analytical reports, safety related data and mapping, crisis management support, staff orientations and training.\u003c/p\u003e\n\u003cp\u003eINSO services help NGOs with their day-to-day risk management responsibilities and improve their overall situational awareness to support evidence-based humanitarian access decisions.\u003c/p\u003e\n\u003cp\u003eFounded in 2011, the International NGO Safety Organisation has grown from innovative start-up to become a globally recognised charity and a highly valued component in the humanitarian safety coordination system. With operations in 14 countries, INSO has revolutionized the humanitarian safety coordination sector by introducing a robust and high-quality field safety platform model that has been deployed in some of the world’s most high-risk settings.\u003c/p\u003e\n\u003cp\u003eThe strong focus on humanitarian principles and exclusive NGO-only membership criteria have meant that INSO is now accepted as a standard component of modern humanitarian response offering independent frontline reporting and coordination services that save lives, strengthen operational practice and enable humanitarian access\u003c/p\u003e\n\u003cp\u003eToday the organisation provides daily support to more than 1000 NGOs in 14 of the world’s most insecure countries and has earned a strong reputation for performance, principles \u0026amp; professionalism.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cp\u003eINSO is seeking an experienced and talented individual to join our team in The Hague (Netherlands) as a Full-Stack Developer. The tentative start date for this position is 1st October 2020. However, due to travel restrictions related to the COVID-19 pandemic, the starting date may be delayed.\u003c/p\u003e\n\u003cp\u003eThe Developer will be responsible for providing substantial assistance in the design, implementation and maintenance of INSO’s Conflict \u0026amp; Humanitarian Data Centre. The system will be used in contexts where internet bandwidth is very limited or non-existent. User roles will be defined with different permissions that require interaction with each other across multiple countries. He/She will help develop the data entry and incident analysis phases of the application with the guidance of the Senior Developer. Furthermore, He/She will provide substantial programming assistance in further development and troubleshooting of INSO’s partner and service distribution portal as well as the creation of a new organizational website.\u003c/p\u003e\n\u003cp\u003eINSO’s Development Stack:\u003c/p\u003e\n\u003cp\u003eFrontend:\u003c/p\u003e\n\u003cp\u003e· Angular 8+ with Typescript\u003c/p\u003e\n\u003cp\u003e· Electron Framework (client app) and Service/Web Workers (offline web app)\u003c/p\u003e\n\u003cp\u003e· Visualization development using D3 library and JQuery\u003c/p\u003e\n\u003cp\u003e· Data storage and synchronization using Indexed DB and PouchDB\u003c/p\u003e\n\u003cp\u003e· Google Maps, OpenStreetMap, and PowerBI integration\u003c/p\u003e\n\u003cp\u003e· HTML5 with SCSS preprocessor\u003c/p\u003e\n\u003cp\u003e· OpenID Implicit Flow authentication\u003c/p\u003e\n\u003cp\u003e· i18n localization English/French\u003c/p\u003e\n\u003cp\u003e· Testing using Jasmine/Karma\u003c/p\u003e\n\u003cp\u003e· DevOps using Webpack and Docker containers\u003c/p\u003e\n\u003cp\u003eBackend:\u003c/p\u003e\n\u003cp\u003e· Node.js with Express.js framework\u003c/p\u003e\n\u003cp\u003e· Session caching using Redis\u003c/p\u003e\n\u003cp\u003e· OAuth and JWT authentication with Azure AD\u003c/p\u003e\n\u003cp\u003e· Java Spring (boot) with Maven using Apache Tomcat\u003c/p\u003e\n\u003cp\u003e· Clustering with multiple Apache CouchDB NoSQL nodes\u003c/p\u003e\n\u003cp\u003e· NRT Indexing with Apache Solr 8+ using Zookeeper\u003c/p\u003e\n\u003cp\u003e· Docker orchestration using Kubernetes\u003c/p\u003e\n\u003cp\u003e· MS SQL Server replication for 3rd party connections\u003c/p\u003e\n\u003cp\u003e· PHP with Codeigniter using Nginx\u003c/p\u003e\n\u003cp\u003e· Azure MySQL Server\u003c/p\u003e\n\u003cp\u003e· Communication with Twilio, SendGrid and BulkSMS\u003c/p\u003e\n\u003cp\u003e· Azure Serverless Functions with Queue processing\u003c/p\u003e\n\u003cp\u003e· Maintenance and scheduled tasks using cron and Bash\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eApplicants should have experience in the following:\u003c/p\u003e\n\u003cp\u003e· Strong understanding of data modeling and storage with both NoSQL and relational DBs\u003c/p\u003e\n\u003cp\u003e· Experience with RESTful APIs\u003c/p\u003e\n\u003cp\u003e· Knowledge of modern web and client development with distributed system architectures\u003c/p\u003e\n\u003cp\u003e· Familiarity with Azure and Active Directory, VM server management, DNS, and SSL techniques\u003c/p\u003e\n\u003cp\u003e· UI/UX design and organization\u003c/p\u003e\n\u003cp\u003e· Experience in “big data” processing and analysis with dynamic visualizations\u003c/p\u003e\n\u003cp\u003e· Paramount attention to detail in application and data security\u003c/p\u003e\n\u003cp\u003e· Solid understanding of performance testing, deployment strategies, and DevOps\u003c/p\u003e\n\u003cp\u003e· The ability to learn quickly and use innovative technologies\u003c/p\u003e\n\u003cp\u003e· Be a conscientious team worker who meets commitments and deadlines and takes pride in being reliable within a multi-cultural team across different time zones\u003c/p\u003e\n\u003cp\u003e· Outstanding communication skills in English\u003c/p\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cp\u003e· Communication skills in French\u003c/p\u003e\n\u003cp\u003e· Knowledge of Python\u003c/p\u003e\n\u003cp\u003e· Prior humanitarian or NGO experience\u003c/p\u003e\n\u003cp\u003e· Contributed to relevant open source projects or impressive portfolio\u003c/p\u003e\n\u003cp\u003e· Prior work in computer graphics with SVG web technologies\u003c/p\u003e\n\u003cp\u003eINSO’s Safeguarding Policy:\u003c/p\u003e\n\u003cp\u003eINSO is fully committed to safe recruitment, selection and vetting of all potential new staff, trustees and volunteers and we will ensure rigorous compliance with our Code of Conduct and Safeguarding policy throughout the recruitment process. As such, the following safe recruitment practices will be applied:\u003c/p\u003e\n\u003cp\u003e· All offers of employment will be conditional on receiving at least two satisfactory professional references.\u003c/p\u003e\n\u003cp\u003e· INSO will ask candidates about significant gaps in employment history or frequent changes of employer and address.\u003c/p\u003e\n\u003cp\u003e· All essential qualifications and relevant professional accreditations and memberships will be verified.\u003c/p\u003e\n\u003cp\u003e· The successful candidate will be required to provide a valid proof of identity (passport, ID card).\u003c/p\u003e\n\u003cp\u003e· All new hires will receive an orientation in INSO’s safeguarding policy and procedures and associated documents (Code of Conduct, Whistleblowing etc.).\u003c/p\u003e\n\u003cp\u003e· All new hires will be required to sign and abide by the Code of Conduct as a condition of employment.\u003c/p\u003e\n\u003cp\u003eTerms \u0026amp; Conditions: 1 year contract with an expected start date on 1 October in the Hague, Netherlands, €4750 per month salary, 8% vacation pay and 2.5 days annual leave per month.\u003c/p\u003e\n\u003cp\u003eHow to apply:\u003c/p\u003e\n\u003cp\u003eInterested applicants are requested to send the following and reference “INSO Developer 2020” in the subject line of the email. Only shortlisted candidates will be contacted.\u003c/p\u003e\n\u003cp\u003e· Updated CV (5 page maximum).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA cover letter explaining your motivation and interest in the position.\n· Any relevant software project samples as links or documents (optional)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease do not send any additional information (such as copies of certificates, copies of diplomas, other writing samples, etc.) and keep the total size of your application under 8MB if possible.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eInterested applicants are requested to send an email to \u003ca href=\"mailto:jobs@oso.ngosafety.org\"\u003ejobs@oso.ngosafety.org\u003c/a\u003e with reference “INSO Developer 2020” in the subject line and the following information as attachments:\u003c/p\u003e\n\u003cp\u003e· Updated CV (5 page maximum).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA cover letter explaining your motivation and interest in the position.\n· Any relevant software project samples as links or documents (optional)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease do not send any additional information (such as copies of certificates, copies of diplomas, other writing samples, etc.) and keep the total size of your application under 8MB if possible. Only shortlisted candidates will be contacted.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbldHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7bf93355fc5eb32a7614acb59204ae87ba0bab01/INSO_low%20res.jpg"},{"id":"ffc80f47-9f87-4fe1-9ba3-588152c2db5a","type":"Full Time","url":"https://jobs.github.com/positions/ffc80f47-9f87-4fe1-9ba3-588152c2db5a","created_at":"Wed Jul 22 04:13:43 UTC 2020","company":"RebelMouse","company_url":"https://www.rebelmouse.com","location":"worldwide","title":"Senior Fullstack Engineer","description":"\u003cp\u003eHere are some key items to consider:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorkflow and processes are one of the most important things in development\u003c/li\u003e\n\u003cli\u003eCertifications is the one of the most important things and I have them all\u003c/li\u003e\n\u003cli\u003eI like to join any technical discussions even those w/o real outcome for a product\u003c/li\u003e\n\u003cli\u003eI used to change companies a lot\u003c/li\u003e\n\u003cli\u003eI like tech-stack superiority wars, I always win (obviously)\u003c/li\u003e\n\u003cli\u003eI think I’m the smartest person in the company and everybody should be grateful for having a chance to work with me\u003c/li\u003e\n\u003cli\u003eI would put architecture in the first place above the product, common sense and everything else, period!\u003c/li\u003e\n\u003cli\u003eI find it very stressful when somebody touches my code\u003c/li\u003e\n\u003cli\u003eI like to write long emails describing my vision to everybody\u003c/li\u003e\n\u003cli\u003eI value boring but stable work environment over the opportunity to grow\u003c/li\u003e\n\u003cli\u003eI don’t believe management can understand my vision that is why I gave up sharing it\u003c/li\u003e\n\u003cli\u003eBeing small gear in an enterprise mechanism is what I like\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor good or bad we don’t have any of these, here is what we have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnvironment of open minded people focused on solving real world problems-\u003c/li\u003e\n\u003cli\u003eTeam that values every member\u003c/li\u003e\n\u003cli\u003e“Complex over complicated”\u003c/li\u003e\n\u003cli\u003eCreating the best product possible that moves the needle and brings innovations to live\u003c/li\u003e\n\u003cli\u003eWe proud of how we do things but even more about what we do\u003c/li\u003e\n\u003cli\u003eNo finger pointing and blaming except for git blaming :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExciting part: Our product gives an opportunity to more than 100 enterprise clients to focus on things that matters for them and not technology behind it! At the moment total monthly audience is 90M. That means it's always going to be an opportunity to help somebody out there by building new things.\u003c/p\u003e\n\u003cp\u003eOur applications are build with Python, JavaScript (es6+), variety of frameworks as well as vanilla, Node.js, MongoDB, Redis, MySQL, Memcached Our product is cloud-native and relies on services provided by AWS. We make sure that the platform is robust and reliable enough to cover the needs of every single customer. EC2, Kubernetes - sounds familiar? We also use Docker, Istio, Prometheus, Grafana and some other fancy stuff\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRequirements\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGood grasp of functional and/or OOP design\u003c/li\u003e\n\u003cli\u003eStrong experience with Python/NodeJS\u003c/li\u003e\n\u003cli\u003eUnderstanding networking (http, tcp etc., as well as async io)\u003c/li\u003e\n\u003cli\u003eFrontend and backend performance optimizations\u003c/li\u003e\n\u003cli\u003ePositive attitude :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs a good plus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eexperience with ReactJS\u003c/li\u003e\n\u003cli\u003eperformance optimization for MongoDB, Redis and MySQL\u003c/li\u003e\n\u003cli\u003eexperience with microservices concepts\u003c/li\u003e\n\u003cli\u003eDevOps skills\u003c/li\u003e\n\u003cli\u003ebasic HTML/CSS knowledge\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on \u003ca href=\"https://careers.rebelmouse.com/o/senior-fullstack-engineer\"\u003ehttps://careers.rebelmouse.com/o/senior-fullstack-engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--391a8eb2ecb75e0021fcdbee8a136b6e4797f782/btn4.png"},{"id":"1d12c3c3-175a-4ca2-b9c5-306c9b682e95","type":"Full Time","url":"https://jobs.github.com/positions/1d12c3c3-175a-4ca2-b9c5-306c9b682e95","created_at":"Tue Jul 21 21:10:46 UTC 2020","company":"Volusion","company_url":"http://www.volusion.com","location":"Austin, TX","title":"Full Stack Engineer","description":"\u003cp\u003eCOVID 19 UPDATE: We are doing our part to flatten the curve so for the time being all interviews will be conducted virtually. As a company ALL employees are currently working remotely.\u003c/p\u003e\n\u003cp\u003eYour gift for analytical processing and bringing projects to perfect resolve has always been your strength. While you don’t seek glory or public recognition, you take satisfaction in knowing you’re great at what you do and that you’re an important part of a winning team. Volusion is seeking a team oriented, technical/analytical data-driven perfectionist to fill our open Full Stack Engineer role.\u003c/p\u003e\n\u003cp\u003eAbout Us:\nAt Volusion, we make products that people love. Our teams are dedicated to providing SaaS commerce solutions and services for all business types, ranging from startups to large enterprises. If you are the kind of engineer that loves working in teams, has a passion for driving positive change, and wants to change the world with your ideas, we want to hear from you. If you want to help build the world’s greatest software for our customers, you’ve come to the right place!\u003c/p\u003e\n\u003cp\u003eYou will:\n-Evolve our product and user interface: We are constantly adding new features for our customers, and with each new feature, we need professional, user-friendly interfaces that are technically performant and often need to make loads of API calls. You’ll be at the forefront of building these interfaces.\n-Build and expand a robust REST API: Our front-ends depend on clearly defined, performant APIs. You will help design our API endpoints and implement them in TypeScript and Node.js to ensure high performance and consistent results.\n-Interact with multiple data stores: We have multiple databases, both SQL and NoSQL. You will model data, determine the best database paradigm, roll out data changes, and ensure that your code as well as those of the platform team interacts with that model consistently and efficiently.\n-Push performance limits: We have tens of thousands of merchants. This is not a simple application with a few hundreds users, and it’s your code that will drive the interactions that fuel our merchants’ businesses. You will instrument, measure, tune, and find creative ways to remove bottlenecks with every line of code you write, on a daily basis.\n-Solve with creativity and autonomy: We don’t just want the simplest solution. We want great solutions that exhibit creativity, address customer needs, and allow you to flex your programming muscles.\u003c/p\u003e\n\u003cp\u003eWe are looking for someone with:\n3+ years building APIs backed by business logic in Java or Node.js\n2+ years building business logic in a JavaScript runtime (Node.js or TypeScript preferred)\n2+ years of interacting with databases using SQL either through direct access or frameworks that support SQL querying\nDemonstrable experience with performance and load testing\nWell-formed opinions on testing philosophy for APIs, deployment through continuous integration, and Agile\nE-Commerce or SaaS experience a major plus!\nA Bachelor of Science Degree in Electrical, Mechanical, Software, or other Engineering discipline\u003c/p\u003e\n\u003cp\u003eVolusion’s Technology Stack:\n-React (including React hooks), React with Redux, Relay, and server-side and client-side rendering\n-Public-facing REST APIs backed by TypeScript and Node.js\n-SQL and no-SQL Databases; specific experience with PostgreSQL and MongoDB is a plus\n-Google Cloud Platform including Kubernetes, Firebase, and managed database services\n-Search and caching using Elasticsearch, RediSearch, Algolia, and Redis\u003c/p\u003e\n\u003cp\u003eWho is also the embodiment of our culture code (we hope you are nodding your head in agreement as you browse through it!):\n-Humble: Have humility and be respectful; no egos allowed.\n-Effective: Get stuff done!\n-Adaptable: Willing to fill any role, anytime.  Going above/beyond the call of duty.\n-Transparent: Open and honest to self and others.\n-Collaborative: We favor teamwork and take ownership.\n-A founder: Think big, go fast, and solve for the customer.\u003c/p\u003e\n\u003cp\u003eBenefits \u0026amp; Perks:\n-Competitive compensation packages\n-Medical, Dental, Vision, and Voluntary Life Insurance\n-Paid parental leave\n-Flexible Paid Time Off\n-401(k) with Company Matching\n-On-site Fitness and Yoga Classes\n-Casual Dress\n-Breakfast taco and beer Fridays\n-Endless Supply of Tiny House Nitro Coffee, Bevi sparkling water, fruit and snacks\n-Two Volunteer Days Off\n-Bring Your Dog to Work Days\n-Adjustable desks\n-Chair Massages\n-Team Sports and Team Outings\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here \u003ca href=\"https://grnh.se/41ecbd081us\"\u003ehttps://grnh.se/41ecbd081us\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTJHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84fd6159ceb2966f3dd16eba6fcf26c60f8e7895/Volusion%20Logo.PNG"},{"id":"ad238ad6-46a1-4add-9d7a-0f924265600e","type":"Full Time","url":"https://jobs.github.com/positions/ad238ad6-46a1-4add-9d7a-0f924265600e","created_at":"Tue Jul 21 21:03:59 UTC 2020","company":"Volusion","company_url":"http://www.volusion.com","location":"Austin, TX","title":"Front End Engineer","description":"\u003cp\u003eThe Front End Engineer  that will join our no-nonsense development team is the epitome of a big picture thinker. The multi-tasking perfectionist we’re hunting for has the ability to analytically break down complex challenges and formulate action-steps to control the desired outcome faster than anyone. You see all the moving parts.\u003c/p\u003e\n\u003cp\u003eYou’ll have clear product feature goals but the freedom to deconstruct and implement those goals creatively. An older Angular front-end needs your attention and conversion to React and integration with our REST API. If you like moving fast, pushing tickets from Backlog to In Progress to Peer Review, working with other developers who love tough problems and taking ownership, this is a job you’ll love.\u003c/p\u003e\n\u003cp\u003eAbout Us:\nAt Volusion, we make products that people love. Our teams are dedicated to providing SaaS commerce solutions and services for all business types, ranging from startups to large enterprises. If you are the kind of engineer that loves working in teams, has a passion for driving positive change, and wants to change the world with your ideas, we want to hear from you. If you want to help build the world’s greatest software for our customers, you’ve come to the right place!\u003c/p\u003e\n\u003cp\u003eYou will:\n-Evolve our product and user interface: We are constantly adding new features for our customers, and with each new feature, we need professional, user-friendly interfaces that are technically performant and often need to make loads of API calls. You’ll be at the forefront of building these interfaces.\n-Move fast: We like to go! Failure is not getting something wrong; it’s taking so long to get something right that we miss an opportunity. If you like ownership and aren’t afraid to try things, adjust, improve, take responsibility, and try again, you’ll love our fast-paced engineering culture.\n-Establish and extend front end best practices: You won’t be just following someone else’s instructions or guidelines. You’ll be a key part of developing how we work with React, front end interfaces, our platform, and documentation.\n-Broaden our UI practice: Volusion is committed to user interface design and development being a core competency at Volusion. Join us and influence our next generation of front ends.\u003c/p\u003e\n\u003cp\u003eWe are looking for someone with:\n3+ years building application front ends\n2+ years using Angular, Vue, or another modern JavaScript framework\n2+ years developing React-based front-ends in a professional environment\nE-Commerce or SaaS experience a major plus!\nA Bachelor of Science Degree in Electrical, Mechanical, Software, or other Engineering discipline\u003c/p\u003e\n\u003cp\u003eVolusion’s Technology Stack:\n-JavaScript-based front-ends, especially Angular, React, and Node.js\n-React (including React hooks), React with Redux, Relay, and server-side and client-side rendering\n-Public-facing REST APIs\n-Google Cloud Platform including Kubernetes, Firebase, and managed database services\n-SQL and no-SQL Databases; specific experience with PostgreSQL and MongoDB is a plus\n-Search and caching using Elasticsearch, RediSearch, Algolia, and Redis\u003c/p\u003e\n\u003cp\u003eWho is also the embodiment of our culture code (we hope you are nodding your head in agreement as you browse through it!):\n-Humble: Have humility and be respectful; no egos allowed.\n-Effective: Get stuff done!\n-Adaptable: Willing to fill any role, anytime.  Going above/beyond the call of duty.\n-Transparent: Open and honest to self and others.\n-Collaborative: We favor teamwork and take ownership.\n-A founder: Think big, go fast, and solve for the customer.\u003c/p\u003e\n\u003cp\u003eBenefits \u0026amp; Perks:\n-Competitive compensation packages\n-Medical, Dental, Vision, and Voluntary Life Insurance\n-Paid parental leave\n-Flexible Paid Time Off\n-401(k) with Company Matching\n-On-site Fitness and Yoga Classes\n-Casual Dress\n-Breakfast taco and beer Fridays\n-Endless Supply of Tiny House Nitro Coffee, Bevi sparkling water, fruit and snacks\n-Two Volunteer Days Off\n-Bring Your Dog to Work Days\n-Adjustable desks\n-Chair Massages\n-Team Sports and Team Outings\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here \u003ca href=\"https://grnh.se/ed6d11a41us\"\u003ehttps://grnh.se/ed6d11a41us\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a4c7ddb29592c1f1fb5bc1d7a6b93a50356edcf2/Volusion%20Logo.PNG"},{"id":"aab1f50a-a7b3-4896-99c0-89e9cd9f3ea7","type":"Full Time","url":"https://jobs.github.com/positions/aab1f50a-a7b3-4896-99c0-89e9cd9f3ea7","created_at":"Tue Jul 21 11:51:30 UTC 2020","company":"Avrios International AG","company_url":"https://www.avrios.com/","location":"Berlin","title":"Full Stack Engineer (f/m/x)","description":"\u003cp\u003eFounded in 2015 by a team of serial entrepreneurs, Avrios has been building an award-winning solution for mobility management and is one of the fastest growing SaaS companies in Europe. Our platform helps companies provide tailored transportation to employees, enabling them to attract top talent while keeping transportation expenses and CO₂ emissions under control. Fueled by a passionate team composed of more than 20 nationalities, Avrios continues its growth journey of putting mobility within everyone's reach and building the mobility platform of the future.\u003c/p\u003e\n\u003cp\u003eWe are looking for \u003cstrong\u003eFull Stack Engineers\u003c/strong\u003e to join our cross-functional distributed product team that works with a dual-track agile process, to help us:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinue to quickly validate product ideas and ship working software that our customers love.\u003c/li\u003e\n\u003cli\u003eBuild customer-facing features using Angular, TypeScript, Sass and Webpack.\u003c/li\u003e\n\u003cli\u003eBuild scalable backend services, data pipelines and APIs using Amazon Web Services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRe-imagining how our customers can engage with suppliers in the fleet industry, handling all transactions through our marketplace platform.\u003c/li\u003e\n\u003cli\u003eMaking it possible for customers on our free tier to be completely self-serviced, by automating all processes and nurturing them to be engaged customers of our product.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat you bring:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 2 years of experience as a full stack engineer.\u003c/li\u003e\n\u003cli\u003eYou can write client-side JavaScript or TypeScript using modern language features.\u003c/li\u003e\n\u003cli\u003eYou have some familiarity with Angular or are excited to learn it.\u003c/li\u003e\n\u003cli\u003eYou have experience with a backend language of choice (e.g. Java, Python, Go etc.)\u003c/li\u003e\n\u003cli\u003eDesired: Professional experience on a cross-functional product team and exposure to architectural patterns of high-scale web applications.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eWho we are looking for:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an exceptionally talented software engineer.\u003c/li\u003e\n\u003cli\u003eYou are passionate about building world-class experiences that delight our customers.\u003c/li\u003e\n\u003cli\u003eYou're proud of the code you write, but you're also pragmatic.\u003c/li\u003e\n\u003cli\u003eYou're focused, driven and can get projects across the finish line.\u003c/li\u003e\n\u003cli\u003eYou have experience running apps in production.\u003c/li\u003e\n\u003cli\u003eYou're empathetic, humble and love to help your teammates grow.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive compensation and a generous education budget\u003c/li\u003e\n\u003cli\u003eClear team objectives within a product-led company.\u003c/li\u003e\n\u003cli\u003eThe ability to influence and define what you’re building within those objectives.\u003c/li\u003e\n\u003cli\u003eA welcoming and collaborative environment with a passionate and diverse team.\u003c/li\u003e\n\u003cli\u003eA modern remote working culture that cares about results not hours spent\u003c/li\u003e\n\u003cli\u003eUse of a co-working in space in the heart of Berlin\u003c/li\u003e\n\u003cli\u003eWe encourage you to apply if this role excites you - even if you think you may not meet all requirements listed above.\u003c/li\u003e\n\u003cli\u003eWe don't accept CVs from recruitment agencies, all sent agency CVs will be treated as direct applicants\u003c/li\u003e\n\u003cli\u003eRemote candidates living in Germany are encouraged to apply\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://avrios.join.com/jobs/1212097-full-stack-engineer-f-m-x-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bberlin\"\u003ehttps://avrios.join.com/jobs/1212097-full-stack-engineer-f-m-x-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35a9227a9d049f25683ab8a77a89690e007b7ae4/Avrios-logo-new.png"},{"id":"fc9f6283-8124-4695-a74c-5481f4bd7fd7","type":"Full Time","url":"https://jobs.github.com/positions/fc9f6283-8124-4695-a74c-5481f4bd7fd7","created_at":"Tue Jul 21 09:51:43 UTC 2020","company":"dirico.io","company_url":"https://www.dirico.io/","location":"Koblenz","title":"Fullstack Developer (m/w/d)","description":"\u003cp\u003eWir sind die 247GRAD Labs GmbH, das IT-Unternehmen hinter \u003ca href=\"http://dirico.io/\"\u003edirico.io\u003c/a\u003e, der All-in-one-Plattform für Kommunikations- und Marketingteams.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://dirico.io/\"\u003edirico.io\u003c/a\u003e unterstützt Unternehmen weltweit dabei, ihren Content besser zu planen, zu erstellen und zu veröffentlichen als jemals zuvor. Das macht unsere Kunden so glücklich, dass sie \u003ca href=\"http://dirico.io/\"\u003edirico.io\u003c/a\u003e bereits in über 20 Ländern einsetzen. Unser Kundenkreis wächst stetig und beinhaltet einige der Top-50-Unternehmen Deutschlands.\u003c/p\u003e\n\u003cp\u003eDeshalb suchen wir Dich als Unterstützung für unser Team in Koblenz und Oradea (Rumänien).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDas wären deine Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNeu- und Weiterentwicklung unserer Softwarelösung mit den Schwerpunkten C#, .NET, React und Angular\u003c/li\u003e\n\u003cli\u003eErstellung von Systemarchitektur und Softwaredesign\u003c/li\u003e\n\u003cli\u003eAktive Mitgestaltung der Infrastruktur und eingesetzten Prozesse im Entwicklungsteam\u003c/li\u003e\n\u003cli\u003eEinsatz und Test modernster Praktiken und Umsetzung neuer Ideen\u003c/li\u003e\n\u003cli\u003eEvaluierung und Auswahl neuer Technologien für die Nutzung in der Entwicklung\u003c/li\u003e\n\u003cli\u003eZusammenarbeit in einem international agierenden Umfeld von Entwicklungsteams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas solltest Du mitbringen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSehr gute Kenntnisse in .NET und C#\u003c/li\u003e\n\u003cli\u003eKenntnisse in mindestens einem der JavaScript-Frameworks wie React, Angular oder Vue.js\u003c/li\u003e\n\u003cli\u003eErfahrungen mit TypeScript, HTML und CSS sind gerne gesehen\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse im Bereich von relationalen Datenbanken/SQL, Design Pattern sowie gängigen Frameworks (z.B. EF)\u003c/li\u003e\n\u003cli\u003eOptimalerweise bringst du Erfahrungen zu Schnittstellen von Social-Media-Plattformen mit\u003c/li\u003e\n\u003cli\u003eSicherer Umgang mit objektorientiertem Code, UML und Design Patterns\u003c/li\u003e\n\u003cli\u003eScrum, Git und Clean Code sind keine Fremdwörter, sondern alte Bekannte\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse der deutschen und der englischen Sprache\u003c/li\u003e\n\u003cli\u003eEine analytische und strukturierte Arbeitsweise, Zuverlässigkeit und Lösungskompetenz zeichnen dich aus, messbare Ergebnisse sind Dir wichtig\u003c/li\u003e\n\u003cli\u003eDu bist bereit, dich weiterzuentwickeln und neuen Herausforderungen zu stellen\u003c/li\u003e\n\u003cli\u003eErfahrungen mit der Azure Plattform runden Dein Profil ab\u003c/li\u003e\n\u003cli\u003eSelbstständige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eDu bist engagiert und hast Interesse daran, Dich mit Deiner Meinung aktiv im Team einzubringen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas erwartet dich bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin innovatives Softwareprodukt\u003c/li\u003e\n\u003cli\u003eHerausragenden Referenzkunden wie Volkswagen, die Deutsche Telekom oder Sixt\u003c/li\u003e\n\u003cli\u003eEin junges, stark wachsendes und motiviertes Team\u003c/li\u003e\n\u003cli\u003eEchte Start-up Atmosphäre\u003c/li\u003e\n\u003cli\u003eAbwechslungsreiche und anspruchsvolle Aufgaben\u003c/li\u003e\n\u003cli\u003eFlache Hierarchien und schnelle Entscheidungswege\u003c/li\u003e\n\u003cli\u003eAgile Arbeitsprozesse\u003c/li\u003e\n\u003cli\u003eTopmoderne Hardware\u003c/li\u003e\n\u003cli\u003eWir unterstützen dich bei deiner fachlichen und persönlichen Weiterentwicklung\u003c/li\u003e\n\u003cli\u003eInteressante Gestaltungs- und Entwicklungsperspektiven\u003c/li\u003e\n\u003cli\u003eFrisches Obst, Espresso, Cappuccino, Latte Macchiato \u0026amp; Kaffee for free\u003c/li\u003e\n\u003cli\u003eZuschuss zum Premium Fitnessstudio “Danys”\u003c/li\u003e\n\u003cli\u003eRegelmäßige Teamevents\u003c/li\u003e\n\u003cli\u003eSpaziergänge an der Mosel\u003c/li\u003e\n\u003cli\u003eE-Scooter zur schnellen Runde um den Block\u003c/li\u003e\n\u003cli\u003eSchickes Büro mit Blick auf die Mosel\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge\u003c/li\u003e\n\u003cli\u003eDu kannst deinen Hund mitbringen\u003c/li\u003e\n\u003cli\u003eDu kannst im Hoodie kommen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/959c3d3cd7d431afe5c63d2852d0ea745f7df1a1/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f34656635623364656162393765303930626463363066663831303134396564333932333539373731623635316661643236323235636538626131343335363537\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/e5d83a1dc96461c8d41908edce6b10cfa02b18cc530e86dea00b81d3af133d20\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHFHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6a6dbb1327720c4460bed4e85b1a0c615a65df8b/dirico.io.png"},{"id":"7beb6f29-2076-431d-ad4a-2c8262e92e6c","type":"Full Time","url":"https://jobs.github.com/positions/7beb6f29-2076-431d-ad4a-2c8262e92e6c","created_at":"Tue Jul 21 07:36:06 UTC 2020","company":"Valve+Meter","company_url":"https://ltpx.nl/PklQTHG","location":"Indianapolis","title":"Web Developer ","description":"\u003cp\u003e\u003cstrong\u003eWeb Developer\u003c/strong\u003e_ \nIndianapolis, United States_\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Us\u003c/strong\u003e\nWe've named our practice Valve+Meter because the variables we can manage with you are the flow and cost of new business. The \"valve\" part of our approach manages the right rate of new business for your operation, and we set our pricing with you not based on the activities we pursue but on the \"metered\" results we generate.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMission\u003c/strong\u003e\nWe exist to change the way businesses approach marketing by delivering abundance and accountability with a customer cost per acquisition strategy.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVision\u003c/strong\u003e\nWe inspire businesses to look at marketing as a revenue center rather than a cost center.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCore Values\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThink: Focus. Find a way forward.\u003c/li\u003e\n\u003cli\u003eLove: Act in the long-term best interest of another.\u003c/li\u003e\n\u003cli\u003eServe: Meet expectations. Go the extra mile.\u003c/li\u003e\n\u003cli\u003eTransform: Create dramatic change. Be irreplaceable.\u003c/li\u003e\n\u003cli\u003eBe Just: Be fair and transparent. Do no harm.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIn a Nutshell\u003c/strong\u003e\nValve+Meter is in search of a Web Developer to join our growing agency. If you love collaborating, innovating, and learning, then we want to hear from you. The ideal candidate will have a core focus in WordPress development with a secondary background in custom software development in PHP or other languages and frameworks.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy this Role is Important\u003c/strong\u003e\nThe Web Developer is a key contributor to our marketing services team. You will develop customized WordPress websites for our clients including backend wordpress development, theme preparation, and template implementation.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat Valve+Meter Offers\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive Base Salary: $55,000 - $65,000.\u003c/li\u003e\n\u003cli\u003eExcellent Benefits Package Including:\u003c/li\u003e\n\u003cli\u003eMedical, Dental, and Vision.\u003c/li\u003e\n\u003cli\u003e401(k) Match.\u003c/li\u003e\n\u003cli\u003eCompany-Paid Life Insurance Policy.\u003c/li\u003e\n\u003cli\u003eYMCA Membership Assistance.\u003c/li\u003e\n\u003cli\u003eThree Weeks of Paid Time Off.\u003c/li\u003e\n\u003cli\u003eTen Paid Holidays.\u003c/li\u003e\n\u003cli\u003eTwo Paid Service Days.\u003c/li\u003e\n\u003cli\u003eCasual Dress Code.\u003c/li\u003e\n\u003cli\u003ePet Friendly Office.\u003c/li\u003e\n\u003cli\u003eAlcohol Permitted Onsite.\u003c/li\u003e\n\u003cli\u003eEnvironment for Fast Career Growth.\u003c/li\u003e\n\u003cli\u003eCurrently Offer Remote Work Option (evaluating this as a long-term option).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhile the team is currently offering work-from-home flexibility due to COVID-19, applicants must be able to work out of the Indianapolis, Indiana office, when required.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat the Role Is\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEach V+M employee must represent our core values in each interaction.\u003c/li\u003e\n\u003cli\u003eOur office is located in the Fort Ben Area of Indianapolis; all employees work from that location when the office is open.\u003c/li\u003e\n\u003cli\u003eThis role reports to the Director of Digital Marketing.\u003c/li\u003e\n\u003cli\u003eResponsibilities:\u003c/li\u003e\n\u003cli\u003eWebsite Management.\u003c/li\u003e\n\u003cli\u003eWebsite Development.\u003c/li\u003e\n\u003cli\u003eWebsite Maintenance.\u003c/li\u003e\n\u003cli\u003eSite Speed Optimization.\u003c/li\u003e\n\u003cli\u003eConversion Rate Optimization.\u003c/li\u003e\n\u003cli\u003eWebsite Monitoring\u003c/li\u003e\n\u003cli\u003eActivities:\u003c/li\u003e\n\u003cli\u003eTurn custom .psd \u0026amp; Adobe XD designs into fully responsive and lightweight WordPress themes.\u003c/li\u003e\n\u003cli\u003eDevelop partial theme customization on projects with parallel development efforts.\u003c/li\u003e\n\u003cli\u003eCustomize WordPress functions, custom fields, and write unique plugins for client specific applications.\u003c/li\u003e\n\u003cli\u003eWork closely with other team members on existing client websites and development of HTML/CSS/JavaScript/Wordpress-based templates.\u003c/li\u003e\n\u003cli\u003eDesign, develop, and extend custom WordPress solutions to support unique client needs.\u003c/li\u003e\n\u003cli\u003eCustomize WP Admin for data input and leverage third party plugins (Such as ACF).\u003c/li\u003e\n\u003cli\u003eStrategize and perform data migrations from other web platforms onto WordPress.\u003c/li\u003e\n\u003cli\u003eProvide end-user WordPress technical support, instruction, and troubleshooting.\u003c/li\u003e\n\u003cli\u003ePerform routine updates to WordPress core, plugins, and other dependencies.\u003c/li\u003e\n\u003cli\u003eMonitor and analyze existing sites for opportunities for improvement and optimization.\u003c/li\u003e\n\u003cli\u003eCollaborate with multi-disciplinary project stakeholders to ensure requirements are being met.\u003c/li\u003e\n\u003cli\u003eTest all new and existing sites for performance, scalability and browser compatibility.\u003c/li\u003e\n\u003cli\u003eEnsure compliance with all coding standards and web accessibility.\u003c/li\u003e\n\u003cli\u003eStay up to date on the latest community trends and make recommendations to the team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eStandard Software\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProductivity Suite: Google G Suite.\u003c/li\u003e\n\u003cli\u003eVideo Conference: Google Meet.\u003c/li\u003e\n\u003cli\u003eProject Management: Asana.\u003c/li\u003e\n\u003cli\u003eTime Tracking: Harvest.\u003c/li\u003e\n\u003cli\u003eInstant Messaging: Slack.\u003c/li\u003e\n\u003cli\u003eCRM: Pipedrive.\u003c/li\u003e\n\u003cli\u003eAutomation: Zapier.\u003c/li\u003e\n\u003cli\u003ePassword Manager: 1Password.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequired:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience delivering results.\u003c/li\u003e\n\u003cli\u003eBachelor’s degree or Equivalent work experience.\u003c/li\u003e\n\u003cli\u003e1 year experience in PHP, MySQL, HTML, CSS and Javascript, accessibility, platform compatibility, and all other areas of front-end development.\u003c/li\u003e\n\u003cli\u003e1 year experience in developing for WordPress or other CMS platforms.\u003c/li\u003e\n\u003cli\u003eWorking knowledge of WordPress theme development including the template hierarchy, custom post types and taxonomies, custom loops, actions, filters, and PHP functions.\u003c/li\u003e\n\u003cli\u003eExperience with version control systems such as Git/ GitLab.\u003c/li\u003e\n\u003cli\u003eKnowledge of general best practices in web development, SEO, security, and scalability.\u003c/li\u003e\n\u003cli\u003eExperience converting visual designs into clean, commented, valid templates.\u003c/li\u003e\n\u003cli\u003eMeticulous attention to detail and a keen understanding of UI, UX and web design patterns.\u003c/li\u003e\n\u003cli\u003eShould be a clear communicator, a self-starter, an open collaborator and deadline-oriented.\u003c/li\u003e\n\u003cli\u003eThorough understanding of responsive design principles for mobile development.\u003c/li\u003e\n\u003cli\u003eAbility to balance projects and manage time efficiently.\u003c/li\u003e\n\u003cli\u003eStrong communication skills to allow for efficient team collaboration.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePreferred:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience working at a marketing agency.\u003c/li\u003e\n\u003cli\u003eFull time experience in the position.\u003c/li\u003e\n\u003cli\u003eExperience tracking time to specific clients and projects.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow to Apply\u003c/strong\u003e\nSubmit your resume along with a cover letter. In that cover letter include one of your favorite websites and what you appreciate about it. We prefer resumes that do NOT include a personal photograph.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\nYou can apply via the \u003ca href=\"https://ltpx.nl/eAMJWKG\"\u003e\u003cstrong\u003eonline application form\u003c/strong\u003e\u003c/a\u003e. For more information, visit \u003cstrong\u003e\u003ca href=\"https://ltpx.nl/PklQTHG\"\u003evalveandmeter.recruitee.com\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/32fdd8f1d933a99be3260372178375727854485c/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313733373337\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/GAj5Rin\"\u003eApply here!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--334813fb6cdfcc7de02ca4b49b7f98e22ed37528/Valve%20meter%20logo.png"},{"id":"14f9032c-6559-4b1a-aad8-fd52f6618931","type":"Full Time","url":"https://jobs.github.com/positions/14f9032c-6559-4b1a-aad8-fd52f6618931","created_at":"Sat Jul 18 00:24:59 UTC 2020","company":"www.strategybox.com","company_url":"http://www.strategybox.com","location":"Vancouver","title":"Front End Developer","description":"\u003cp\u003eDo you find yourself looking at apps and noting how they've used negative space poorly?\u003c/p\u003e\n\u003cp\u003eWant to work with an engaged group of people who are interested in seeing you stretch yourself, deepen your craft and have fun?\u003c/p\u003e\n\u003cp\u003eStrategyBox is venture-backed platform, growing 300% month-over-month, making it easy to understand how marketing drives sales. Then using ML to recommend what to do next to drive up sales. We’re looking for a Front-End Developer to revamp our Dashboards and User Platform.\u003c/p\u003e\n\u003cp\u003eYou’d be working with a team that’s spent 10+ years leading marketing attribution for the likes of Dell and Mediacom, love to laugh and build things that work really well and help our customers grow.\u003c/p\u003e\n\u003cp\u003eWe want you to be 92 years old, looking back at your life and saying \"I did the most fulfilling work of my career at StrategyBox. I'm still in touch with people I met there today.\"\u003c/p\u003e\n\u003cp\u003eAbout StrategyBox\u003c/p\u003e\n\u003cp\u003eStrategyBox is a marketing analytics suite that puts marketing and customer data in one spot. Benchmarks performance against competitors and calculates Influencer ROI. Then recommends what to do next to drive up results.\u003c/p\u003e\n\u003cp\u003eWe are well capitalized with a sustainable, scalable business model. Our Leadership Team's ambition is a global business that runs like a Swiss watch. So we can run far, and fast, together.\u003c/p\u003e\n\u003cp\u003eWhy Work for Us\u003c/p\u003e\n\u003cp\u003eWe're an organization where 'A Players' do the best work of their careers. Think NASA in the late 60's, Mid-90's Chicago Bulls or Tom Ford-era Gucci.\u003c/p\u003e\n\u003cp\u003eWe do this by giving you the field of play, the rules of the game and clear goals.\u003c/p\u003e\n\u003cp\u003eWhether that's Accounts Payable or Database Engineering you bring your full Self to work every day to execute to your fullest potential.\u003c/p\u003e\n\u003cp\u003eOur promise to you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou understand how your work impacts the business we're building.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou'll do work that is fulfilling and fun with a group people genuinely interested in seeing you do well.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou're treated like a responsible adult. Want to take time off? Cool. Just ensure your deliverables are met when you said they were going to be.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we ask of you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou Know What Lights You Up - you've found that thing - making order out of chaos or creating elegant code - that sparks your sense of 'Whoa. This is fun.'\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e100% Responsible - you are responsible for your thoughts, feelings and actions. You take ownership of      how you respond to situations. Owning the outcomes of your actions and the      results of your work.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe Present - you have practices to keep you 'in the moment,' and a chattering mind at bay, so you can do your best work.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIntegrity - any of your actions, messages or conversations could be reprinted on the NYTimes.com homepage and you would feel comfortable.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA Good Laugh - you realize we're not getting out of this 'Life' thing alive and you might as well laugh. A lot.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe Role\u003c/p\u003e\n\u003cp\u003eA pragmatic front-end developer is required to build up, adapt, and maintain client-side applications and interfaces for both internal and external use.  You’ll work closely with our CTO, Lead Developer and CEO to produce simple-to-use and easy-to-comprehend tools to interface with APIs.\u003c/p\u003e\n\u003cp\u003eYou Have Experience With\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e3+ years building software\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHTML, CSS and Javascript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eReact and surrounds\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking with APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGit\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs well as excellent communication skills, and familiarity with the computer sciences.  Some familiarity with Python, Linux and business intelligence tools would be beneficial, but is not necessary.\u003c/p\u003e\n\u003cp\u003eCandidates with public GitHub, BitBucket, or similar profile and samples preferred.\u003c/p\u003e\n\u003cp\u003eFor the right candidate, we offer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA work culture that respects your time and energy\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCompetitive salary and profit sharing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnlimited Vacation\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtended Healthcare Benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA beautiful office in downtown Vancouver or option to work remotely\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSkilled and friendly coworkers with diverse interests\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested in Applying? Here's the Process:\u003c/p\u003e\n\u003cp\u003ePrepare a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile.\u003c/p\u003e\n\u003cp\u003eSend that to \u003ca href=\"mailto:jobs@strategybox.com\"\u003ejobs@strategybox.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIf selected, you'll go through three interviews:\u003c/p\u003e\n\u003cp\u003ePreliminary Interview\u003c/p\u003e\n\u003cp\u003eTechnical Review\u003c/p\u003e\n\u003cp\u003eCulture Fit Interview\u003c/p\u003e\n\u003cp\u003eFor some applicants we also will offer a short, paid project to ensure you like the work and what we're up to.\u003c/p\u003e\n\u003cp\u003eWe're looking forward to meeting you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile to \u003ca href=\"mailto:jobs@strategybox.com\"\u003ejobs@strategybox.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99e3b3f3397d9a5b63d69cb04d9c425bd97d47ff/SB_LogoTag_WEB.jpg"},{"id":"a73a21f9-4cdb-47e9-b231-4c81eda6f514","type":"Full Time","url":"https://jobs.github.com/positions/a73a21f9-4cdb-47e9-b231-4c81eda6f514","created_at":"Fri Jul 17 19:14:12 UTC 2020","company":"Bitovi","company_url":"http://Bitovi","location":"USA","title":"JavaScript Developer","description":"\u003cp\u003e\u003cstrong\u003eABOUT BITOVI:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBitovi helps companies create better web applications.\u003c/p\u003e\n\u003cp\u003eWe have a track record of designing and building high-profile and amazing web applications through our active Consulting practice.  Our apps are built with tests, full docs and a deployment process in place. We created the open source tools powering the applications we build.\u003c/p\u003e\n\u003cp\u003eBitovi has been a pioneer in producing advanced JavaScript frameworks and tools for almost a decade. We develop and maintain several open source products such as CanJS, DoneJS, and StealJS to name a few.\u003c/p\u003e\n\u003cp\u003eOur team is comprised of about 30ish developers and designers located around the US and Canada.. This is a remote, full-time position.  Due to travel requirements, at this time we are seeking candidates in the US who are willing and able to travel (once travel resumes after COVID-19).  Future travel will average approximately 1 week every 6-8 weeks.\u003c/p\u003e\n\u003cp\u003eOur article, \u003ca href=\"https://www.bitovi.com/blog/hello-potential-bitovian\"\u003eHello Potential Bitovian\u003c/a\u003e sums it up very well (NOTE: a good short read for interested candidates!)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE’RE LOOKING FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for highly qualified individuals with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ea good understanding of Computer Science (CS degree, or equivalent knowledge is required)\u003c/li\u003e\n\u003cli\u003ea solid background in Modern Front End Development, including JavaScript frameworks\u003c/li\u003e\n\u003cli\u003e3+ years professional experience developing enterprise applications\u003c/li\u003e\n\u003cli\u003estrong communication and interpersonal skills who are comfortable interacting with clients\u003c/li\u003e\n\u003cli\u003eReact or Angular experience a bonus!  (Please note in your intro)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of tech keywords.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTHE JOB:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou’ll work with clients to create applications, discussing and designing architectures, reviewing code, and researching new front-end technologies.\u003c/p\u003e\n\u003cp\u003eYou’ll work with other Bitovians, helping us to advance, improve, and evolve our Open Source toolset.\u003c/p\u003e\n\u003cp\u003eYou’ll have the opportunity to shape a small and growing company by applying your talent and passion to the JavaScript community in your own way.\u003c/p\u003e\n\u003cp\u003eWe support the technical growth and development of our employees. We have an open and engaging community of skilled developers with whom you can collaborate and learn with.\u003c/p\u003e\n\u003cp\u003eBitovians often:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePresent at conferences\u003c/li\u003e\n\u003cli\u003eGive trainings\u003c/li\u003e\n\u003cli\u003ePlan and run meetups\u003c/li\u003e\n\u003cli\u003eCreate and maintain open source projects\u003c/li\u003e\n\u003cli\u003eWrite articles\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eA LITTLE BIT MORE:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe welcome individuals who enjoy identifying the hard parts of application development and simplifying them, talking about software architecture, and teaching others. We also want someone who can lead others and be an integral part of a team.\u003c/p\u003e\n\u003cp\u003eSpecifically, the following attributes are major positives:\nHas an eagerness to learn and execute in the “the right way”\nIs open minded about development best practices\nHas some experience with back-end systems and databases\nSome experience contributing to or using open source projects\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS:\u003c/strong\u003e\nBitovians get a slate of great benefits. Bitovi offers:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and yearly bonuses\u003c/li\u003e\n\u003cli\u003eBi-annual company retreats to places like Las Vegas, New Orleans, and Amelia Island, Florida\u003c/li\u003e\n\u003cli\u003e401(k) plan with matching\u003c/li\u003e\n\u003cli\u003e4 weeks of paid vacation\u003c/li\u003e\n\u003cli\u003eHealth and dental insurance\u003c/li\u003e\n\u003cli\u003eLTD and Life Insurance\u003c/li\u003e\n\u003cli\u003eGym membership reimbursement\u003c/li\u003e\n\u003cli\u003ePaid Maternity \u0026amp; Paternity leave\u003c/li\u003e\n\u003cli\u003eWorking from home with flexible hours\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eHOW TO APPLY:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWrite a resume and a thoughtful introduction (cover letter!) that shows us that you’re the kind of person we’ve described above.  Your thoughtful introduction should cover why you are interested in this role, something you recently worked on and are proud of, and a fun fact about yourself.  Don't skip this part !\nUse \u003ca href=\"https://bitovi.applytojob.com/apply/91twbGiFxB/JavaScript-Developer-And-Consultant-Remote?source=github\"\u003ethis link\u003c/a\u003e to apply.\u003c/p\u003e\n\u003cp\u003e*Please note that we are not interested in working with Recruiters or Hiring firms at this time.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajZHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1e278bf6fa174e78ad5bba5b2df50361a2296861/bitovi_bits_red.png"},{"id":"72de09f2-5bc6-489f-be90-3d38e505e20a","type":"Full Time","url":"https://jobs.github.com/positions/72de09f2-5bc6-489f-be90-3d38e505e20a","created_at":"Thu Jul 16 12:01:05 UTC 2020","company":"Adswizz","company_url":"https://www.adswizz.com/","location":"Bucharest","title":"Full Stack Developer","description":"\u003cp\u003eFor our Internal Apps team in Bucharest, located in Sky Tower building (highest high in Romania), we are hiring a Full-stack Developer, with strong, proven JavaScript skills for building solid UIs. The team supports several services that help AdsWizz operate better regarding the finance team, billing users, and data center operations. In order to support all of these different areas, we need to work closely with our colleagues and partners, building products that allow these different teams to move fast.\nAt AdsWizz, our software suite includes a variety of ad technology capabilities, including dynamic ad insertion, advanced programmatic platforms, ad campaign monitoring tools, and more.\u003c/p\u003e\n\u003cp\u003eAs a Full Stack Developer, you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with a new team developing internal applications to support enterprise operations\u003c/li\u003e\n\u003cli\u003ePlay a role in re-imagining productivity by shipping products that serve different aspects within AdsWizz\u003c/li\u003e\n\u003cli\u003eContinual improvement of tech stack and processes\u003c/li\u003e\n\u003cli\u003eIdentify and fix any performance issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Job Requirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor Degree in Computer Science, Mathematics and Informatics or equivalent\u003c/li\u003e\n\u003cli\u003eOverall knowledge of the Java ecosystem\u003c/li\u003e\n\u003cli\u003eHands-on experience using Spring Boot\u003c/li\u003e\n\u003cli\u003eExposure to MongoDB preferred\u003c/li\u003e\n\u003cli\u003eCloud experience with AWS preferred\u003c/li\u003e\n\u003cli\u003eMinimum of 2 years in Frontend Development\u003c/li\u003e\n\u003cli\u003eExperience with at least one modern JS framework (Vue, React, Angular)\u003c/li\u003e\n\u003cli\u003eExperience with HTML5, CSS and JavaScript\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur offer (bonuses, benefits) - what’s in it for you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCasual \u0026amp; friendly working environment with opportunities to impact the company with your ideas and involvement\u003c/li\u003e\n\u003cli\u003eWe have a start-up culture, product-centric, international/multi-cultural environment in each office and easy-going communication style (even with Top Management)\u003c/li\u003e\n\u003cli\u003eTechnology diversity, interesting technical exposure in building the best ad-tech product on the market\u003c/li\u003e\n\u003cli\u003eFlexible working schedule and work-from-home option, within predefined rules\u003c/li\u003e\n\u003cli\u003eIndividual trainings budget to use as you like for career improvement\u003c/li\u003e\n\u003cli\u003eBonus system, on top of base salary, paid quarterly (for real, not just on paper)\u003c/li\u003e\n\u003cli\u003ePaid days off related to quarterly performance\u003c/li\u003e\n\u003cli\u003eDay off on your birthday (or within that month if it falls on the weekend)\u003c/li\u003e\n\u003cli\u003eSports bonus for activities such as gym, dances, yoga, etc.\u003c/li\u003e\n\u003cli\u003eWe encourage your healthy lifestyle with company paid enrollment for running or biking events\u003c/li\u003e\n\u003cli\u003eMeal tickets\u003c/li\u003e\n\u003cli\u003eGift cards for special events (e.g.: Easter, 1st of June, 8th of March, Christmas)\u003c/li\u003e\n\u003cli\u003eMedical coverage to keep you healthy\u003c/li\u003e\n\u003cli\u003eParking lots at Sky Tower\u003c/li\u003e\n\u003cli\u003eAdsWizz technical books library – you can propose new technical books to be bought by the company\u003c/li\u003e\n\u003cli\u003eBookster subscription\u003c/li\u003e\n\u003cli\u003eGood hardware devices (new laptops / Mac’s, displays etc.)\u003c/li\u003e\n\u003cli\u003eOffice relaxation areas (ping-pong, foosball etc.)\u003c/li\u003e\n\u003cli\u003eTeam buildings – each team goes on outings to keep that flame alive\u003c/li\u003e\n\u003cli\u003eAnnual Christmas party – the best company party you’ve ever seen\u003c/li\u003e\n\u003cli\u003eFamily events (e.g.: Halloween and Christmas party for employees’ kids)\u003c/li\u003e\n\u003cli\u003eThemed team events nights (casino night, boardgames night, scary movies night, etc.)\u003c/li\u003e\n\u003cli\u003eCatered lunch-time meetings\u003c/li\u003e\n\u003cli\u003eWe have weekly fresh fruit along with coffee and tea to keep that brain in top shape, orange juice \u0026amp; vending machine on premise as well\u003c/li\u003e\n\u003cli\u003eCSR activities (cake auctions, yard sales, blood donation campaigns at our office)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWanna see how Belgian chocolate goes with technology? Come and join a community of the smartest folks you’ve ever met, that want to aim for the sky and want to use their skills to make a difference!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.adswizz.com/our-careers#!/job/4655034002?utm_source=github\u0026amp;utm_medium=smartdreamers\u0026amp;utm_campaign=July_2020_%7C_Tech_-_Carusel_%20_Reddit_V2\"\u003ehttps://www.adswizz.com/our-careers#!/job/4655034002?utm_source=github\u0026amp;utm_medium=smartdreamers\u0026amp;utm_campaign=July_2020_%7C_Tech_-_Carusel_%20_Reddit_V2\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e1179a81b464c0745dbc8425721bc2fd18c91588/Adswizz.png"},{"id":"285aa472-990f-418d-b376-e03c27f48d17","type":"Full Time","url":"https://jobs.github.com/positions/285aa472-990f-418d-b376-e03c27f48d17","created_at":"Wed Jul 15 14:22:21 UTC 2020","company":"OrbitalAds","company_url":"https://orbitalads.com","location":"Madrid (Spain)","title":"Frontend Engineer","description":"\u003cp\u003eHi there! We're growing the Frontend team in our Madrid office, and you can be a part of that journey. Are you looking for an adventure?\u003c/p\u003e\n\u003cp\u003eIn OrbitalAds, we are a diverse team of passionate problem-solvers, working hard focused on optimising the performance of Google Ads campaigns and accounts through the automation of keywords management. We do so through the development of in-house technology that we have packaged into a pretty cool product.\u003c/p\u003e\n\u003cp\u003eAs a Front End Developer, you'll work closely with our Product, Design, and Backend Teams. Our mission, as a Front End Team, is growing our Interface and Web projects and improving it every day with a clean code of good practices. We are looking for a person who is capable of solving problems and adapt to different changes as working as a team.\u003c/p\u003e\n\u003cp\u003eYou would be joining an agile, flexible and dynamic company. Sound good to you?\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAs a Front End Engineer, you will:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for improving, developing new features, and supporting for existing applications\u003c/li\u003e\n\u003cli\u003eWork closely with our Back End, UX, and UI teams\u003c/li\u003e\n\u003cli\u003eFind a specialisation inside frontend stack\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat skills do I need?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2 Years experience as a Frontend developer\u003c/li\u003e\n\u003cli\u003eKnowledge of modern Javascript stack (ES6, ESNext, Webpack, Babel... )\u003c/li\u003e\n\u003cli\u003eExperience with Google Firebase\u003c/li\u003e\n\u003cli\u003eExperience with ReactJS (Knowledge on other frameworks is also considered)\u003c/li\u003e\n\u003cli\u003eYou have worked with APIs (like Adwords API, FB Ads API) will be considered a plus\u003c/li\u003e\n\u003cli\u003eYou have worked with version control (preferably git)\u003c/li\u003e\n\u003cli\u003ePrevious experience with unit testing. Interest on other testing implementations will be considered a plus\u003c/li\u003e\n\u003cli\u003eAn analytical mindset\u003c/li\u003e\n\u003cli\u003ePassion for new technologies\u003c/li\u003e\n\u003cli\u003eHave soft skills (teamwork, good communication, problem-solving)\u003c/li\u003e\n\u003cli\u003eFluent English\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy you might NOT enjoy this position:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou want a highly-structured, predictable day-to-day.\u003c/li\u003e\n\u003cli\u003eYou prefer to be managed; you act when asked and let others come up with ideas.\u003c/li\u003e\n\u003cli\u003eFast-paced environments make your head spin.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat do we give you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA competitive salary.\u003c/li\u003e\n\u003cli\u003eA flexible and fun working environment of startups in the very center of Madrid.\u003c/li\u003e\n\u003cli\u003eAn office where everyone breathes SaaS and looks for scalable solutions.\u003c/li\u003e\n\u003cli\u003e\"Best-in-class\" colleagues; you'll work alongside smart people who are hungry to learn and willing to teach you.\u003c/li\u003e\n\u003cli\u003eYou'll have an opportunity to help create \u0026amp; shape our product and get your hands dirty with proper business-building experience.\u003c/li\u003e\n\u003cli\u003eEvents with the team – regular parties, happy hours, dinners and nerdy hobbies and games.\u003c/li\u003e\n\u003cli\u003eHealthy Breakfast in the office to embrace your daily journey with the best energies.\u003c/li\u003e\n\u003cli\u003eFlexible compensation like transportation, restaurants tickets and more.\u003c/li\u003e\n\u003cli\u003eFun secondary benefits that we would love to hear your opinion on.\u003c/li\u003e\n\u003cli\u003eFlexible Schedule to organize your own time under the natural constraints of your department and manager.\u003c/li\u003e\n\u003cli\u003eMedical insurance once you pass the six month.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply to this offer from our Recruitee site:\n\u003ca href=\"https://jobs.orbitalads.com/o/quality-assurance-engineer\"\u003ehttps://jobs.orbitalads.com/o/quality-assurance-engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUNHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3c0a74d53b536ed4ac2410e4d9393c35ae434c1b/OA_1200X300.jpg"},{"id":"11cbce13-e6cd-4c79-b904-d292b569b22f","type":"Full Time","url":"https://jobs.github.com/positions/11cbce13-e6cd-4c79-b904-d292b569b22f","created_at":"Wed Jul 15 12:17:30 UTC 2020","company":"OpenPlay","company_url":"http:","location":"Santa Monica","title":"Software Enginee","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eHello, we’re OpenPlay!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a full-stack engineer to work with us on our web-based music distribution application. You’ll work with us to design, develop, and deploy new application features for one of the world’s largest record companies. This is a full-time position that can be local (Los Angeles) or fully remote.\u003c/p\u003e\n\u003ch2\u003eWhat’s an OpenPlay?\u003c/h2\u003e\n\u003cp\u003eWe’re a small software team making distribution and workflow products for some of the world’s largest music companies. We’re big on testing, constant incremental improvement, craftsmanship, and pragmatism, and so far have been able to use those buzzwords to quickly deliver lots of features to keep the music industry running. We strive to make well engineered software that looks great and is friendly to use. We’re collaborative, supportive, enjoy learning, and most of all enthusiastic about building new things and making old things better.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be doing:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eRefining requirements.\u003c/strong\u003e We follow an agile process focused on rapid incremental delivery. You’ll take rough features born from an interesting idea, a customer request, or an overdue refactor (or a bug), and collaborate designing the user experience and technical direction necessary to release the next (or first) version.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eProgramming.\u003c/strong\u003e It wouldn’t be an engineering position without some programming. We try to get to this step with minimal planning time so we can see how an idea takes shape in the real world. Our languages of choice are Ruby and Javascript. We tend to practice outside-in development: most features start with a rough end-to-end (or system, or integration, etc.) test, then we attach some UI, give it an endpoint to communicate with, and finally add in the persistence layer. You’ll be responsible for your feature iterations from start to finish, but you’ll have a team to help and design support for visual polish.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eDeploying.\u003c/strong\u003e We offload and automate devops as much as possible, but a small part of every feature is still getting it deployed and ensuring it’s working as expected. We deploy features to production a few times per day on a typical day.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eSkills we’re looking for:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003ePractical experience in full stack web application development.\u003c/strong\u003e At least a few years working on both the server and client side of production web applications. Experience with any client/server development (i.e. mobile) would probably also be pretty applicable. Console game development sounds really cool but probably wouldn’t transfer over as well. TI-86 calculator programming experience wouldn’t be a great fit either.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAcademic knowledge of software development.\u003c/strong\u003e In addition to being able to make something work, you’ll need to be able to research and articulate why it’s a particularly good solution. A computer science degree is one good barometer we’re looking for, but we understand it’s not the only path to understanding engineering principles and isn't required.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eA desire to collaborate with others.\u003c/strong\u003e As a team we often discuss new and better ways to approach problems. We do code reviews and we write comments explaining our rationale when code looks smelly. If you enjoy thinking about new solutions to old problems, and can balance that with small, iterative, deliveries, you’ll probably enjoy working with us.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cp\u003eKey technology experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eRuby.\u003c/strong\u003e Experience with ruby would be ideal, but experience with other object-oriented dynamic languages would transfer over pretty well, especially python (you won’t be the only convert). Extensive experience in any programming language might fit as well. If you’re new to Ruby but enjoy object-oriented programming you’ll probably love it.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eJavascript.\u003c/strong\u003e Experience with other semi-prototypal web-browser-based scripting languages with a nonsense hodge-podge standard library would probably transfer over too, but happily for the world we’re not sure any exist. In any case, the more experience you have with Javascript the better.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTesting.\u003c/strong\u003e The heart of our workflow is a full suite of end-to-end tests that we rely on to rapidly and safely build and deploy new features and refactor old code. Prior experience with test driven development or behavior driven development would be a big plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eMore specific technologies we use:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eOur server-side code is MVC-structured and built around Sequel (ORM) and Sinatra. If you’re familiar with Rails or similar MVC frameworks you’ll feel at home pretty quickly.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur core distribution product (OpenPlay Music) is a traditional multi-page application driven by server-side HTML and using Javascript to apply bits of dynamic behavior.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur project management and workflow tool is a more recent single-page-application built in React and backed by Ruby communicating over JSON.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe enjoy both of them and think they are both appropriate technologies for different types of applications.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe do things typical of web applications like:\u003c/p\u003e\n\u003cp\u003eº Store data in and query from a relational database (PostgreSQL)\u003c/p\u003e\n\u003cp\u003eº Index data and query it with filtering and full text searching (Elasticsearch)\u003c/p\u003e\n\u003cp\u003eº Handle slow tasks with background processing\u003c/p\u003e\n\u003cp\u003eº Push notifications to clients with WebSockets\u003c/p\u003e\n\u003cp\u003eº Export XML files, PDFs, CSVs, Excel spreadsheets, and other formats that just won’t seem to go away\u003c/p\u003e\n\u003cp\u003eº Communicate with lots of external systems across all manner of APIs\u003c/p\u003e\n\u003cp\u003eº Provide a JSON API for our customers to build on top of\u003c/p\u003e\n\u003cp\u003eº Offload as much devops as possible to Heroku\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive compensation\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision insurance\u003c/li\u003e\n\u003cli\u003eWork life balance: We expect you to generally work 40 hours/week but understand that sometimes it’s summer. We might rarely have a big push where we end up working long hours. The last time this happened was in 2019 for about a week. The time before that was in 2016 for about 3 weeks.\u003c/li\u003e\n\u003cli\u003eFlexible work and vacation schedule: We have found so far that if the work is enjoyable it isn’t necessary to police when people are working. So we try to keep the work enjoyable.\u003c/li\u003e\n\u003cli\u003eFree to work remote: Our process works just as well in person or remote. It can sometimes even feel remote at the office when we’re sitting next to each other talking on Slack with our headphones in.\u003c/li\u003e\n\u003cli\u003eCompany Minecraft server with lots of odd elevated stone platforms.\u003c/li\u003e\n\u003cli\u003eOffice by the beach with a small-but-growing collection of vinyl figurines.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAll your information will be kept confidential according to EEO guidelines.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/38Xr2kJ\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/38Xr2kJ\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--768d7d0ec6983dfb25b4a5b7b4cfada6f9846a70/Openplay.jpeg"},{"id":"c41512e4-5cf6-46db-b1a0-898c069b3cec","type":"Full Time","url":"https://jobs.github.com/positions/c41512e4-5cf6-46db-b1a0-898c069b3cec","created_at":"Wed Jul 15 10:10:04 UTC 2020","company":"Future Plc","company_url":"http:","location":"Brno","title":"Senior Software Engineer","description":"\u003ch2\u003eDescription\u003c/h2\u003e\n\u003cp\u003eAbout the Team\u003c/p\u003e\n\u003cp\u003eTechnology \u0026amp; Engineering is a globally distributed central team focussed on delivering an innovative, modern, scalable and reusable proprietary tech stack. We work on a service oriented architecture model to support the business’ online operations and growth ambition.Our incredible tech stack also enables content creation, management and distribution for magazines.\u003c/p\u003e\n\u003cp\u003eOur technology \u0026amp; engineering philosophy is service oriented architecture with single responsibility service. We work on a principle of 60% design and 40% implementation with modular development to promote reuse, ease for scale and lean in terms of operational cost\u003c/p\u003e\n\u003cp\u003eOur architecture design, engineering and development solutions are based on consensus; eliminating split brain and promoting ownership. We encourage small rapid iteration approach to existing products and leverage learning to increase our level of success at the next stage. Optimisation is key and necessary until the point of diminishing return\u003c/p\u003e\n\u003cp\u003eAs a global team, communication and collaboration is as important as any of the above in order to deliver successfully.\u003c/p\u003e\n\u003cp\u003eJob Purpose\u003c/p\u003e\n\u003cp\u003eWe are currently recruiting for 2 Senior Systems Engineers to join our team. The role can be based in Bath or remotely in the UK.\u003c/p\u003e\n\u003cp\u003eAs a Senior Systems Engineer, you will be a key member of the Systems Engineering team working extremely closely with the Site Reliability Engineering (SRE) team as well as the Tech Leads in order to ensure successful on-going development of existing and new core and critical web services. You will ensure that technical solutions are of the highest possible standards.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities\u003c/p\u003e\n\u003cp\u003eYou will manage development in one of the product areas including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with the Systems Engineering team to produce and agree specifications for amending or adding new functionality to primarily single responsibility web services and web applications and to produce realistic development plans for the product (including estimates and dependencies).\u003c/li\u003e\n\u003cli\u003eExtensively collaborate with the Site Reliability Engineering (SRE) team in order to enhance existing web services through development and work toward delivering efficient support and maintenance practice which includes systems deployment and monitoring and improve overall development process for developers within the Technology \u0026amp; Engineering department.\u003c/li\u003e\n\u003cli\u003eProvide technical leadership for product support to other developers across the department ensuring that problems are resolved in a methodical and timely manner and that progress is communicated effectively to all relevant parties – in particular to liaise with the Web Operations teams when resolving problems.\u003c/li\u003e\n\u003cli\u003eYou will be the system owner of one or more critical and core web services and/or systems and assist the SRE team with on-call support when and where appropriate.\u003c/li\u003e\n\u003cli\u003eEnsure that the deliverables of program design, coding, testing, documentation and implementation are undertaken in line with the specification and that they are completed on time and to a high quality.\u003c/li\u003e\n\u003cli\u003eDesign and code from the specifications, using agreed standards and tools to achieve a well-engineered result.\u003c/li\u003e\n\u003cli\u003eDocument all work in accordance with agreed standards.\u003c/li\u003e\n\u003cli\u003ePlan and test developments to ensure that the product functions as expected\u003c/li\u003e\n\u003cli\u003eMeet regularly with the other web and systems developers, project and product managers and across the Technology \u0026amp; Engineering department to ensure that the technical product designs and implementation are of a consistent standard and technical solution choices are in line with the technical development strategy, as informed by the Chief Technology Officer and the Systems Engineering team.\u003c/li\u003e\n\u003cli\u003eMaintain an awareness of developments in the industry and participate in the sharing of knowledge and ideas across the teams.\u003c/li\u003e\n\u003cli\u003eTreat all customers and colleagues with respect and to demonstrate a commitment to Future’s Equal Opportunities Policy.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease note, occasional out of hours working may be required during peak trading periods.\u003c/p\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cp\u003eWhat do I need to succeed?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a passionate and self-motivated worker; you’re able to work with others to analyse complex problems specifically around scalability, optimisation, resiliency and redundancy.\u003c/li\u003e\n\u003cli\u003eYou actively encourage collaboration to design the best solutions.\u003c/li\u003e\n\u003cli\u003eYou are an expert in PHP and write beautiful, SOLID, optimised code\u003c/li\u003e\n\u003cli\u003eYou have proven track record on successfully delivering web services and/or web applications\u003c/li\u003e\n\u003cli\u003eYou are able to communicate technical information to non-technical people as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEssential Knowledge, Skills \u0026amp; Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eStrong consumer facing web product development experience using OOP/OOD\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience of developing for scalable redundant and resilient web products\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong understanding of distributed systems and messaging services\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHands-on experience of designing and implementing custom web services and APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience of integrating with internal and external web services and APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience in automated deployment and automated regression testing.\nA systematic, disciplined and analytical approach to problem solving – paying close attention to detail\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe able to competently plan, schedule and monitor your own and others’ work\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe familiar with, and be able to use as directed, all applicable tools, methods, procedures and standards\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave an excellent understanding of;\u003c/p\u003e\n\u003cp\u003eº Service orientated architectures\u003c/p\u003e\n\u003cp\u003eº Event driven/asynchronous architectures\u003c/p\u003e\n\u003cp\u003eº Test Driven Development\u003c/p\u003e\n\u003cp\u003eº Continuous integration and deployment practices using CI\u003c/p\u003e\n\u003cp\u003eº Containerisation via Docker, Kubernetes\u003c/p\u003e\n\u003cp\u003eº Web servers – NGINX\u003c/p\u003e\n\u003cp\u003eº NoSQL and traditional databases\u003c/p\u003e\n\u003cp\u003eº Good software engineering practices including source code versioning and code testing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave full web-stack capability – from document database (Redis, Mongo, Solr/Lucene) and relational database (MySQL – PostgreSQL) to JavaScript to HTML/CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable Knowledge, Skills \u0026amp; Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpen to learning new languages \u0026amp; technologies\u003c/li\u003e\n\u003cli\u003eExperience of one or more of the following languages: Golang, Python, Java, Node, Typescript\u003c/li\u003e\n\u003cli\u003eExperience of Microservice architectures\u003c/li\u003e\n\u003cli\u003eExperience of web and data caching\u003c/li\u003e\n\u003cli\u003eExperience operating global services at scale\u003c/li\u003e\n\u003cli\u003eExperience with NoSQL technologies\u003c/li\u003e\n\u003cli\u003eExperience with RESTFul services\u003c/li\u003e\n\u003cli\u003eExperience writing applications optimised for observability (tracing, metrics, structured logging)\u003c/li\u003e\n\u003cli\u003eExperience with Lambda/Serverless architectures\u003c/li\u003e\n\u003cli\u003eFamiliarity with JIRA\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cp\u003eWhat will I get in return?\u003c/p\u003e\n\u003cp\u003eAs well as our standard benefits, we have a number of awesome perks available to our staff including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited paid time off (yes you read that right!)\u003c/li\u003e\n\u003cli\u003eWe offer structured career development to all of our people ensuring they have the skills and experience to grow. Our CTO, Kevin Li Ying joined us as a Programmer!\u003c/li\u003e\n\u003cli\u003eA share in our success- every member of staff receives a profit pool bonus at the end of our financial year\u003c/li\u003e\n\u003cli\u003eFree food (monthly munchies, bagel Fridays, fresh fruit \u0026amp; snacks and coffee and tea on tap)\u003c/li\u003e\n\u003cli\u003eCentral office locations with cool open plan working spaces as well as plenty of flexibility to work remotely\u003c/li\u003e\n\u003cli\u003eFree digital magazine subscriptions and access to back copies of our print magazines and bookazines\u003c/li\u003e\n\u003cli\u003eDiscounted gym membership and onsite health \u0026amp; wellbeing (yoga at lunch anyone?!)\u003c/li\u003e\n\u003cli\u003eAnnual Future conference – get together with your colleagues to celebrate success and look forward to what’s next\u003c/li\u003e\n\u003cli\u003eRegular staff socials arranged by our wonderful Community \u0026amp; Culture committees\u003c/li\u003e\n\u003cli\u003eHuge opportunities to learn and develop whether through professional qualifications, exposure to incredible business projects or informal lunch \u0026amp; learns, hosted by your colleagues\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInterested in this position?\u003c/h2\u003e\n\u003cp\u003eWe are happy to get in touch with you! You can send your application by using \u003ca href=\"https://vonq.io/2CpxZyN\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2CpxZyN\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de57b3345bdec3a420dec96845137ed48fe11333/Future.jpg"},{"id":"ef8233e5-4064-4c2b-b8a4-7e0259c1e521","type":"Full Time","url":"https://jobs.github.com/positions/ef8233e5-4064-4c2b-b8a4-7e0259c1e521","created_at":"Tue Jul 14 15:54:37 UTC 2020","company":"Kelsus Inc","company_url":null,"location":"Argentina","title":"Senior Front End Developer","description":"\u003ch2\u003eSenior Front End Developer\u003c/h2\u003e\n\u003ch3\u003eSeeking Fulltime Employee in Argentina\u003c/h3\u003e\n\u003cp\u003eKelsus is seeking a senior front end developer with a strong work ethic who cares about quality and has fun bringing web applications to life. We have a new, greenfield project for you, and you will have the opportunity to design and build it according to your own preferences and experience. We’re open to developers using Vue or React (not Angular), but we will ask why you make the choices you make and you will create well organized, maintainable, efficient code. You can work from home either in the Buenos Aires area or in Resistencia or Corrientes.\u003c/p\u003e\n\u003ch3\u003eResponsibilities:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eBuild the front end code — javascript, html, css — for a new software application from scratch (You can use React.js or Vue, you can also use Redux or Next.js. You must be able to clearly articulate why you would make various technical choices in English in an interview.)\u003c/li\u003e\n\u003cli\u003eBalance speed and quality. How fast can you go while still being careful to test and think through different scenarios?\u003c/li\u003e\n\u003cli\u003eCode reviews and mentoring of new developers as they are added to the project -- you will be the first developer\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eRequirements:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum 4 years of front end development experience.\u003c/li\u003e\n\u003cli\u003eExperience in more than one front end framework.\u003c/li\u003e\n\u003cli\u003eSome back end experience is a bonus.\u003c/li\u003e\n\u003cli\u003eClear and comfortable command of English is a must. The interview will be in English with native English speakers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eQualities:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eYou take pride in delivering world-class, intuitive, easy-to-use software — you think like a user.\u003c/li\u003e\n\u003cli\u003eYou understand that simple is better than complicated (but also know this is more challenging to achieve).\u003c/li\u003e\n\u003cli\u003eYou are detail-oriented.  Your dot your \"i's\" and cross your \"t's\".\u003c/li\u003e\n\u003cli\u003eYou enjoy challenges and are persistent in tackling them. You know when to ask for help.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eFill out the form here: \u003ca href=\"https://hire.withgoogle.com/public/jobs/kelsuscom/view/P_AAAAAADAAETA-0uaOgfzE0\"\u003ehttps://hire.withgoogle.com/public/jobs/kelsuscom/view/P_AAAAAADAAETA-0uaOgfzE0\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1dae958f9e55e7a40f1f90fccacfecb29cbf8b50/kelsus_logo01.png"},{"id":"a34e33ec-d7b3-4b7f-a3c2-1bf6d91b576a","type":"Full Time","url":"https://jobs.github.com/positions/a34e33ec-d7b3-4b7f-a3c2-1bf6d91b576a","created_at":"Mon Jul 13 11:08:40 UTC 2020","company":"neubau kompass AG","company_url":"https://www.neubaukompass.de/","location":"München","title":"(Senior) Fullstack Developer – PHP / Synfony / JavaScript (m/w/d)","description":"\u003cp\u003eneubau kompass ist nicht umsonst eine der bekanntesten Online-Plattformen für Neubau-Wohnimmobilien. Wir sind so erfolgreich, weil wir nie stehen bleiben und unsere Leistungsqualität immer wieder auf den Prüfstand stellen und verbessern. Unsere Mitarbeiter wissen, dass wir ihnen viel zutrauen. Wir schätzen sie nicht nur als Fachkräfte, sondern auch als Menschen.\u003c/p\u003e\n\u003cp\u003eWir arbeiten mit flachen Hierarchien, bieten spannende Karrieremöglichkeiten sowie eine faire Bezahlung. Unser guter Teamgeist wird von unseren Werten getragen: Engagement, Empathie, Teamgeist und der Willen, sich fachlich weiterzuentwickeln.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEinleitung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSind Sie Experte in PHP, Symfony und aktuellen Frameworks wie React und Angular? Haben Sie Freude daran, Ihr Wissen in Ihr Team zu tragen und macht es Ihnen Spaß, Gutes immer wieder weiterzuentwickeln?\nGehören qualitativ einwandfreie Codes für Sie einfach dazu, und haben Sie vielleicht sogar Führungserfahrung? Werden Sie Teil unseres Teams!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFür unseren Standort in München suchen wir zum nächstmöglichen Termin eine(n) (Senior) Fullstack Developer – PHP / Symfony / JavaScript (m/w/d) in Vollzeit.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiese Aufgaben erwarten Sie bei uns\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSie übernehmen Verantwortung für die Weiterentwicklung unserer Plattform (Front- und Back-End) und die Implementierung neuer Produkte.\u003c/li\u003e\n\u003cli\u003eSie bringen Ihr Wissen im Team ein und finden zusammen mit Kollegen die besten Lösungen für verschiedene Anforderungen.\u003c/li\u003e\n\u003cli\u003eSie entwickeln Tools und Anwendungen für die interne Verwendung (z.B. Billing, Anbindung Salesforce, APIs).\u003c/li\u003e\n\u003cli\u003eSie arbeiten eng zusammen mit der Produktentwicklung und wirken mit in den Bereichen Anforderungsanalyse, Konzeption und Architektur.\u003c/li\u003e\n\u003cli\u003eSie veranstalten regelmäßige Code-Reviews und sind ständig dabei den Code schlank und elegant zu halten.\u003c/li\u003e\n\u003cli\u003eSie haben die Performance unserer Software (z.B. DB-Queries) immer im Blick.\u003c/li\u003e\n\u003cli\u003eSie planen im Team Sprints und Entwicklungszyklen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bringen Sie mit\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStudium im Bereich Informatik oder vergleichbare Ausbildung\u003c/li\u003e\n\u003cli\u003eMindestens 5 Jahre Berufserfahrung\u003c/li\u003e\n\u003cli\u003eAusgezeichnete Kenntnisse in der objektorientierten Entwicklung mit PHP\u003c/li\u003e\n\u003cli\u003eAusgezeichnete Kenntnisse in Symfony, MySQL, JavaScript, React, JQuery und Angular\u003c/li\u003e\n\u003cli\u003eSelbstverständlicher Umgang mit git, gulp, sass, less, composer, node.js und anderen modernen Frameworks\u003c/li\u003e\n\u003cli\u003eErfahrung in der Implementierung von Test Driven Development\u003c/li\u003e\n\u003cli\u003eErfahrung in der Planung/Umsetzung von Deployment Prozessen (mit Hudson, Jenkins etc.)\u003c/li\u003e\n\u003cli\u003eEine eigenständige und lösungsorientierte Arbeitsweise, Teamfähigkeit, Kommunikationsstärke\u003c/li\u003e\n\u003cli\u003e(Erste) Führungserfahrung\u003c/li\u003e\n\u003cli\u003eEine hohe Motivation und Auffassungsgabe sowie ein schnelles Umsetzungsvermögen\u003c/li\u003e\n\u003cli\u003eBelastbarkeit, auch unter Zeitdruck\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse in Englisch\u003c/li\u003e\n\u003cli\u003eHTML5 und CSS3 gehören zum Handwerkszeug\u003c/li\u003e\n\u003cli\u003eErfahrungen mit Kanban oder SCRUM\u003c/li\u003e\n\u003cli\u003eErste Erfahrungen mit DevOps als Methode\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bieten wir Ihnen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRaum für Eigeninitiative \u0026amp; spannende Aufgaben\u003c/li\u003e\n\u003cli\u003eFestanstellung in Vollzeit\u003c/li\u003e\n\u003cli\u003eFaire Bezahlung\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten und Überstundenausgleich\u003c/li\u003e\n\u003cli\u003eUnterstützung bei der fachlichen Weiterbildung\u003c/li\u003e\n\u003cli\u003eKurze Kommunikationswege\u003c/li\u003e\n\u003cli\u003eEin angenehmes Arbeitsklima\u003c/li\u003e\n\u003cli\u003eKompetente, hilfsbereite und engagierte Kollegen\u003c/li\u003e\n\u003cli\u003eKostenlose Getränke: (Milch-)Kaffee, Tee, Mineralwasser\u003c/li\u003e\n\u003cli\u003eHervorragende Anbindung an den MVV\u003c/li\u003e\n\u003cli\u003eKostenfreie Parkplätze\u003c/li\u003e\n\u003cli\u003eTop Ausstattung und modernste Büroräume\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eMöchten Sie Teil unseres engagierten Teams werden?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSenden Sie uns Ihre aussagekräftige Bewerbung (inkl. Anschreiben, Lebenslauf, Zeugnisse) über unser Bewerberportal im PDF-Format als einzelne Datei. Bitte geben Sie den frühestmöglichen Eintrittstermin sowie Ihre Gehaltsvorstellungen an!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/38656dd11d85afc4f0e216add629a2b9831ba564/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f37303866613531316665373436323138663762666532376561663164616634616264383037653833613338373030623635656661333239656662653266353438\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/5dbeb23b03e4f0e4b007c630c33e9085a467a42de394df39297862e23d5bf338\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjZGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--498a403a4625af49c126d2a54ebd30c393782761/Neubau%20Kompass.jpeg"},{"id":"7f482982-dec2-47df-bfe2-0cca7fb64464","type":"Full Time","url":"https://jobs.github.com/positions/7f482982-dec2-47df-bfe2-0cca7fb64464","created_at":"Mon Jul 13 08:21:13 UTC 2020","company":"VoltStorage GmbH","company_url":"https://voltstorage.com/","location":"München","title":"Senior IoT Software Engineer (gn)","description":"\u003cp\u003eDu hast bereits mehrjährige Erfahrung im Design und der Durchführung von Softwareprojekten? Du hast Lust, unsere Speichersteuerungssoftware entscheidend weiterzuentwickeln und übernimmst gerne fachliche Verantwortung? Dann bewerbe Dich und komme in unser Team!\u003c/p\u003e\n\u003cp\u003eHi!\nIch bin Felix, einer der drei Gründer von VoltStorage GmbH, einem Münchner Start-Up mit derzeit 34 Mitarbeitern.\n2016 habe ich gemeinsam mit Jakob und Michael VoltStorage gegründet. Unsere Vision war und ist es Erneuerbare Energien rund um die Uhr verfügbar zu machen, um eine grüne, nachhaltige und faire Zukunft zu ermöglichen. Als weltweit erstes Unternehmen ist es uns gelungen, ein kostengünstiges Stromspeichersystem für Haushalte auf Basis der besonders sicheren, langlebigen und umweltfreundlichen Vanadium-Redox Flow Technologie zu entwickeln. Damit unser großes Projekt weiter Fahrt aufnimmt, bin ich aktuell auf der Suche nach einem \u003cstrong\u003eSenior IoT Software Engineer (gn)\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eDu entwickelst Microcontrollerfirmware, die die Steuerung des Speichers entscheidend verbessert. Darüber hinaus nutzt Du die Möglichkeiten, die das IoT bietet, um unseren Ingenieuren und den Endkunden echten Mehrwert zu liefern, wofür Du auch die serverseitigen Softwarekomponenten entwickelst.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeine Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWeiterentwicklung der Speichersteuerungssoftware, basierend ESP32-Microcontroller\u003c/li\u003e\n\u003cli\u003eNeu- und Weiterentwicklung von REST- und WebSocket APIs in unserer Server-Infrastruktur mit Node.js mit Datenhaltung in PostgreSQL und MongoDB\u003c/li\u003e\n\u003cli\u003eUmsetzung von Features von der Konzeptphase über die Implementierung bis zum Testen und dem Release\u003c/li\u003e\n\u003cli\u003eÜbernahme von fachlicher Mitarbeiterführung (z.B. durch Coaching und Mentoring)\u003c/li\u003e\n\u003cli\u003eAnsprechpartner für andere Abteilungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAnforderungen\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTiefgehende Kenntnisse in C++ sowie in JavaScript (ES6) und Node.js\u003c/li\u003e\n\u003cli\u003eFortgeschrittene Kenntnisse im Embedded-Umfeld (Bare-Metal / RTOS) sowie in der Gerätetreiberentwicklung\u003c/li\u003e\n\u003cli\u003eBerufserfahrung in einer Rolle mit fachlicher Führungsverantwortung sowie Kenntnisse im agilen Projektmanagement\u003c/li\u003e\n\u003cli\u003eMut und Ideen, um neue Wege zu gehen\u003c/li\u003e\n\u003cli\u003eInteresse am Thema nachhaltige Energieversorgung\u003c/li\u003e\n\u003cli\u003eGute Deutschkenntnisse und Englischkenntnisse auf hohem Niveau\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ecreativity\u003c/li\u003e\n\u003cli\u003eflat_hierarchy\u003c/li\u003e\n\u003cli\u003eevents\u003c/li\u003e\n\u003cli\u003estock_options\u003c/li\u003e\n\u003cli\u003epromotion_opportunities\u003c/li\u003e\n\u003cli\u003etraining_budget\u003c/li\u003e\n\u003cli\u003emodern_technology\u003c/li\u003e\n\u003cli\u003efruit_coffee\u003c/li\u003e\n\u003cli\u003efitness_program\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eContact person\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn Deiner Bewerbung würden wir gerne mehr über ein spannendes Projekt von Dir erfahren sowie die größten Herausforderungen, auf die Du dabei gestoßen bist.\u003c/p\u003e\n\u003cp\u003eBei Rückfragen kannst Du Dich jederzeit gerne an uns wenden (\u003ca href=\"mailto:career@voltstorage.com\"\u003ecareer@voltstorage.com\u003c/a\u003e, +49 176 46 12 29 87).\u003c/p\u003e\n\u003cp\u003eViele Grüße,\nFelix\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/280e7e11e9833805316bf464921ddb05544177c6/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f65326663373637336664393765343433383331336361386133336234666662333236353833393437653861626431336531383830633766336263383333336264\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/559da355cc1361ff4ea3380f23deb8eec3882bddcd4dbfdd092f610b4d1ffd80\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--744f641867eebebbd450c4bc0e576fa391d6e55d/Voltstorage.png"},{"id":"9c455180-ecca-11e8-886b-ae327644a48e","type":"Full Time","url":"https://jobs.github.com/positions/9c455180-ecca-11e8-886b-ae327644a48e","created_at":"Tue Nov 20 13:52:15 UTC 2018","company":"Huawei","company_url":"https://www.huawei.com","location":"Munich, Germany","title":"Senior Software Engineer (m/f)","description":"\u003cp\u003eHuawei is a leading provider of information and communications solutions. Our products have been deployed in over 140 countries serving more than one third of the world’s population. For the Trusted System Protection (TSP) team within the Cyber Security and Privacy Protection Laboratory (CSPL) in Munich, Germany we are currently looking for a Senior Software Engineer enthusiastic to work on cutting-edge security technologies and to contribute to the security architecture of future Huawei products in a diverse range of verticals, from telecom to cloud and IoT platforms.\u003c/p\u003e\n\u003ch3\u003eYour responsibilities\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and document advanced security technology prototypes for trusted computing, system integrity protection and platform resilience\u003c/li\u003e\n\u003cli\u003eAnalyze product architecture and source code and collaborate with product line engineers to adapt the developed prototypes to product architectures\u003c/li\u003e\n\u003cli\u003eContribute to joint research projects with our European partners from academia and industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOur requirements\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, implementing and debugging embedded firmware and applications in C, for ARMv7/8-A, ARMv7/8-M, other embedded architectures or x86\u003c/li\u003e\n\u003cli\u003eProfessional knowledge in one or more of following areas:\n\u003cul\u003e\n\u003cli\u003eMicrocontroller and application processor architectures, DeviceTree, board bring-up, Secure Boot, flash storage, buses, Secure Update\u003c/li\u003e\n\u003cli\u003eLinux OS kernel internals, memory management, containers, virtualization, security features\u003c/li\u003e\n\u003cli\u003eDevelopment with common security protocols (e.g. TLS, IPSec, OAuth 2.0 etc.), crypto libraries (e.g. OpenSSL, mbedTLS), PKCS#11 or Linux kernel crypto API, X.509 certificates and PKI\u003c/li\u003e\n\u003cli\u003eLinux – network / system tools / command line interface / scripting\u003c/li\u003e\n\u003cli\u003eCode debugging techniques\u003c/li\u003e\n\u003cli\u003eProficiency in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eFollowing are desirable:\n\u003cul\u003e\n\u003cli\u003eTrusted Computing\u003c/li\u003e\n\u003cli\u003eHardware security architectures and best practices\u003c/li\u003e\n\u003cli\u003ePython, Go; Javascript, Node.JS and micro service architectures\u003c/li\u003e\n\u003cli\u003eExperience with cloud technologies such as OpenStack and containers (Docker/Kubernetes)\u003c/li\u003e\n\u003cli\u003eDevOps methodologies such as agile development and continuous delivery\u003c/li\u003e\n\u003cli\u003eExperience in contributing to open-source projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCandidate should be self-motivated to research and compare new software technologies and be in a position to rapidly become accustomed to them in a relatively short period of time.\u003c/p\u003e\n\u003cp\u003eAble to independently design, build, and maintain efficient, reusable and secure code. Identify potential bottlenecks and bugs and devise solutions to the problems. Analyze existing code and identify points of improvement.\u003c/p\u003e\n\u003cp\u003eCapable to analyze complex software architectures and prioritize development tasks to maximize efficiency and output. Able to troubleshoot problems in an existing code base with limited documentation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your CV to \u003ca href=\"mailto:jane.jeffreys@huawei.com\"\u003ejane.jeffreys@huawei.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb8499ec0b8cfed521539de0c702dd3bf1c2b87f/8ed5a22c-7b16-41b0-9320-c538c2717293"},{"id":"07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","type":"Full Time","url":"https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","created_at":"Tue Nov 20 12:09:59 UTC 2018","company":"Mindhive","company_url":"http://www.mindhive.org","location":"Brisbane CBD Australia","title":"Senior Front End and Backend Developers","description":"\u003cp\u003e\u003cstrong\u003eMINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMindhive\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.\u003c/p\u003e\n\u003cp\u003eSince completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR BACKEND DEVELOPER ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a backend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eCloud services\nDatabase\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:\u003c/p\u003e\n\u003cp\u003eDevelop cloud-based API services\nDevelop in-house \u0026amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDetailed understanding of cloud architecture(s)\nDetailed knowledge of Python \u0026amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols \u0026amp; certificates\nBonus: detailed knowledge of machine learning \u0026amp; AI\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR FRONTEND DEVELOPER ROLE OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eWeb application\nMobile application\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement UX/UI for mobile first web and mobile apps\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional key responsibilities include:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUtilise any and all relevant frameworks, libraries and techniques:\u003c/p\u003e\n\u003cp\u003eJavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house \u0026amp; third party)\nReview and inform database models are in alignment with frontend view models \u0026amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExperience with current industry design tools (e.g. Figma)\u003c/p\u003e\n\u003cp\u003eUnderstanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking \u0026amp; abstract, technical problem solving\nProactivity\nCollaboration\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:career@mindhive.it\"\u003ecareer@mindhive.it\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"},{"id":"45296f64-ec32-11e8-9e1b-5d24b20f1c0f","type":"Full Time","url":"https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f","created_at":"Mon Nov 19 19:40:01 UTC 2018","company":"Prosek Partners","company_url":"https://www.prosek.com","location":"Fairfield, CT","title":"Front End Developer","description":"\u003cp\u003eBackground\u003c/p\u003e\n\u003cp\u003eProsek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.\u003c/p\u003e\n\u003cp\u003eThe Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.\u003c/p\u003e\n\u003cp\u003eTechnical skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications\u003c/li\u003e\n\u003cli\u003eUnderstanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design\u003c/li\u003e\n\u003cli\u003eUnderstanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms\u003c/li\u003e\n\u003cli\u003eDelivering reusable components, code and front-end libraries for future use\u003c/li\u003e\n\u003cli\u003eTranslating designs and wireframes into high quality, tested code\u003c/li\u003e\n\u003cli\u003eExperience with interactive web elements and motion\u003c/li\u003e\n\u003cli\u003eAble to identify opportunities for process and tool improvements\u003c/li\u003e\n\u003cli\u003eProficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM\u003c/li\u003e\n\u003cli\u003eUnderstanding of CSS pre- and post-processors\u003c/li\u003e\n\u003cli\u003eExperience working with third party services, APIs, and content management systems.\u003c/li\u003e\n\u003cli\u003eProficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign\u003c/li\u003e\n\u003cli\u003eComprehensive awareness and interest in new technologies\u003c/li\u003e\n\u003cli\u003eUnderstanding of full-stack requirements and deployments\u003c/li\u003e\n\u003cli\u003eEnforce front-end code compliance with web for cross-browser and platform compatibility\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs a Front End Developer, you will be expected to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe self-motivated, detail-oriented and confident\u003c/li\u003e\n\u003cli\u003eCapable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements\u003c/li\u003e\n\u003cli\u003eTranslate ideas, end-user needs, design criteria, and technical features into quality web productions\u003c/li\u003e\n\u003cli\u003ePresent and defend technical recommendations to the team\u003c/li\u003e\n\u003cli\u003eAble to speak not just passionately about your work but also plainly to those who are inexperienced\u003c/li\u003e\n\u003cli\u003eHave a strong grasp of storytelling through layout and information design\u003c/li\u003e\n\u003cli\u003ePossess excellent written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eBe comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers\u003c/li\u003e\n\u003cli\u003eAble to work under tight deadlines, with little supervision\u003c/li\u003e\n\u003cli\u003eRise above the competition: tell us about your experience with mobile app development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in computer science or related field\u003c/li\u003e\n\u003cli\u003e3-5 years of professional IT-related experience\u003c/li\u003e\n\u003cli\u003eDemonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends\u003c/li\u003e\n\u003cli\u003eFluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:developerjobs@prosek.com\"\u003edeveloperjobs@prosek.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"},{"id":"7d0d5cf0-ec1f-11e8-9834-c8e30f51c014","type":"Full Time","url":"https://jobs.github.com/positions/7d0d5cf0-ec1f-11e8-9834-c8e30f51c014","created_at":"Mon Nov 19 17:21:35 UTC 2018","company":"Simons Foundation","company_url":null,"location":"New York, New York","title":"Web Developer","description":"\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.\u003c/p\u003e\n\u003cp\u003eESSENTIAL FUNCTIONS/RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress\u003c/li\u003e\n\u003cli\u003eWork collaboratively and closely with editors, front-end designers, web producers and other developers\u003c/li\u003e\n\u003cli\u003eEffectively manage priorities for multiple concurrent projects\u003c/li\u003e\n\u003cli\u003eCommunicate with stakeholders to gather requirements and ensure their needs are being met\u003c/li\u003e\n\u003cli\u003eAdapt to changing requirements\u003c/li\u003e\n\u003cli\u003ePerform any other duties or tasks as assigned or required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMINIMUM QUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor's degree is required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient with WordPress, with 3+ years of experience developing custom WP sites\u003c/li\u003e\n\u003cli\u003eAdvanced expertise with PHP and MySQL\u003c/li\u003e\n\u003cli\u003eDeep understanding of HTML and CSS\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript and jQuery\u003c/li\u003e\n\u003cli\u003eExperience with React or similar JS libraries or frameworks\u003c/li\u003e\n\u003cli\u003eExperience with responsive web development\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eProficient with version control tools, such as Git and SVN.\u003c/li\u003e\n\u003cli\u003ePortfolio of work products that function well on multiple device types\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in User Experience and User Interface design\u003c/li\u003e\n\u003cli\u003eExperience with Python and Django\u003c/li\u003e\n\u003cli\u003eExperience with responsive web design, integration and usability testing\u003c/li\u003e\n\u003cli\u003eExperience with high-volume websites and/ or journalistic websites\u003c/li\u003e\n\u003cli\u003eComfort with Adobe Creative Cloud\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTHE SIMONS FOUNDATION'S DIVERSITY COMMITMENT\u003c/p\u003e\n\u003cp\u003eMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.\u003c/p\u003e\n\u003cp\u003eApply Here:   \u003ca href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\"\u003ehttp://www.Click2apply.net/tnq3zqdz2zmwb8qt\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105651217\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\"\u003ehttp://www.Click2apply.net/tnq3zqdz2zmwb8qt\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cec1fa3eb8f8a921945829b6e04fc43744f727e/29ad9da4-09d2-432c-bd49-6ad83582c9e8"},{"id":"cd535970-ec11-11e8-89ae-2e904411ec0e","type":"Full Time","url":"https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e","created_at":"Mon Nov 19 15:44:44 UTC 2018","company":"Aon Cyber Solutions","company_url":"http://www.strozfriedberg.com/careers","location":"NY or LA","title":"Cybersecurity Firm Seeks Senior Developer","description":"\u003cp\u003eAon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.\u003c/p\u003e\n\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePosition Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of this position include but are not limited to the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.\u003c/li\u003e\n\u003cli\u003eServe as a senior developer on multiple product teams.\u003c/li\u003e\n\u003cli\u003eCreate user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.\u003c/li\u003e\n\u003cli\u003eTranslate high-level requirements into working prototypes to generate user feedback and discussion.\u003c/li\u003e\n\u003cli\u003eAdapt and apply cutting edge computer science to highly technical domains.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.\u003c/li\u003e\n\u003cli\u003eMentor other developers.\u003c/li\u003e\n\u003cli\u003eContribute to a positive, collaborative culture for innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineer experience.\u003c/li\u003e\n\u003cli\u003eProficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTTP and REST web services implementation.\u003c/li\u003e\n\u003cli\u003eTest driven development and unit testing frameworks.\u003c/li\u003e\n\u003cli\u003eModern DevOps experience.\u003c/li\u003e\n\u003cli\u003eStandard software engineering tools (git, Jenkins, JIRA).\u003c/li\u003e\n\u003cli\u003eThe proven ability to see things as they should be, and to realize that vision.\u003c/li\u003e\n\u003cli\u003eComfort with agile development and remote team environments.\u003c/li\u003e\n\u003cli\u003eExcellence in verbal and written communication.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003cli\u003ePython 3 and web frameworks such as Django or Flask.\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; relational database modeling.\u003c/li\u003e\n\u003cli\u003eExperience in deployment to AWS, especially serverless technologies.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of JWT and various web security models.\u003c/li\u003e\n\u003cli\u003eD3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).\u003c/li\u003e\n\u003cli\u003eElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.\u003c/li\u003e\n\u003cli\u003eJava 8 and other JVM-based languages.\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and optimization.\u003c/li\u003e\n\u003cli\u003eMobile development using Native or Cross-platform (Xamarin, Ionic, React Native).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"b638fa4c-ebb7-11e8-9ea5-6578f16a7b3f","type":"Contract","url":"https://jobs.github.com/positions/b638fa4c-ebb7-11e8-9ea5-6578f16a7b3f","created_at":"Mon Nov 19 04:59:26 UTC 2018","company":"Podomaatic","company_url":null,"location":"Remote","title":"RFP: JavaScript component for embedding a list of Podcast Episodes  in Website Builders with specific functionality for Wordpress ","description":"\u003cp\u003eRFP: JavaScript component for embedding a list of Podcast Episodes\nin Website Builders with specific functionality for Wordpress\u003c/p\u003e\n\u003cp\u003eThe goal of this project is to repurpose our JavaScript components currently available\nfor Weebly, to allow users on the Wordpress platform to embed their podcast episodes\nand information on their own custom webpages.\u003c/p\u003e\n\u003cp\u003eRecent episode player:\nThis will always display the latest episode published by a user. It includes playback,\ntimeline bar, description, title and mute buttons.\u003c/p\u003e\n\u003cp\u003ePodcast Info:\nBasic information about the user’s podcast including Category, Genre, Location,\nFollowers.\u003c/p\u003e\n\u003cp\u003eEpisode Grid:\nThis plugin allows the user to display the entire list of episodes in a grid format.\nPlayback functionality is similar to the Recent episode player. There are some basic\ncustomizable options such as transparency vs white bar background for episode titles\n(See mockups below)\u003c/p\u003e\n\u003cp\u003eEpisode List\nThis plugin allows the user to display the entire list of episodes in a List format.\nPlayback functionality is similar to the Recent episode player. There are some basic\ncustomizable options such as displaying the episode thumbnail image or not. (See\nmockups below)\u003c/p\u003e\n\u003cp\u003eAll components must adapt their font style (Title, body, caption) and color to the\nwebpage theme the user has. All components must offer a color player and a gray\nplayer version, background opacity color, and must be responsive to mobile and\ndesktop)\u003c/p\u003e\n\u003cp\u003eExamples of the current plugins in Weebly:\n\u003ca href=\"http://www.minimalist-theme.podomatic.net/\"\u003ehttp://www.minimalist-theme.podomatic.net/\u003c/a\u003e\n\u003ca href=\"http://www.performer-theme.podomatic.net/\"\u003ehttp://www.performer-theme.podomatic.net/\u003c/a\u003e\n\u003ca href=\"http://www.writer-theme.podomatic.net/\"\u003ehttp://www.writer-theme.podomatic.net/\u003c/a\u003e\n\u003ca href=\"http://www.complete-theme.podomatic.net/\"\u003ehttp://www.complete-theme.podomatic.net/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eRequirements for the embeddable component:\u003c/p\u003e\n\u003cp\u003eThe component should be pure JavaScript, i.e. not an embeddable iframe, and\u003c/p\u003e\n\u003cp\u003ebe enabled either via data attributes or a JavaScript call. i..e the html might look\u003c/p\u003e\n\u003cp\u003esomething like:\u003c/p\u003e\n\n\u003cp\u003eThe component should make use of Podomatic’s API which uses JSON over REST. A\nsample response looks like this:\n\u003ca href=\"https://api.podomatic.com/v2/podcasts/5133407/episodes?podcast=true\"\u003ehttps://api.podomatic.com/v2/podcasts/5133407/episodes?podcast=true\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe following attributes should be customizable:\u003c/p\u003e\n\u003cp\u003e● The style (grid or list)\u003c/p\u003e\n\u003cp\u003e● Number of items per page\u003c/p\u003e\n\u003cp\u003e●\nThe color scheme (currently light or dark)\n●\nWhether background images are displayed or not\u003c/p\u003e\n\u003cp\u003eThe component will be styled mostly by the choice of style and color scheme\nhowever it should be possible to override the styles from a global style sheet.\nAdditionally the layout should be responsive.\u003c/p\u003e\n\u003cp\u003eThe component should load new pages using an infinite scrolling mechanism.\u003c/p\u003e\n\u003cp\u003eRequirements for the Wordpress plugin integration:\u003c/p\u003e\n\u003cp\u003eAs part of our strategy we also want the above component to be made available\nas a Wordpress plugin. To keep the look and feel of the application consistent\nthis should use the JavaScript file created above. It should also provide the\nsame level of customizability.\u003c/p\u003e\n\u003cp\u003eAdditional notes\u003c/p\u003e\n\u003cp\u003eAll resulting code and assets will belong to Podomatic. The embeddable code\nwill be hosted on our own CDN and the Wordpress Plugin on their infrastructure.\u003c/p\u003e\n\u003cp\u003ePlease provide specific instructions on how you would go about building and what in your experience would be useful or relevant to the project.  Also include either a resume or gitbub. Thank you,\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail porject cost and contact information to \u003ca href=\"mailto:jobs@podomatic.com\"\u003ejobs@podomatic.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null}]