[{"id":"b24f69f4-573a-4607-9941-613c99de26b2","type":"Full Time","url":"https://jobs.github.com/positions/b24f69f4-573a-4607-9941-613c99de26b2","created_at":"Sat Aug 08 16:57:04 UTC 2020","company":"3DEO","company_url":"http:","location":"Los Angeles","title":"Full-Stack Engineer","description":"\u003cp\u003e\u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBased in Los Angeles, 3DEO’s breakthrough Intelligent Layering® technology unlocks high-volume metal 3D printing by drastically reducing final part cost. Despite the low cost, our parts meet the high industry benchmark MPIF Standard 35 while still achieving tight tolerances and an industry leading surface finish. Intelligent Layering® opens metal 3D printing to most of the industries that can’t afford today’s expensive options.\u003c/p\u003e\n\u003cp\u003e3DEO recently reached a huge industry milestone - 150,000 metal 3D printed production components sent to customers! The company is focused on the industries of aerospace, medical, and defense. 3DEO currently has over 60 employees and is upgrading to a 60,000 sq ft manufacturing facility in Los Angeles.\u003c/p\u003e\n\u003cp\u003eReporting to: Chief Technology Officer\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Position\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for a passionate, motivated and innovative individual that’s looking to make an impact in a highly-skilled, core technology team through strong software engineering talent. Our current intelligence core includes Additive Manufacturing Research Scientists, Mechanical Engineers, a Materials Scientist, Software Developers and an Electrical Engineer. As a key member of our intelligence core, you will help develop and operate a new wave of high-quality part manufacturing capabilities in metal AM. This is a full-time position.\u003c/p\u003e\n\u003cp\u003eThe \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e will be a software engineer supporting our expanding automation efforts and data collection initiatives. The successful applicant will be an expert in Python and web frameworks such as Django. They will also have experience with well-known front-end frameworks including React and Bootstrap.\u003c/p\u003e\n\u003cp\u003eSpecifically, the \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and deploy software for internal use.\u003c/li\u003e\n\u003cli\u003eBe the primary owner of the codebase and our application stack, from frontend to database.\u003c/li\u003e\n\u003cli\u003eSet up an agile development pipeline using the principles of continuous integration and the Twelve Factor App Methodology\u003c/li\u003e\n\u003cli\u003eEnsure the entire stack is designed and built for speed and scalability.\u003c/li\u003e\n\u003cli\u003eDesign user interfaces with frameworks such as Bootstrap and integrate interfaces with our MES (Manufacturing Execution System) software.\u003c/li\u003e\n\u003cli\u003eWrite clear, documented and maintainable code\u003c/li\u003e\n\u003cli\u003eWork with manufacturing and operations teams to develop new software projects and processes\u003c/li\u003e\n\u003cli\u003eCommunicate with internal customers \u0026amp; collect user feedback\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications \u0026amp; Experience\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn undergraduate software engineering degree is required and a master’s or PhD are a plus. The \u003cstrong\u003eFull-Stack Engineer\u003c/strong\u003e should have at least five years of experience, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience in a full-stack engineering role\u003c/li\u003e\n\u003cli\u003eAbsolute Python expert – over five years of experience and very deep in multiple frameworks including Django\u003c/li\u003e\n\u003cli\u003eSignificant experience with database technologies such as MySQL, PostgreSQL, Oracle and MongoDB.\u003c/li\u003e\n\u003cli\u003eProficiency with fundamental front-end languages such as HTML, CSS and JavaScript.\u003c/li\u003e\n\u003cli\u003eFamiliarity with JavaScript frameworks such as Angular, React and Ember.\u003c/li\u003e\n\u003cli\u003ePassion for conquering challenging problems\u003c/li\u003e\n\u003cli\u003eCreativity and analytical skills\u003c/li\u003e\n\u003cli\u003eAbility to communicate technical knowledge in a clear and   understandable manner\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePersonal Characteristics\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAchievement Orientation\u003c/strong\u003e - High energy, results-driven, determined, and flexible, with a strong and disciplined work ethic. Sets a quick pace, and constantly raises the bar and presses themselves toward higher levels of achievement while at the same time fostering a collaborative culture.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePersistence\u003c/strong\u003e – Tenacious in the pursuit of excellence. Is not easily swayed by short-term swings in fortune and maintains strong vision on long-term goals. Understands that success comes from effectively executing a plan on a consistent basis and with high intensity, despite any obstacles or challenges.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCommunication Skills\u003c/strong\u003e - Excellent verbal and written communication skills with the ability to effectively deliver and reinforce consistent messages. Leverages these capabilities to interact with, and persuade, potential customers. Excellent listening skills.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTeam Player\u003c/strong\u003e - Has the ability to work effectively with all people within the organization to ensure customers’ needs are being met or exceeded. Has a collegial, inclusive working style and is professional and courteous. Builds strong relationships both internally and externally.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to me at \u003ca href=\"mailto:lance.kallman@3deo.co\"\u003elance.kallman@3deo.co\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU9IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8a0c09f8cb57abbbe3aec63ffce7da6e02f9edf4/3DEO.png"},{"id":"10ef553e-b63a-484b-870f-4b040ccdd61b","type":"Full Time","url":"https://jobs.github.com/positions/10ef553e-b63a-484b-870f-4b040ccdd61b","created_at":"Fri Aug 07 21:22:57 UTC 2020","company":"MOO ","company_url":"http://moo.com","location":"London","title":" Java and Python Engineering Opportunities! ","description":"\u003cp\u003eMOO set out to shake up the world of print back in 2006. And we’ve come a long way since. Today we’re a global team (we’re thinking of getting matching jackets) who create print and digital products for companies of all sizes – from Google and AirBnB to the guy who makes those amazing prints you found at a craft fair.\u003c/p\u003e\n\u003cp\u003eOur HQ is in London, UK, while we also have premises in Dagenham. In the US, you’ll find us in Boston, MA, as well as Lincoln, RI and Denver, CO.\u003c/p\u003e\n\u003cp\u003eWant to join one of our amazing teams?\u003c/p\u003e\n\u003cp\u003eWe are looking for Software Engineers and Team Leads in a few different areas. Build, Buy, and Managed Services.  Details and roles listed below:\u003c/p\u003e\n\u003cp\u003eSenior Full Stack Engineer (Python/Javascript) - London/WFH\nSenior Java Engineer – eComm - London/WFH\nTeam Lead - Java (Buy/eComm) - London\nTeam Lead-Java (Manage Services) - London\nTeam Lead -Python/Javascript (Build) – London\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBUILD\u003c/strong\u003e\nOur Build team focuses on design creation and customisation tools. This team is at the heart of the MOO experience. We provide our customers with the tools to create bespoke unique print products.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBUY\u003c/strong\u003e\nIt is responsible for building all customer-facing parts of the digital moo.com experience that ensures that customers get to know our brand/products via our website, can customize them and place an order. In the Buy area (cart, checkout, product, pricing, cross sell, ..) we tackle a fascinating problem domain that impacts user experience and conversion directly.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMANAGED SERVICES\u003c/strong\u003e\nThe business services engineering team focuses on the B2B experience, and continuously evolves services in supporting our MBS (MOO Business Services) app and supports MOO’s long term focus from a technical point of view.\u003c/p\u003e\n\u003cp\u003eNot familiar with MOO?  Check out the video below to see what we are all about and how tech is at the core of everything we do.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vimeo.com/354880404\"\u003e\u003cstrong\u003eVIDEO\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\"\u003eLink to job site to apply\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat’s it like to work at MOO?\u003c/strong\u003e\nMOO’s the kind of workplace where you can really be yourself. Dye your hair purple. Hit the sofa with your laptop. Whatever helps you feel comfortable and happy at work. We want to help you grow in your career and set you up for success – while also recognising the importance of a healthy work/life balance.\u003c/p\u003e\n\u003cp\u003eThat’s why we offer 25 days holiday rising by one day for each year here (for 5 years), a matched pension scheme, MOO’s share option scheme, and paid parental leave. We’ll offer you private healthcare, life insurance, a season ticket loan, subsidised gym membership and a cycle to work scheme. Finally, we’ll treat you to breakfast and fresh fruit every day, lunch on Fridays and all the ice cream you can eat (just watch for the brain freeze).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity Statement\u003c/strong\u003e\nWe are working hard to create a representative, inclusive and super-friendly team, because we know that different experiences, perspectives and backgrounds make for a better workplace. And that creates a better experience for our customers. MOO doesn’t discriminate on the basis of race, colour, religion or belief, gender, national origin, age, sexual orientation, marital status, disability or any other protected class.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\"\u003ehttps://jobs.lever.co/moo/?lever-origin=applied\u0026amp;lever-source%5B%5D=MOOCareers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdG1IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2094ccce91a287c6bf5c665a18e6245fcb38bae0/MOO_Logo_Hero-Green_RGB-01%20(1).png"},{"id":"e008d1a8-50bf-4857-999d-fb9d65e6ce8a","type":"Full Time","url":"https://jobs.github.com/positions/e008d1a8-50bf-4857-999d-fb9d65e6ce8a","created_at":"Fri Aug 07 18:40:00 UTC 2020","company":"Hamilton Insurance Group","company_url":"http:","location":"Dublin, Ireland","title":"DevOps Linux Engineer","description":"\u003cp\u003e\u003cstrong\u003eWe’re looking for a\nDevOps Linux Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eReporting to the Head of Cloud Engineering and Automation, and working with our operations support and engineering teams, this Dublin-based role will be responsible for our Linux-based application. The successful candidate will automate and streamline operations and development processes and will build and maintain tools for deployment, monitoring and support.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTransition the on-premises Linux environment to the cloud with the goal of establishing an orchestrated Infrastructure that is secure, scalable and cloud agnostic.\u003c/li\u003e\n\u003cli\u003eWork closely with business stakeholders, providing recommendations and solutions to meet their requirements.\u003c/li\u003e\n\u003cli\u003eWork closely with the Development team to develop an intimate understanding of their pain points and continually improve the development workflow.\u003c/li\u003e\n\u003cli\u003eDesign and build a process to empower the team to build, test and provision cloud infrastructure and release code to staging and production autonomously using tools such as Terraform, Ansible and Packer.\u003c/li\u003e\n\u003cli\u003eAdd, improve and maintain the Terraform, Ansible and Bash source code stored in our central repositories as well as our Azure DevOps pipelines.\u003c/li\u003e\n\u003cli\u003eDesign and implement logging, monitoring and alerting solutions, increasing systems visibility and enabling faster recovery from incidents.\u003c/li\u003e\n\u003cli\u003eTroubleshoot and debug infrastructure, network and operating system issues.\u003c/li\u003e\n\u003cli\u003eBe an active participant on our Scrum team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you require for the role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eProven experience working with most of the following:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eOperating Systems (Ubuntu, Red Hat, CentOS)\u003c/li\u003e\n\u003cli\u003eConfiguration management tools such as: Ansible, Puppet, or Chef (Ansible Preferred)\u003c/li\u003e\n\u003cli\u003eContainerization – Docker Swarm and/or Kubernetes\u003c/li\u003e\n\u003cli\u003ePython, Bash, Node.js\u003c/li\u003e\n\u003cli\u003eVMware Virtualized environments\u003c/li\u003e\n\u003cli\u003eCI/CD pipelines in Azure DevOps\u003c/li\u003e\n\u003cli\u003eSystem administration, including security management, OS installation and patching, user management and system monitoring\u003c/li\u003e\n\u003cli\u003eKnowledge of Terraform for building infrastructure as code, both in Azure and VMware\u003c/li\u003e\n\u003cli\u003eKnowledge of Azure networking architectures such as VNETS. NSGs and Load Balancers would be an advantage.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cul\u003e\n\u003cli\u003eDedication to making a difference in a rapid-paced environment\u003c/li\u003e\n\u003cli\u003eAbility to work independently, with minimal supervision and as part of a team\u003c/li\u003e\n\u003cli\u003eAbility to foster an environment for healthy collaboration\u003c/li\u003e\n\u003cli\u003eStrong communication and organization skills\u003c/li\u003e\n\u003cli\u003eUnderstanding of configuration and change management\u003c/li\u003e\n\u003cli\u003eGood analytical and problem-solving skills\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://hamilton.bamboohr.com/jobs/view.php?id=47\"\u003ehttps://hamilton.bamboohr.com/jobs/view.php?id=47\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1NIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e4a0d86c30b5c91fe20f1e2076802e21e792a814/Hamilton-Logo-RGB.png"},{"id":"c62589e9-e50c-496c-8083-1e86de7281c5","type":"Full Time","url":"https://jobs.github.com/positions/c62589e9-e50c-496c-8083-1e86de7281c5","created_at":"Fri Aug 07 16:49:34 UTC 2020","company":"Hamilton Insurance Group","company_url":null,"location":"Dublin, Ireland","title":"Python Software Engineer","description":"\u003cp\u003e\u003cstrong\u003eWe’re looking for a\nPython Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eReporting to the Global Software Development Manager, this Dublin-based role will further strengthen our team as we draw on powerful analytics and our in-depth experience to provide superior underwriting and investment value for our clients and shareholders.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will do\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and develop high quality scalable solutions, with a full stack approach.\u003c/li\u003e\n\u003cli\u003eTake ownership, develop new ideas and solutions and generate results\nwhich help our users and the other members of the development team.\u003c/li\u003e\n\u003cli\u003eDesign and architect our internal API to support the business in portfolio aggregation and reporting.\u003c/li\u003e\n\u003cli\u003eBring automation within software teams on a daily basis using scripting techniques and adoption of tooling to continue to remove manual processes in the Software Development Lifecyle (SDLC).\u003c/li\u003e\n\u003cli\u003eAnalyze and improve reliability, security, and performance of all technology applications, databases and infrastructure.\u003c/li\u003e\n\u003cli\u003eDevelop consumer-grade applications that can scale in a global environment and improve test coverage of existing codebases\u003c/li\u003e\n\u003cli\u003eEnsure team is following standard methodologies for development using agile processes.\u003c/li\u003e\n\u003cli\u003eHelp to drive a team culture of continuous development.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you require for the role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDemonstrable relevant work experience in software development or in academic / technical field, regardless of language/technology\u003c/li\u003e\n\u003cli\u003eStrong knowledge of Python 3\u003c/li\u003e\n\u003cli\u003eStrong knowledge of Docker and at least one cluster orchestration platform\u003c/li\u003e\n\u003cli\u003eGood knowledge of algorithms and data structure\u003c/li\u003e\n\u003cli\u003eExperience using Git in a team environment\u003c/li\u003e\n\u003cli\u003eExperience working in an environment leveraging remote communication collaboration tools\u003c/li\u003e\n\u003cli\u003eAutonomy, analytical mindset and problem solving abilities supported by best practices in coding\u003c/li\u003e\n\u003cli\u003eWillingness to work full-stack with transitions between technologies and languages\u003c/li\u003e\n\u003cli\u003eFamiliarity with agile and software development lifecycle including design, build, code review, testing, release and bug fixing.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://hamilton.bamboohr.com/jobs/view.php?id=54\"\u003ehttps://hamilton.bamboohr.com/jobs/view.php?id=54\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcldIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c08cbc6d5454039da7d22128d1243dd4eb05ba13/Hamilton-Logo-RGB.png"},{"id":"cd5c95f1-e1b0-4250-93dd-37daebf39c42","type":"Full Time","url":"https://jobs.github.com/positions/cd5c95f1-e1b0-4250-93dd-37daebf39c42","created_at":"Thu Aug 06 17:56:32 UTC 2020","company":"NinthDecimal","company_url":null,"location":"Remote","title":"Sr. Data Scientist","description":"\u003cp\u003eSenior Data Scientist @ NinthDecimal.\u003c/p\u003e\n\u003cp\u003eNinthDecimal (\u003ca href=\"http://www.ninthdecimal.com\"\u003ewww.ninthdecimal.com\u003c/a\u003e) provides location-based intelligence to help advertisers plan, manage, measure, and optimize multi-platform cross-media campaigns to drive customer and revenue growth.   As an industry leader in the AdTech \u0026amp; MarTech space, NinthDecimal delivers best-in-class measurement, insights, and analytics by deploying patented big data methodologies on a cutting-edge technology platform.\u003c/p\u003e\n\u003cp\u003eOur LocationGraph™ platform processes data on a massive scale, converting tens of billions of signals per day into accurate and actionable insights for our clients.  We provide location-based intelligence services for top brands across industry verticals including retail, travel, leisure \u0026amp; entertainment, fast food \u0026amp; casual dining, telecommunications, and automotive.\u003c/p\u003e\n\u003cp\u003eAs a member of the Data Science team, you’ll be responsible for developing statistical and machine-learning models that deliver accurate and robust measurement metrics of interest to our advertising clients. You will work closely with other data scientists, data analysts, product \u0026amp; engineering teams, and other business units. This is a great opportunity to work with real world data at scale and to help define and shape the measurement standards in a very dynamic and evolving industry.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop \u0026amp; deploy statistical \u0026amp; machine learning models at scale to create high quality disruptive products\u003c/li\u003e\n\u003cli\u003eContribute to our growing portfolio of data science and technology patents\u003c/li\u003e\n\u003cli\u003eEstablish robust processes to insure the accuracy, stability, reproducibility, and overall quality of all data, algorithms, and the results they produce.\u003c/li\u003e\n\u003cli\u003eRepresent Data Science team in product and roadmap design sessions\u003c/li\u003e\n\u003cli\u003eParticipate in building reliable QA processes for both data and results\u003c/li\u003e\n\u003cli\u003eCollaborate on key architectural decisions and design considerations\u003c/li\u003e\n\u003cli\u003eContribute to and promote good software engineering practices across the Engineering Department.\u003c/li\u003e\n\u003cli\u003eUnderstand the current data sets and models and provide thought leadership by discovering new ways to enrich and use our massive data assets\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications Required:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA true passion for data, data quality, research and a solid data science approach\u003c/li\u003e\n\u003cli\u003eMasters or Ph.D.in Statistics, Economics, Operations Research, or similar quantitative field\u003c/li\u003e\n\u003cli\u003eAt least 5 to 10 years of professional experience with clear career progression and demonstrated success at developing models that drive business value\u003c/li\u003e\n\u003cli\u003eExcellent communication skills and the ability to present methodologies and findings to audiences with varying technical background\u003c/li\u003e\n\u003cli\u003eSolid understanding of probability and statistics\u003c/li\u003e\n\u003cli\u003eSolid understanding of research design, A/B and test-vs-control statistical testing frameworks\u003c/li\u003e\n\u003cli\u003eSolid understanding of unsupervised and supervised machine learning approaches including clustering and classification techniques.\u003c/li\u003e\n\u003cli\u003eExperience in building Machine Learning models (GLM, SVM, Bayesian Methods, Tree Based Methods, Neural Networks)\u003c/li\u003e\n\u003cli\u003eSolid understanding of how to assess the quality of machine learning models – including the ability to tune and optimize models and to diagnose and correct problems.\u003c/li\u003e\n\u003cli\u003eExperience working with multiple data types including numerical, categorical, and count data.\u003c/li\u003e\n\u003cli\u003eA driven leader, able to manage competing priorities and drive projects forward in a dynamic and fast paced business environment.\u003c/li\u003e\n\u003cli\u003eExperienced/Advanced programmer in Scala, Python, or similar programming languages\u003c/li\u003e\n\u003cli\u003eExperienced/Advanced Programmer in Spark, SQL, and Hadoop\u003c/li\u003e\n\u003cli\u003eExperience in developing algorithms and building models based on TB-scale data\u003c/li\u003e\n\u003cli\u003eFamiliarity with the digital media / advertising industry is a big plus\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jsco.re/6wp3q\"\u003ehttps://jsco.re/6wp3q\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"08ebe26e-a078-4c69-9b02-eab84320fce9","type":"Full Time","url":"https://jobs.github.com/positions/08ebe26e-a078-4c69-9b02-eab84320fce9","created_at":"Thu Aug 06 13:14:46 UTC 2020","company":"Uplink","company_url":"http://www.uplinktalent.com","location":"Remote - United States","title":"Sr. Full Stack Software Engineer - Cybersecurity","description":"\u003cp\u003eSenior Software Developer\nFull-Time\n100% Remote\u003c/p\u003e\n\u003cp\u003ePlease note: You must be authorized to work for any employer in the US to be considered for this opportunity\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBase salary from $120 to $180k/yr. plus stock options, plus bonus\u003c/li\u003e\n\u003cli\u003eStack is Java, JavaScript, React, Angular, Node.js (also uses Python)\u003c/li\u003e\n\u003cli\u003eThe client is growing (hiring) 40% this year, with revenue of $20 Million annually\u003c/li\u003e\n\u003cli\u003eThey secure customer applications and integrate w/client source code \u0026amp; infrastructure to find vulnerabilities (and fix them).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI’m working directly with the hiring manager at a Cybersecurity company in Austin, TX to fill four (4) Senior Software Engineer positions. Will consider back-end experience with Java, C#, or Python\u003c/p\u003e\n\u003cp\u003eFrom software hacking to hardware hacking, we help secure everything from cryptocurrency exchanges and space telescopes to autonomous vehicles and the electric grid. Today, our client is making significant investments in terms of financial and engineering resources to develop a radically new customer experience we call “Security-as-a-Service” to provide customers with a unified, efficient, and data-driven security platform. We are looking to add the right individual to our growing team supporting the next wave of cybersecurity products and solutions.\u003c/p\u003e\n\u003cp\u003eAs a full stack software engineer, you’ll have the opportunity to work with some of the best security engineers in the world who hail from organizations such as Amazon, CIA, Facebook, Google, Microsoft, NSA, Redhat, Sun Microsystems, and US Air Force. As an Inc. Best Places to Work, Inc. 500 | 5000, Cybersecurity 500, and Austin Fast 50 Award recipient, we are seeking an individual that understands the professional and personal growth attached to this opportunity and who has the corresponding internal drive to maximize it.\u003c/p\u003e\n\u003cp\u003eCareer opportunity:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJoin an industry with massive socio, economic, and political importance in the 21st century\u003c/li\u003e\n\u003cli\u003ePartner with prominent clients and help them solve hard security problems\u003c/li\u003e\n\u003cli\u003eWork alongside some of the best and the brightest minds in the security industry\u003c/li\u003e\n\u003cli\u003eLeave an indelible mark on a company where individual input has real impact\u003c/li\u003e\n\u003cli\u003eBe recognized, internally and publicly, for your contributions in a high profile position\u003c/li\u003e\n\u003cli\u003eAlign your career trajectory with a hyper-growth company that is on the move\u003c/li\u003e\n\u003cli\u003eBe part of the initial team designing and building out this product\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCore responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate uncanny amounts of complex code in a short order\u003c/li\u003e\n\u003cli\u003eDevelop, test, and maintain code throughout the code base\u003c/li\u003e\n\u003cli\u003eProvide development effort estimation and story point new features\u003c/li\u003e\n\u003cli\u003eTroubleshoot and resolve reported bugs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequired qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Java or Python, Javascript, and front end frameworks like Angular\u003c/li\u003e\n\u003cli\u003eBS in computer science or computer engineering\u003c/li\u003e\n\u003cli\u003eAt least 5 years professional experience in a software engineering position\u003c/li\u003e\n\u003cli\u003eExperience with modern technology stacks\u003c/li\u003e\n\u003cli\u003eExperience with React (may be the front-end), Node.js, (server side runtime environment back end to run JavaScript) or similar libraries and frameworks\u003c/li\u003e\n\u003cli\u003eExperience with micro-services architectures\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with cloud platforms and SaaS solutions\u003c/li\u003e\n\u003cli\u003eExperience with agile/scrum development practices\u003c/li\u003e\n\u003cli\u003eExperience with test driven development, continuous integration, continuous deployment\u003c/li\u003e\n\u003cli\u003eExperience with Git, JIRA, Confluence\u003c/li\u003e\n\u003cli\u003eExperience with Google Compute, Firebase, Docker, and GKE\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired behaviors:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRelentless restlessness to solve customer problems throughout the codebase\u003c/li\u003e\n\u003cli\u003eAbility to maintain high levels of output and work ethic\u003c/li\u003e\n\u003cli\u003ePersonable individual who enjoys working in a team-oriented environment\u003c/li\u003e\n\u003cli\u003eComfort dealing with ambiguity in an environment where we build the plane as we fly it\u003c/li\u003e\n\u003cli\u003eAbility to work within constraints and to challenge the status quo\u003c/li\u003e\n\u003cli\u003eAbility to self-direct work, orient to action, and truly own the position in a hyper-growth environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation package:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHighly competitive base-salary\u003c/li\u003e\n\u003cli\u003eEligible for performance-based incentive compensation\u003c/li\u003e\n\u003cli\u003eEmployee stock option plan\u003c/li\u003e\n\u003cli\u003eHealth insurance\u003c/li\u003e\n\u003cli\u003e4% company 401K matching vested immediately\u003c/li\u003e\n\u003cli\u003eCompany contributions to training and conferences\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail resume to \u003ca href=\"mailto:jay.miller@uplinktalent.com\"\u003ejay.miller@uplinktalent.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1264511bcee45490ad7a5ca5d165e4e38ce85081/LI111.png"},{"id":"c331ea45-9ee9-4017-803b-6ff534706420","type":"Full Time","url":"https://jobs.github.com/positions/c331ea45-9ee9-4017-803b-6ff534706420","created_at":"Wed Aug 05 04:21:47 UTC 2020","company":"Xillum LLC","company_url":"https://xillum.com/","location":"Remote","title":"Full-stack Cloud Applications Developer for Xillum","description":"\u003cp\u003e\u003cstrong\u003eLocations:\u003c/strong\u003e Remote\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFull-stack Cloud Applications Developer for Xillum\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a full-stack cloud applications engineer, you will have the opportunity to help build a revolutionary software suite to transform healthcare organizations. The software suite will be a subscription-based set of hosted applications that will include operations and revenue analytics to allow healthcare organizations to focus on providing world class healthcare. The system will be focused on driving value in healthcare from revenue cycle optimization to clinical variation management.\u003c/p\u003e\n\u003cp\u003eYou will be working with the founders to build and enhance the web-based applications needed to power analytics, with a specific focus on leveraging cloud technologies to add advanced capabilities and improve application efficiency.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe expect you to have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA BA/BS degree in Computer Science, Engineering, or a related field\u003c/li\u003e\n\u003cli\u003e2-4 years of hands-on experience developing cloud, enterprise applications or analytical applications with a focus on back-end data processing and data analysis pipelines\u003c/li\u003e\n\u003cli\u003eFamiliarity with healthcare data (e.g., HL7, EDI, bills, claims) and a general interest in the healthcare industry\u003c/li\u003e\n\u003cli\u003eProven experience leveraging AWS cloud-native technologies, with specific focus on:\nBackend:  EC2, Elastic Beanstalk, S3, Route 53\nDatabase:  RDS, mySQL, SQL Server\nMachine Learning:  Amazon SageMaker\u003c/li\u003e\n\u003cli\u003eWeb application development skills including:\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eWordPress\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eCryptography Implementation (Encryption, PKI, and Hashing)\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eHTML/CSS\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eWeb/database integration\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eFamiliarity with a Web scripting language (e.g., ColdFusion, .Net, JSP, PHP, Python, and/or Perl).\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eMobile application development skills including:\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eDevelopment experience in building Android/iOS Applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Java/C#\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Swift\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eA desire to identify opportunities, work independently, and lead initiatives\u003c/li\u003e\n\u003cli\u003eExcellent problem identification, analysis and solving skills.\u003c/li\u003e\n\u003cli\u003eAn innate ability to utilize all resources at your disposal to find a creative solution to a problem, whether business/functional or technical in nature\u003c/li\u003e\n\u003cli\u003eA general interest in relevant emerging technologies and a constant thirst to further your own technical abilities\u003c/li\u003e\n\u003cli\u003eExperience working in an Agile development environment\u003c/li\u003e\n\u003cli\u003eThe ability to work well independently and as a team player\u003c/li\u003e\n\u003cli\u003eExcellent conversational and written communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe would love you to have\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with QlikSense or other BI/analytics tools such as Tableau, including experience integrating them into custom web applications\u003c/li\u003e\n\u003cli\u003eExperience with the full text search engine such as Elasticsearch\u003c/li\u003e\n\u003cli\u003eData modeling and solution design experience\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow you'll grow\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Xillum, you will have the opportunity to join the business at the ground floor helping shape the software and grow into technical, management, and leadership positions based on your interests.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Xillum, we know that happy employees make a business great.  We provide competitive benefits to attract and retain the best talent available.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eXillum’s culture\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInclusion is a major part of how we lead. It invites authenticity, leverages our diversity, and fosters well-being. We seek out and involve individuals with diverse experiences and backgrounds because we know how critical this can be in making an impact that matters to our clients and our people.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCategory:\u003c/strong\u003e Healthcare\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Xillum\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a startup company excited about bringing healthcare into a new era of leveraging machine learning and business analytics to allow healthcare providers to do what they do best, take care of their patients.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability or protected veteran status, or any other legally protected basis, in accordance with applicable law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume and cover letter to \u003ca href=\"mailto:careers@xillum.com\"\u003ecareers@xillum.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8941cf66614218ac0393a27858229d578e401388/Xillum_Logo.png"},{"id":"9511ee69-6ab5-4a98-86cf-d29d1fb2ff83","type":"Full Time","url":"https://jobs.github.com/positions/9511ee69-6ab5-4a98-86cf-d29d1fb2ff83","created_at":"Tue Aug 04 16:21:07 UTC 2020","company":"Sticker Mule","company_url":"https://www.stickermule.com/careers","location":"Anywhere","title":"Site Reliability Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Sticker Mule\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 different countries, and we're always looking for more exceptional engineers.\u003c/p\u003e\n\u003cp\u003eThe SRE team is responsible for the reliability and performance of our cloud infrastructure, the continuous integration and delivery pipelines, and the development tools used to build our services.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.stickermule.com/about\"\u003eSee more about our teams here\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eRemote work with flexible schedules\u003c/li\u003e\n\u003cli\u003eVaried, interesting technical challenges to solve\u003c/li\u003e\n\u003cli\u003eA fun \"no bullshit\" work environment\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWe like you to know\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eLinux\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eGCP/AWS\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eMySQL\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eGo\u003c/li\u003e\n\u003cli\u003eFamiliarity with Ruby/JS/Python\u003c/li\u003e\n\u003cli\u003eAvailability for on-call schedule\u003c/li\u003e\n\u003cli\u003eExcellent communication skills (English)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent practical experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and benefits\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e$99,000-$135,000+\u003c/li\u003e\n\u003cli\u003e$10,000 signing bonus\u003c/li\u003e\n\u003cli\u003e4 weeks vacation\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eApply here only:\u003c/strong\u003e \u003ca href=\"https://www.stickermule.com/career/da8cef1b-b9fa-45c5-9e9d-a3c975e0aca2\"\u003ehttps://www.stickermule.com/career/da8cef1b-b9fa-45c5-9e9d-a3c975e0aca2\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3FIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--65d9aab4ef72c61e9d66a644f2a61ee29ee71924/herman%206.jpg"},{"id":"242132e0-f129-4a1b-8bfa-30f2fed13123","type":"Full Time","url":"https://jobs.github.com/positions/242132e0-f129-4a1b-8bfa-30f2fed13123","created_at":"Tue Aug 04 07:30:07 UTC 2020","company":"komoot","company_url":"https://www.komoot.com/jobs","location":"Remote Europe","title":"Senior Backend Developer (Data Science)","description":"\u003cp\u003eMillions of people experience real-life adventures with our apps. We help people all over the world discover the best hiking and biking routes, empowering our users to explore more of the great outdoors. And we’re good at it: Google and Apple have listed us as one of their Apps of the Year numerous times – and, with more than 13 million users and 100,000 five-star reviews – komoot is on its way to become one of the most popular cycling and hiking apps.\nJoin our fully remote team of 65 people and change the way people explore!\u003c/p\u003e\n\u003cp\u003eTo help us continue to grow, we ‘re looking for an experienced backend developer with knowledge in data science.\nKomoot possesses a unique dataset of user-generated content, ranging from GPS data from tours, uploaded photos, and tips, to implicit and explicit user feedback. To get the biggest value from this raw data, we need your excellent software and  analytical skills.\u003c/p\u003e\n\u003cp\u003eThe challenges include automatic evaluation and classification of our user-generated content as well as innovative approaches to assembling them into consumable inspiration for users (e.g. auto-generated tour suggestions tailored to users’ sport and location). You’ll wrap up your algorithms into clean and scalable microservices in our modern cloud environment.\u003c/p\u003e\n\u003cp\u003eWe believe that innovations based on data science will reinforce and extend our leadership in the outdoor market and your role will be decisive for komoot’s success.\u003c/p\u003e\n\u003cp\u003eWhat you will do\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork closely with our data scientists, web and mobile developers, designers, copywriters and product managers\u003c/li\u003e\n\u003cli\u003eDiscuss product improvements, technical possibilities and road maps\nInvestigate and evaluate data science approaches for product enhancements (you can count on the support of experienced data scientists)\u003c/li\u003e\n\u003cli\u003eTurn prototypes into resilient and scalable REST APIs and background workers\u003c/li\u003e\n\u003cli\u003eDeploy and monitor your code in our AWS Cloud\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy you will love it\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll be challenged with a wide range of tasks for which there are no standard solutions\u003c/li\u003e\n\u003cli\u003eYou’ll have full ownership: from concept, prototypes, and building, to deploying and monitoring\u003c/li\u003e\n\u003cli\u003eYou’ll deal with diverse datasets (location data, social network, user content (images, text), external data sources like OSM, product analytics, ...)\u003c/li\u003e\n\u003cli\u003eYou’ll contribute to a product with a vision to inspire more people to go outdoors\u003c/li\u003e\n\u003cli\u003eYou’ll work in a fast-paced startup with strongly motivated and talented co-workers\u003c/li\u003e\n\u003cli\u003eYou’ll enjoy the freedom to organize yourself the way you want\u003c/li\u003e\n\u003cli\u003eWe let you work from wherever you want, be it a beach, the mountains, your house, a coworking center of your choice, our HQ in Potsdam or anywhere else that lies in any time zone situated between UTC-1 and UTC+3\u003c/li\u003e\n\u003cli\u003eYou’ll travel together with our team to amazing outdoor places several times a year to exchange ideas, learnings and go for hikes and rides\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou will be successful in this position if you\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave a passion for finding pragmatic and smart solutions to complex problems\u003c/li\u003e\n\u003cli\u003eHave 3+ years of professional experience in backend development in the cloud\u003c/li\u003e\n\u003cli\u003eHave 2+ years of professional experience in Kotlin/Java/Scala\u003c/li\u003e\n\u003cli\u003eHave 2+ years of professional experience in Python\u003c/li\u003e\n\u003cli\u003eKnow SQL and NoSQL\u003c/li\u003e\n\u003cli\u003eHave a solid understanding of math and statistics\u003c/li\u003e\n\u003cli\u003eHave a solid understanding of data science fundamentals\u003c/li\u003e\n\u003cli\u003eMaster Jupyter, pandas, NumPy, matplotlib/seaborn, scikit-learn\u003c/li\u003e\n\u003cli\u003eHave strong communication and team skills\u003c/li\u003e\n\u003cli\u003eHave a hands-on attitude and are highly self-driven\u003c/li\u003e\n\u003cli\u003eBonus: BigData experience (Spark, Presto, Hadoop)\u003c/li\u003e\n\u003cli\u003eBonus: Infrastructure as Code\u003c/li\u003e\n\u003cli\u003eBonus: Deployment, CI and monitoring\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSounds like you?\nGreat! Then send us the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYour CV in English highlighting your most relevant experience\u003c/li\u003e\n\u003cli\u003eA write-up explaining who you are and why you are interested in working at komoot\u003c/li\u003e\n\u003cli\u003eExamples of your work (e.g. GitHub Repositories, PDFs, Slideshare, etc.)\u003c/li\u003e\n\u003cli\u003eFeel free to send us something that shows us a little more about what you’re interested in, be it your Twitter/Instagram account, a blog or something else\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo apply please follow this link: \u003ca href=\"https://www.komoot.com/jobs/senior-backend-developer-data-science\"\u003ehttps://www.komoot.com/jobs/senior-backend-developer-data-science\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.komoot.com/jobs/senior-backend-developer-data-science\"\u003ehttps://www.komoot.com/jobs/senior-backend-developer-data-science\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHVIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b15af088b0aadd4893fb444330857479de944b45/Screen%20Shot%202020-04-04%20at%2011.25.17.png"},{"id":"df4c0214-e31f-4bed-9d8c-3222c35ac914","type":"Full Time","url":"https://jobs.github.com/positions/df4c0214-e31f-4bed-9d8c-3222c35ac914","created_at":"Tue Aug 04 00:28:28 UTC 2020","company":"Car Registration, inc. ","company_url":"http://www.carregistration.com","location":"Elk Grove, CA","title":"Software Engineer","description":"\u003cp\u003eCar Registration, Inc.\u003c/p\u003e\n\u003cp\u003eCar Registration, Inc. (CRI) provides comprehensive, on-line vehicle registration and titling services for consumers who desire or need a DMV alternative.  Currently licensed and bonded under the California DMV’s Business Partner Automation program, CRI successfully processes over 250,000 transactions per year while reducing wait times and allowing the CA DMV to reallocate its resources to other services and administrative tasks.  With CRI, customers can get same-day processing, next day delivery and comprehensive telephone and email support.  Through its website, CRI collects fees from vehicle owners, transmits fees to the DMV in real time and issues registration cards and stickers to the customer via USPS or express courier.\u003c/p\u003e\n\u003cp\u003eJob Description\nCRI, is a leader in providing consumers direct access to DMV services through our online technology. We provide customers the ability to skip the line at the DMV by using our online platform to renew, replace, or transfer their vehicle registration and title. You will join a small but profitable start-up with the ability to shape and grow our software. We are looking for a self-motivated developer that is comfortable working on a cloud-based full stack built with Go, PHP, and JavaScript for both customer-facing and internal applications. In your role, you will join a small team of software developers to build new software, new features, and maintain existing functionality.\u003c/p\u003e\n\u003cp\u003eThis is a full-time remote position with competitive salary and benefits including medical, dental, vision, 401K plan and more. We are based in Elk Grove, CA. Though you won’t work in the office, we regularly communicate via Slack and Google Meets. Our annual holiday party is fun and inclusive and offers a great opportunity to catch-up with the team in person.\u003c/p\u003e\n\u003cp\u003eSkills \u0026amp; Requirements\n1+ year professional coding with Golang\n3+ years professional coding with PHP, Python, Ruby, or another server-side scripting language\n2+ years professional coding with JavaScript\n3+ years professional experience using a SQL database such as PostgreSQL, MySQL, Oracle, or MSSQL\nExperience integrating RESTful and/or gRPC APIs\nAbility to design and implement solutions to both frontend and backend problems from a non-technical specification into a finished feature\nExposure to DevOps practices including infrastructure as code, continuous integration, monitoring, and logging\nComfortable developing in a Mac or Linux environment\nFamiliarity with event-based functional architectures\nFamiliarity with MVC or MVVM architectures\nSecurity-conscious practices in any software built\u003c/p\u003e\n\u003cp\u003eDesirable Qualifications\nExperience with cloud-based distributed systems on providers such as AWS\nExperience with docker or container technologies\nExperience with CDNs\nExperience developing web-based business applications with complex workflows\nDatabase administration experience including setting up and maintaining replication servers\nBachelor’s degree, preferably in Computer Science or related discipline\u003c/p\u003e\n\u003cp\u003eIf you are interested, please send your resume to \u003ca href=\"mailto:Jobs@carregistration.com\"\u003eJobs@carregistration.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eCANDIDATES only please.\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer\nCRI is an equal opportunity employer to all, regardless of age, ancestry, color, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding and related medical conditions), and sexual orientation.\u003c/p\u003e\n\u003cp\u003eIt is an objective of CRI to achieve a drug-free workplace. Any applicant for  employment will be expected to behave in accordance with this objective.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf you are interested, please send your resume to \u003ca href=\"mailto:Jobs@carregistration.com\"\u003eJobs@carregistration.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbG1IIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--72882d4c37d2fd5cf977485d033eeaafee596f34/CarRegistration_Logo-02.png"},{"id":"2c8e5e58-e151-41c8-936a-3036eb9e91d6","type":"Full Time","url":"https://jobs.github.com/positions/2c8e5e58-e151-41c8-936a-3036eb9e91d6","created_at":"Mon Aug 03 19:19:22 UTC 2020","company":"Agiloft","company_url":"http://agiloft.com","location":"Russia","title":"Dev Ops Engineer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Java Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Java Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003eWe are seeking a DevOps Engineer to join our engineering team. The ideal candidate is someone who has a solid background in software development infrastructure architecture, automation, configuration management, monitoring, and tools development for enterprise software and systems. The candidate must have a passion for automating everything, and a sense of ownership.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop new automation systems and improve existing ones that enable fast delivery and replace manual operating procedures wherever they exist\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDrive analysis, design, and development of automation tools for deployment, development, and operational tasks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead architectural improvements in our software development- and delivery infrastructure and evaluate new technologies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAssume ownership of Agiloft’s installer\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least two years of hands-on experience as DevOps engineer\u003c/li\u003e\n\u003cli\u003eExperience with configuration management systems\u003c/li\u003e\n\u003cli\u003eExperience with the configuration of Linux and Windows operating systems\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Python- or Perl scripting languages\u003c/li\u003e\n\u003cli\u003eExperienced with Java\u003c/li\u003e\n\u003cli\u003eGood knowledge of Install4J\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePREFERRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComputer Science degree or equivalent\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration / either continuous delivery tools\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Unix bash or Windows powershell\u003c/li\u003e\n\u003cli\u003eExperience using containers\u003c/li\u003e\n\u003cli\u003eExperience supporting MySQL/MSSQL databases\u003c/li\u003e\n\u003cli\u003eExperience with public cloud platforms\u003c/li\u003e\n\u003cli\u003eExperience working in distributed teams\u003c/li\u003e\n\u003cli\u003eFluent in English language\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTo Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--559a8bf372b62f7222ca5bc3fc7fc8868d20e089/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"aa274e93-f888-4180-899a-4c13de6dd637","type":"Full Time","url":"https://jobs.github.com/positions/aa274e93-f888-4180-899a-4c13de6dd637","created_at":"Fri Jul 31 22:43:56 UTC 2020","company":"Agiloft","company_url":"http://agiloft.com","location":"India","title":"Dev Ops Engineer (Remote)","description":"\u003cp\u003e\u003cstrong\u003eTHRIVE WITH AGILOFT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you an experienced Sr. Java Developer who is successful, motivated, smart, energetic, and looking for a rewarding position in a growing, profitable and dynamic company?\u003c/p\u003e\n\u003cp\u003eAgiloft is expanding our developer team, looking for Sr. Java Developers that thrive working with enterprises in multiple industries, with unique business challenges requiring sophisticated solution design.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHY JOIN AGILOFT?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft was named the market leader in every category in the \u003ca href=\"https://www.agiloft.com/flash/Gartner_critical_capabilities_for_CLM.pdf\"\u003eGartner Critical Capabilities for CLM report\u003c/a\u003e, and a market leader in the Gartner Magic Quadrant.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContract Lifecycle Management (CLM) is one of the fastest growing areas of enterprise sales, with a TAM projected to climb from $2B to $7B in the next 5 years.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThe Agiloft Contract and Commerce Lifecycle Platform has won over \u003ca href=\"https://www.agiloft.com/awards.htm\"\u003ea dozen awards, including the Editor's Choice award from PC Mag\u003c/a\u003e, for the past five years in a row.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft has a highly differentiated value proposition which is uniquely appealing to enterprises: pre-built applications with a deeply configurable, no-code platform for integrated Business Process Management throughout an organization.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is pioneering the applied use of Artificial Intelligence to enable next-generation business commerce at organizations ranging from small enterprises to U.S. government agencies and Fortune 100 companies.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAgiloft is the only company in the industry with the confidence to provide an unconditional satisfaction guarantee, and you too will be successful with Agiloft.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs the leader in the CCLM market, Agiloft is winning many Enterprise deals and looking to hire the best talent to meet this demand with a competitive compensation plan that rewards overachievement.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is a remote-only position. You must be comfortable with setting your own schedule and proactively collaborating in a globally dispersed team using a variety of communication channels.\u003c/p\u003e\n\u003cp\u003eWe are seeking a DevOps Engineer to join our engineering team. The ideal candidate is someone who has a solid background in software development infrastructure architecture, automation, configuration management, monitoring, and tools development for enterprise software and systems. The candidate must have a passion for automating everything, and a sense of ownership.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB RESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop new automation systems and improve existing ones that enable fast delivery and replace manual operating procedures wherever they exist\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDrive analysis, design, and development of automation tools for deployment, development, and operational tasks\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLead architectural improvements in our software development- and delivery infrastructure and evaluate new technologies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAssume ownership of Agiloft’s installer\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least two years of hands-on experience as DevOps engineer\u003c/li\u003e\n\u003cli\u003eExperience with configuration management systems\u003c/li\u003e\n\u003cli\u003eExperience with the configuration of Linux and Windows operating systems\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Python- or Perl scripting languages\u003c/li\u003e\n\u003cli\u003eExperienced with Java\u003c/li\u003e\n\u003cli\u003eGood knowledge of Install4J\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePREFERRED QUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComputer Science degree or equivalent\u003c/li\u003e\n\u003cli\u003eExperience with continuous integration / either continuous delivery tools\u003c/li\u003e\n\u003cli\u003eDeep knowledge of Unix bash or Windows powershell\u003c/li\u003e\n\u003cli\u003eExperience using containers\u003c/li\u003e\n\u003cli\u003eExperience supporting MySQL/MSSQL databases\u003c/li\u003e\n\u003cli\u003eExperience with public cloud platforms\u003c/li\u003e\n\u003cli\u003eExperience working in distributed teams\u003c/li\u003e\n\u003cli\u003eFluent in English language\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS AND PERKS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary ($30 USD hourly)\u003c/li\u003e\n\u003cli\u003eReferral bonuses\u003c/li\u003e\n\u003cli\u003eFlexible work schedules\u003c/li\u003e\n\u003cli\u003eProfessional development and career growth opportunities\u003c/li\u003e\n\u003cli\u003eAwesome team members\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTo Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor immediate consideration, go to \u003ca href=\"https://www.agiloft.com/jobs.htm\"\u003ehttps://www.agiloft.com/jobs.htm\u003c/a\u003e, click the Apply button, fill out the online form, and attach your resume.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--db2c5c1d04e63a9c74d2eececa0240a6ca5eea93/Agiloft%20Logo%20plain%20(Indeed).png"},{"id":"fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e","type":"Full Time","url":"https://jobs.github.com/positions/fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e","created_at":"Thu Jul 30 12:13:55 UTC 2020","company":"HBM nCode Federal LLC","company_url":"http://www.hbmprenscia.com","location":"Starkville, MS","title":"Software Engineer","description":"\u003cp\u003eHBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Starkville, MS office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware product configuration, design and implementation\u003c/li\u003e\n\u003cli\u003eAssist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs\u003c/li\u003e\n\u003cli\u003eCreate detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations\u003c/li\u003e\n\u003cli\u003eCollaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency\u003c/li\u003e\n\u003cli\u003eWork with project and product managers to achieve on-time, on-cost delivery\u003c/li\u003e\n\u003cli\u003eResearch and test new technologies and software plus identify and recommend their applicability\u003c/li\u003e\n\u003cli\u003ePresentations to team members, management and customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEDUCATION / CERTIFICATIONS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.\u003c/li\u003e\n\u003cli\u003eA minimum of 3 years of relevant experience and related technology professional certifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePERSONAL SKILLS/EXPERIENCES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUS Citizens Only (REQUIREMENT)\u003c/li\u003e\n\u003cli\u003eSolid understanding of Object Oriented Programming\u003c/li\u003e\n\u003cli\u003eSolid understanding of modern Web based Programming techniques\u003c/li\u003e\n\u003cli\u003eExperience with database architectures, scripting and web services\u003c/li\u003e\n\u003cli\u003eExperience in working with both unstructured and structured data\u003c/li\u003e\n\u003cli\u003eA solid foundation in computer science, with strong competencies in data structures, algorithms and software design\u003c/li\u003e\n\u003cli\u003eAbility to apply software techniques to the development of real world engineering solutions\nExperience with one or more of the following technologies in each category:\u003c/li\u003e\n\u003cli\u003eMongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\n*Kafka, Spark, Power BI, Tableau, Grafana;\n*C/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\n*Version control systems (e.g. Git, SVN, Mercurial, etc.);\n*Project management software (e.g. Jira, Confluence);\n*Unix based and Windows operating systems;\u003c/li\u003e\n\u003cli\u003ePrior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies\u003c/li\u003e\n\u003cli\u003eDetail oriented with a keen focus on User Experience (Ux) and customer satisfaction.\u003c/li\u003e\n\u003cli\u003eFamiliarity and prior experience with Agile / Scrum development methodologies\u003c/li\u003e\n\u003cli\u003eMulti core / machine development experience (Linux and Windows)\u003c/li\u003e\n\u003cli\u003eExperience with developing scalable / parallel processing applications\u003c/li\u003e\n\u003cli\u003eHigh level of interpersonal skills to work independently and effectively with others\u003c/li\u003e\n\u003cli\u003eExceptional skills related to time management and decision making\u003c/li\u003e\n\u003cli\u003eWillingness to travel to support customer projects and implementations\u003c/li\u003e\n\u003cli\u003eGood communication skills, both verbal and written\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:vacancies@ncodefederal.com\"\u003evacancies@ncodefederal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"7d84945b-893d-493e-957a-4ed9e6f84607","type":"Full Time","url":"https://jobs.github.com/positions/7d84945b-893d-493e-957a-4ed9e6f84607","created_at":"Thu Jul 30 12:02:59 UTC 2020","company":"HBM nCode Federal LLC","company_url":"http://www.hbmprenscia.com","location":"Southfield, MI","title":"Software Engineer","description":"\u003cp\u003eHBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Southfield, MI office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.\u003c/p\u003e\n\u003cp\u003eRESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware product configuration, design and implementation\u003c/li\u003e\n\u003cli\u003eAssist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs\u003c/li\u003e\n\u003cli\u003eCreate detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations\u003c/li\u003e\n\u003cli\u003eCollaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency\u003c/li\u003e\n\u003cli\u003eWork with project and product managers to achieve on-time, on-cost delivery\u003c/li\u003e\n\u003cli\u003eResearch and test new technologies and software plus identify and recommend their applicability\u003c/li\u003e\n\u003cli\u003ePresentations to team members, management and customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEDUCATION / CERTIFICATIONS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.\u003c/li\u003e\n\u003cli\u003eA minimum of 3 years of relevant experience and related technology professional certifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePERSONAL SKILLS/EXPERIENCES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUS Citizens Only (REQUIREMENT)\u003c/li\u003e\n\u003cli\u003eSolid understanding of Object Oriented Programming\u003c/li\u003e\n\u003cli\u003eSolid understanding of modern Web based Programming techniques\u003c/li\u003e\n\u003cli\u003eExperience with database architectures, scripting and web services\u003c/li\u003e\n\u003cli\u003eExperience in working with both unstructured and structured data\u003c/li\u003e\n\u003cli\u003eA solid foundation in computer science, with strong competencies in data structures, algorithms and software design\u003c/li\u003e\n\u003cli\u003eAbility to apply software techniques to the development of real world engineering solutions\u003c/li\u003e\n\u003cli\u003eExperience with one or more of the following technologies in each category:\nMongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\nKafka, Spark, Power BI, Tableau, Grafana;\nC/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\nVersion control systems (e.g. Git, SVN, Mercurial, etc.);\nProject management software (e.g. Jira, Confluence);\nUnix based and Windows operating systems\u003c/li\u003e\n\u003cli\u003ePrior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies\u003c/li\u003e\n\u003cli\u003eDetail oriented with a keen focus on User Experience (Ux) and customer satisfaction.\u003c/li\u003e\n\u003cli\u003eFamiliarity and prior experience with Agile / Scrum development methodologies\u003c/li\u003e\n\u003cli\u003eMulti core / machine development experience (Linux and Windows)\u003c/li\u003e\n\u003cli\u003eExperience with developing scalable / parallel processing applications\u003c/li\u003e\n\u003cli\u003eHigh level of interpersonal skills to work independently and effectively with others\u003c/li\u003e\n\u003cli\u003eExceptional skills related to time management and decision making\u003c/li\u003e\n\u003cli\u003eWillingness to travel to support customer projects and implementations\u003c/li\u003e\n\u003cli\u003eGood communication skills, both verbal and written\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:vacancies@ncodefederal.com\"\u003evacancies@ncodefederal.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"9a05af9c-9f58-41f7-b0a0-3890fb75dd85","type":"Full Time","url":"https://jobs.github.com/positions/9a05af9c-9f58-41f7-b0a0-3890fb75dd85","created_at":"Tue Jul 28 14:19:46 UTC 2020","company":"General Motors","company_url":null,"location":"Warren, Michigan","title":"Entry Level Controls and Software Engineer ","description":"\u003cp\u003eAbout GM\nThere’s never been a more exciting time to work for General Motors.\u003c/p\u003e\n\u003cp\u003eTo achieve our vision of a world with Zero Crashes, Zero Emissions and Zero Congestion, we need people to join us who are passionate about creating safer, better and more sustainable ways for people to get around. This bold vision won’t happen overnight, but just as we transformed how the world moved in the last century, we are committed to transforming how we move today and in the future.\u003c/p\u003e\n\u003cp\u003eWhy Work for Us\nOur culture is focused on building inclusive teams, where differences and unique perspectives are embraced so you can contribute to your fullest potential as you pursue your career. Our locations feature a variety of work environments, including open work spaces and virtual connection platforms to inspire productivity and flexible collaboration. And we are proud to support our employees volunteer interests, and make it a priority to join together in efforts that give back to our communities.\u003c/p\u003e\n\u003cp\u003eJob Description\nGeneral Motors is looking for innovative Entry Level Cyber-Physical Systems Engineers to help us build state-of-the-art platforms. This rotational opportunity is an early career development initiative for new hires designed to build foundational skills, to gain greater exposure and to better understand our business. This role aims to develop and strengthen the future of our organization through rotational development, networking and annual development opportunities. This program requires a two-year commitment and consists of 4 six-month assignments. Upon completion of the program, participants are matched to opportunities based on interest and business needs.\u003c/p\u003e\n\u003cp\u003eIn this entry level rotational opportunity, you will help design, develop and test software codes, algorithms, embedded systems and architect software to optimize controller resources and throughput.  These codes will run throughout almost every aspect of the vehicle controllers so you will be able to do hands on work that can directly affect the vehicle. Your work could be driving around on the roads! All of this work will be done on multiple levels so you will have a chance to develop interpersonal and relationship management skills with the ability to effectively collaborate with varying levels of the organization.\u003c/p\u003e\n\u003cp\u003ePrimary responsibilities:\nConvert/interpret algorithms and other required documents into software code\nAccountable to develop software that runs within GM’s embedded controllers using the GM software tool chain\nDesign, develop and test feature behavior and interaction between controls hardware and controls software\nDevelop test cases aligned with requirements using manual and automated test environments in the local PC, Hardware-In-the-Loop (HIL) bench, and system level bench environments\nCompile software into executable files and to test/evaluate executable files\nData analysis and research to assess vehicle feature feasibility\nAdditional Job DescriptionQualifications:\nCurrently pursuing a Bachelor’s Degree or Master’s Degree in the following fields of study: Computer Engineering, Software Engineering, Computer Science, Controls Engineering, Controls Systems Engineering, or Mechatronics\nMust be graduating between October 2020 and June 2021\u003c/p\u003e\n\u003cp\u003eABET accredited program Preferred\nMust have a minimum of a 3.0 cumulative GPA on a 4.0 scale\nDemonstrated coding efficiency, speed \u0026amp; quality\nEfficient use of MATLAB/Simulink\nDesired Skills:\nPrior internship experience in automotive or technology\nEngineering degree with focus on Robotics, Data Analytics, Machine Learning, Sensing, Automation, or Computation\nExperience with programming languages Ex: Python, C++, Java, etc.\nDemonstrated algorithm generation and connection to the physical requirements\nSoftware Programs: CAN messaging, GIT change management tool, Rhapsody, DOORS Requirements management software\nDemonstrated knowledge and application of Software and/or Controls Engineering Principles\nExcellent written and verbal communication skills with the ability to distill sophisticated subjects to a wider audience\nEmerging partnership and teamwork skills and ability to learn from and share knowledge with co-workers in a rapidly moving environment\nHigh level of integrity, ability to deal with ambiguity, takes initiative/self-directed\nEvidence of strong character with integrity, honesty, accountability and trust\nDeliver new and creative solutions to complex problems\nRelocation assistance is available to candidates who meet eligibility requirements.\u003c/p\u003e\n\u003cp\u003ePLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP.\u003c/p\u003e\n\u003cp\u003eDiversity Information\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities.\u003c/p\u003e\n\u003cp\u003eWe encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eJoin our General Motors Team! Apply here: \u003ca href=\"https://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group\"\u003ehttps://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--97a0aab03f74a44cfd5b07ca3c85493fa88ee247/GM_Logo.png"},{"id":"0e8f447e-9f83-4257-921c-532f29ebfa63","type":"Full Time","url":"https://jobs.github.com/positions/0e8f447e-9f83-4257-921c-532f29ebfa63","created_at":"Mon Jul 27 10:37:11 UTC 2020","company":"Reveela Technolgies Limited","company_url":"http://www.reveela.com","location":"Newcastle","title":"Data Scientist \u0026 Machine Learning Engineer ","description":"\u003cp\u003eRole: Data Scientist \u0026amp; Machine Learning Engineer\nLocation: Newcastle Upon Tyne\nSalary: £30,000-£36,000 per annum depending upon specialisms\u003c/p\u003e\n\u003cp\u003eWorking as part of an agile team, you will be involved in expanding and developing advanced methodologies \u0026amp; data analytics for a next generation publishing ecosystem that facilitates collaboration between Publishers, Journalists and the Business Community by applying artificial intelligence (Natural Language Processing) and machine learning. Further background can be sought here: \u003ca href=\"https://vimeo.com/371641177\"\u003ehttps://vimeo.com/371641177\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eGiven the project involves behaviour analysis, as well as a large amount of data analysis, modelling of decision making and data interpretation; an ability to critically interpret results and experience of experimentation, modelling and data analysis is essential.\u003c/p\u003e\n\u003cp\u003eKey areas of responsibility will include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuilding \u0026amp; optimizing a range of complex classifiers using machine learning \u0026amp; statistical techniques.\u003c/li\u003e\n\u003cli\u003eCollaborate with other system engineers to build data and model pipelines\u003c/li\u003e\n\u003cli\u003eManage the infrastructure and data pipelines needed to bring code to production\u003c/li\u003e\n\u003cli\u003eDemonstrate end-to-end understanding of applications (including, but not limited to, the machine learning algorithms) being created\u003c/li\u003e\n\u003cli\u003eBuild algorithms based on statistical modelling procedures and build and maintain scalable machine learning solutions in production\u003c/li\u003e\n\u003cli\u003eUse data modelling and evaluation strategy to find patterns and predict unseen instances\u003c/li\u003e\n\u003cli\u003eApply machine learning algorithms and libraries\u003c/li\u003e\n\u003cli\u003eLead on software engineering and software design with UX team.\u003c/li\u003e\n\u003cli\u003eCommunicate and explain complex processes to stakeholders who are not programming experts\u003c/li\u003e\n\u003cli\u003eLiaise with stakeholders to analyse business problems, clarify requirements and define the scope of the resolution needed\u003c/li\u003e\n\u003cli\u003eAnalyse expansive, complex datasets to extract insights and decide on the appropriate technique\u003c/li\u003e\n\u003cli\u003eResearch and implement best practices to improve the existing machine learning infrastructure\u003c/li\u003e\n\u003cli\u003eProvide support to engineers and product managers in implementing machine learning in the product.\u003c/li\u003e\n\u003cli\u003eYou'll be working with multifaceted systems, requiring you to have a high level of concentration and attention to detail.\u003c/li\u003e\n\u003cli\u003eTesting and evaluating data mining models to select the most appropriate ones for any context.\u003c/li\u003e\n\u003cli\u003eHandling systems architecture with cloud technologies (AWS, Azure, Google Cloud, IBM Cloud)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills, Experience and Education Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA PhD in Computer Science, Software Engineering, or closely related discipline is needed for this interdisciplinary job role.\u003c/li\u003e\n\u003cli\u003eExperience of using both MySQL and No SQL databases (MongoDB/Elastic Search)\u003c/li\u003e\n\u003cli\u003eHighly competent in using Python\u003c/li\u003e\n\u003cli\u003eExperience of exploratory data analysis\u003c/li\u003e\n\u003cli\u003eThe ability to work within a highly skilled team, adding value through idea generation \u0026amp; implementation.\u003c/li\u003e\n\u003cli\u003eMust be proactive about technology horizon scanning and willing to go the extra make to make a difference to the world through the real-world application of technological solutions.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional Details\u003c/p\u003e\n\u003cp\u003eExceptional fun working environment\n25 days annual holiday\nAttractive benefits package Including Health insurance\nNOTE: Applicants MUST have a valid UK visa\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eE mail your CV to \u003ca href=\"mailto:john@reveela.com\"\u003ejohn@reveela.com\u003c/a\u003e or \u003ca href=\"mailto:john.graham@distinctivegroup.co.uk\"\u003ejohn.graham@distinctivegroup.co.uk\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13e8ad5220882e02b0092a98dde37872388bf6a0/ReveelaLogoGrey%20(002).png"},{"id":"f95c5fdd-749d-441a-8497-35bf430ac7b5","type":"Full Time","url":"https://jobs.github.com/positions/f95c5fdd-749d-441a-8497-35bf430ac7b5","created_at":"Fri Jul 24 18:02:37 UTC 2020","company":"General Atomics","company_url":"https://www.ga-careers.com/","location":"Centennial, CO","title":"Flight Software Developer","description":"\u003cp\u003eGeneral Atomics (GA), and its affiliated companies, is one of the world’s leading resources for high-technology systems development ranging from the nuclear fuel cycle to remotely piloted aircraft, airborne sensors, and advanced electric, electronic, wireless and laser technologies.\u003c/p\u003e\n\u003cp\u003eGeneral Atomics Electromagnetic Systems (GA-EMS) designs and manufactures first-of-a-kind electromagnetic and electric power generation systems. GA-EMS’ expanding portfolio of specialized products and integrated system solutions support critical fleet, space systems and satellites, missile defense, power and energy, and process and monitoring applications for defense, industrial, and commercial customers worldwide.\u003c/p\u003e\n\u003cp\u003eWe currently have an exciting opportunity for a Flight Software Developer working on satellite systems to join our team located in Centennial, CO.\u003c/p\u003e\n\u003cp\u003eDUTIES AND RESPONSIBILITIES:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop flight software, interface software and drivers for satellite systems\u003c/li\u003e\n\u003cli\u003ePerform ground segment (satellite operations) software architecture design as part of the overall satellite system solution.\u003c/li\u003e\n\u003cli\u003ePerform all aspects of the software development lifecycle including requirements definition, software design, development, test, debug and documentation.\u003c/li\u003e\n\u003cli\u003eDesign, develop and verify test software and simulation capability.\u003c/li\u003e\n\u003cli\u003eTroubleshoot system anomalies related to software, system configuration, network interfaces and operating system issues.\u003c/li\u003e\n\u003cli\u003eSupport functional and performance testing of equipment, subsystems and systems in support of satellite assembly, integration and test.\u003c/li\u003e\n\u003cli\u003eApply technical knowledge to analyze, investigate and resolve engineering problems, including future applications, and engineering developments.\u003c/li\u003e\n\u003cli\u003ePrepare technical responses to bids, presentation materials and reports, for a variety of applications and customers.\u003c/li\u003e\n\u003cli\u003eSupport and actively participate in customer and supplier meetings and presentations at all project stages.\u003c/li\u003e\n\u003cli\u003eLiaise with customer and supplier staff, and staff from other parts of GA.\u003c/li\u003e\n\u003cli\u003ePerform other duties as assigned or required.\nWe recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eJOB QUALIFICATIONS:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eTypically requires a bachelors degree, masters degree or PhD in computer science, information systems or a related discipline and progressive software development experience as follows; four or more years of experience with a bachelors degree or two or more years of experience with a masters degree. May substitute equivalent experience in lieu of education.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMust have a complete understanding of software development concepts, principles, and theory and demonstrate complete understanding and application of programming and analysis concepts.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMust possess the ability to understand new concepts quickly and apply them accurately throughout an evolving environment.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to organize, schedule, and coordinate work phases and, determine the appropriate approach at the task level or, with assistance, at the project level and to provide solutions to a range of complex problems.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to obtain and maintain a DoD Security Clearance is required.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with C/C++, Python, Real Time Operating Systems, embedded systems, Linux, Microsoft Windows, IP communications and networking is desired.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with MySQL, VHDL, windows registry, knowledge of Cisco Routers would be beneficial.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliarity with GIT.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDemonstrated experience on satellite software products or safety critical software is an advantage.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliarity with all aspects of the satellite system life cycle is desired.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of clean room compliance and safe working practices.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong communication, computer, documentation, presentation, and interpersonal skills are required, as well as the ability to work both independently and as part of a team.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMust be able to work extended hours as required and be flexible and adaptable to changing priorities and workloads.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUS citizenship is required.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTravel Percentage Required 0% - 25%\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUS Citizenship Required? Yes\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eClearance Required? No\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://bit.ly/39n8ZES\"\u003ehttps://bit.ly/39n8ZES\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fc9a2e7c96f85e344b9a29da5fb01a261791ebe2/GA%20icon%20logo.png"},{"id":"fd0163dc-0edb-4be6-aec0-1b39653a2ff3","type":"Full Time","url":"https://jobs.github.com/positions/fd0163dc-0edb-4be6-aec0-1b39653a2ff3","created_at":"Fri Jul 24 15:11:00 UTC 2020","company":"Thermondo GmbH","company_url":"https://www.thermondo.de/","location":"Berlin","title":"(Senior) Python Developer / Software Engineer (m/f/d)","description":"\u003cp\u003eWir bauen mit Thermondo ein besonderes Unternehmen. Wir sind der klare Innovator und First-Mover in unserem Markt. Wir haben starke Gesellschafter und sind gut finanziert. Wir sind ein dynamisches Startup mit starkem Wachstum. Bei uns findest Du ein tolles Arbeitsumfeld in einer besonderen Unternehmenskultur, in der Dein Talent und Deine Persönlichkeit einen Platz finden. In flachen Strukturen arbeitet bei uns ein aufgeschlossenes und motiviertes Team. Wir sind alle mit Leidenschaft dabei, erwarten dasselbe von Dir und freuen uns auf Deine Unterstützung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe're looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e... a (Senior) Python Developer / Software Engineer (m/f/d) in Berlin who will join our international tech team as soon as possible in creating one of the fastest growing companies in the heating market.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThermondo was founded in 2012 to advance the energy revolution with innovative heating solutions. More than 16,000 heating-system transformations later, we are not only No. 1 in heating system construction, but have also made a lasting difference to the heating market. We are the pioneer and innovation leader in the digitalisation of the trade. The basis for this is the resourceful teamwork of our tech, marketing, sales, development, IT and HR experts. With passion and verve, they fulfill our vision of \u0026lt;2° (less than two degrees).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull time or part time, permanent contract.\u003c/li\u003e\n\u003cli\u003ePlenty of opportunities for new ideas and responsibilities.\u003c/li\u003e\n\u003cli\u003eAny tech equipment you need (Mac/Linux/Windows).\u003c/li\u003e\n\u003cli\u003eFlexible working hours and a professional development environment.\u003c/li\u003e\n\u003cli\u003eThe possibility to work 3 days a week in your mobile office.\u003c/li\u003e\n\u003cli\u003eAn international team, team-building events and 30 days of vacation.\u003c/li\u003e\n\u003cli\u003eYour work has a direct impact on the German energy market.\u003c/li\u003e\n\u003cli\u003eRegular feedback as an integral part of employee development (e. g. paid educational leave, conference budget etc.).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are mainly using Python along with Django or Wagtail connected to PostgreSQL. We also have some JavaScript applications written in Typescript using ReactJS.  You even find some exotic things like LaTeX in our stack.\nMost of our hosting is done on Heroku. We’re trying to make use of a lot of Heroku’s tools like pipelines, backups, buildpacks and some monitoring plugins. We try to keep DevOps work to a minimum since we want to focus on building and shipping functionality. We are using some AWS services like S3.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur Python based backend is the backbone of our Germany wide operation and key to the digitization of the energy business. It’s an enterprise-grade application which connects our own services to third party platforms like Salesforce.\u003c/p\u003e\n\u003cp\u003eOur business is constantly growing and changing. New feature requests or requirement changes may emerge every day. As a result we build software that is highly maintainable to satisfy those needs. Your job will be to work in small teams on independent projects alongside your non technical colleagues. You will analyze our business needs and implement solutions while maintaining a high quality standard and developing at startup speed. You will have the freedom to use any tools and resources to achieve your goals. Our team of more than ten experienced engineers will support you to reach your full potential. For more information visit: \u003ca href=\"http://t3u1.mjt.lu/lnk/AUgAAAf06nMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfGt9gqIsxRLCkSoi9-mTTpiJ8nAAGCXo/2/ou_CfSrhP8Oa6LWPKirzcg/aHR0cHM6Ly90aGVybW9uZG8uZ2l0aHViLmlvLw\"\u003ehttps://thermondo.github.io\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity degree in a technical field, or a comparable qualification\u003c/li\u003e\n\u003cli\u003eRelevant experience in programming and web technology\u003c/li\u003e\n\u003cli\u003eVery good understanding of back-end technologies – Python or JavaScript\u003c/li\u003e\n\u003cli\u003eFamiliar in working with frameworks like Django or Celery\u003c/li\u003e\n\u003cli\u003eExperience with Heroku is a plus\u003c/li\u003e\n\u003cli\u003eKnowledge of version control systems - Git or SVN\u003c/li\u003e\n\u003cli\u003eExperience with agile methodologies - Kanban, Scrum or similar\u003c/li\u003e\n\u003cli\u003eFluency in English. German skills are a plus but not important for this position\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIt's on\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThat's exactly the challenge you're looking for? We look forward to getting to know you!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/4808bade5b7e7e7006ab2c9a5f42c0838053d524/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f62353462646134636437643833616436393032306336663761326161353331373730636261616134376132396365376332363236653234376635393732316663\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/9b36c340c50b432432aa6dfb9a41a8f8b08fbebdecd92c30697015c4b7218e22\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb3d7320d68717a67d97e9e068b6e4449bba9bbe/Thermondo%20GmbH.png"},{"id":"251e10e9-d5c4-44be-8dc5-e30507022af1","type":"Full Time","url":"https://jobs.github.com/positions/251e10e9-d5c4-44be-8dc5-e30507022af1","created_at":"Thu Jul 23 14:55:34 UTC 2020","company":"Phalanx Software Ltd.","company_url":"https://phalanx.software/careers/software-developer","location":"Malta","title":"Software Developer","description":"\u003cp\u003ePhalanx Software are looking for a Software Developer proficient in either \u003cstrong\u003eJava\u003c/strong\u003e or \u003cstrong\u003ePython\u003c/strong\u003e, and with at least\ntwo years of experience in the industry, to join the team.\u003c/p\u003e\n\u003ch3\u003eAt a Glance\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eRole:\u003c/strong\u003e Software Developer\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBasis:\u003c/strong\u003e Full-time\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLanguages:\u003c/strong\u003e Either Java or Python\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eExperiance Required:\u003c/strong\u003e 2 years\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eLocation:\u003c/strong\u003e Remotely but must live in Malta/Gozo\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSalary:\u003c/strong\u003e €30,000 per annum\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eAbout Us\u003c/h3\u003e\n\u003cp\u003ePhalanx Software is a new company, founded in 2019 and based in Malta, specializing in iGaming and enterprise software. Quality and\nprofessionalism are the company’s core values. We aim to build software that solves the complex problems that\nbusinesses face as they transition out of their startup phases and start looking to automate their business processes.\u003c/p\u003e\n\u003cp\u003ePhalanx Software is led by Kyle Pullicino, a software developer with a Masters in Computer Science. Kyle has been working\nin the iGaming and financial services industry for over five years. He has seen how inefficient these enterprises can\nget as they grow and Phalanx Software’s mission is based on tackling these problems widespread throughout the industry.\u003c/p\u003e\n\u003ch3\u003eRequirements\u003c/h3\u003e\n\u003cp\u003eApplicants must:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ebe proficient in either \u003cstrong\u003eJava\u003c/strong\u003e or \u003cstrong\u003ePython\u003c/strong\u003e and their ecosystems;\u003c/li\u003e\n\u003cli\u003ehave been working as a software developer for \u003cstrong\u003eat least two years\u003c/strong\u003e;\u003c/li\u003e\n\u003cli\u003ebe comfortable using \u003cstrong\u003eLinux-based systems\u003c/strong\u003e;\u003c/li\u003e\n\u003cli\u003eunderstand the \u003cstrong\u003eprinciples of good software design\u003c/strong\u003e;\u003c/li\u003e\n\u003cli\u003euse a \u003cstrong\u003epragmatic approach\u003c/strong\u003e when building software;\u003c/li\u003e\n\u003cli\u003ebe \u003cstrong\u003ewilling to learn\u003c/strong\u003e and truly understand the business domains that we work in; and,\u003c/li\u003e\n\u003cli\u003elive in \u003cstrong\u003eMalta or Gozo\u003c/strong\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eThe Role\u003c/h3\u003e\n\u003cp\u003eAs a software developer, the chosen applicant will be responsible for understanding the requirements presented to us by\nour clients, design solutions tackling those problems and then develop, test and deploy the required software\napplications.\u003c/p\u003e\n\u003cp\u003eSince Phalanx Software is a new company, the chosen applicant will also have the unique opportunity of\nhelping the company grow. In particular, they will have a say on the company’s overall software development process, the\ntools that we use and how we conduct our business in general. The chosen applicant will be required to \u003cstrong\u003ework remotely\u003c/strong\u003e\nfrom their home and the company will grant the employee help with setting up their home office.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe budgeted gross salary for this role is of €30,000 per annum and the chosen applicant is expected to work 32 hours\nper week on a full-time basis.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf you fit the bill, we'd love to hear from you! Apply by sending your CV and a short introduction of yourself to\n\u003ca href=\"mailto:careers@phalanx.software\"\u003ecareers@phalanx.software\u003c/a\u003e and we'll get back to you.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b186751a3a37f9a2a06e451fa34d224aa02e2e67/logo.png"},{"id":"31d78905-a0f3-4af8-ac53-4dc40750a8e2","type":"Full Time","url":"https://jobs.github.com/positions/31d78905-a0f3-4af8-ac53-4dc40750a8e2","created_at":"Wed Jul 22 15:39:31 UTC 2020","company":"BCI","company_url":"https://www.bci.ca/","location":"Victoria","title":"Senior Data Scientist","description":"\u003cp\u003eDEPARTMENT DESCRIPTION\u003c/p\u003e\n\u003cp\u003eThe Technology department is responsible for developing technology solutions that contribute to the achievement of BCI’s mission and long-term goals. The department manages the Corporation’s business applications and information technology infrastructure, providing support to a large group of financial professionals. The department is also responsible for authoring technology-related directives and conducting disaster recovery planning to minimize risk to the Corporation’s delivery of investment services.\u003c/p\u003e\n\u003cp\u003eThe Data \u0026amp; Analytics function is responsible for the governance, architecture and engineering of BCI’s data assets. It also provides reporting, insights and data science capabilities to its customers.\u003c/p\u003e\n\u003cp\u003ePOSITION DESCRIPTION\u003c/p\u003e\n\u003cp\u003eReporting to the Director, Data \u0026amp; Analytics, the Senior Data Scientist is responsible for transforming the organization’s data into critical information and insights that support organizational performance.\u003c/p\u003e\n\u003cp\u003eThe Senior Data Scientist will develop and implement advanced analytical models to identify patterns, trends and opportunities that drive business outcomes. Working closely with internal Technology and business area stakeholders, s/he will facilitate the communication and adoption of data-driven decision making, and contributes to a strong data and analytics competency for BCI.\u003c/p\u003e\n\u003cp\u003eThe position can be based in either Vancouver or Victoria with travel between the two cities.\u003c/p\u003e\n\u003cp\u003eQUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eMUST HAVE:\u003c/p\u003e\n\u003cp\u003e•Master’s Degree in Data Science, Statistics, Mathematics, Computer Science or a related discipline\u003c/p\u003e\n\u003cp\u003e•A minimum of 5 years of experience as a Data Scientist or Data Analytics professional\u003c/p\u003e\n\u003cp\u003e•Coding skills and deep proficiency with SQL, Python, R etc.\u003c/p\u003e\n\u003cp\u003e•Competence at manipulating and analyzing complex, high-volume, high-dimensional data from varying sources\u003c/p\u003e\n\u003cp\u003e•A flexible analytic approach that allows for results at varying levels of precision\u003c/p\u003e\n\u003cp\u003e•Experience with version control systems (i.e. Git)\u003c/p\u003e\n\u003cp\u003e•Demonstrated statistical, machine learning and other data science skills and capability for delivering effective modeling and analytics results\u003c/p\u003e\n\u003cp\u003e•Must have excellent listening, communication, collaboration and problem-solving skills\u003c/p\u003e\n\u003cp\u003e•Ability to understand business problems and bridge the gap between data analysis results and meaningful business insights\u003c/p\u003e\n\u003cp\u003ePREFERRED:\u003c/p\u003e\n\u003cp\u003e•Knowledge of the investment management industry\u003c/p\u003e\n\u003cp\u003ePRIMARY RESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003e•Collaborates with team members, other IT teams, and customers to understand the organization’s business objectives, decisions and data in order to build the most effective analytical models\u003c/p\u003e\n\u003cp\u003e•Uses statistical and mathematical techniques to undertake analysis including forecasting, segmentation and predictive modelling\u003c/p\u003e\n\u003cp\u003e•Applies current and emerging techniques in deep learning, natural language processing and other machine learning areas\u003c/p\u003e\n\u003cp\u003e•Designs, develops and conducts data science experiments and communicates the results to foster data and analytics literacy and adoption\u003c/p\u003e\n\u003cp\u003e•Designs, develops and implements cloud-based AI and machine learning production pipelines\u003c/p\u003e\n\u003cp\u003e•Ensures AI and machine learning production pipelines are scalable, repeatable and secure\u003c/p\u003e\n\u003cp\u003e•Integrates structured and unstructured data from multiple sources for use in models and products\u003c/p\u003e\n\u003cp\u003e•Collects, cleans, manages, analyzes and visualizes large sets of data using multiple data platforms, tools and techniques\u003c/p\u003e\n\u003cp\u003e•Leads other internal resources on ad-hoc data and analytics requests, investigations, pilot studies, proofs of concept, and projects\u003c/p\u003e\n\u003cp\u003e•Enhances data collection procedures to include information that is relevant to building advanced analytical models and provides input to other internal resources on the applications, databases and systems used to assess data quality\u003c/p\u003e\n\u003cp\u003e•Communicates data science complexities in plain language to technical and non-technical audiences and develops reports and presentations\u003c/p\u003e\n\u003cp\u003e•Keeps up to date with the latest technology trends and methods by staying abreast of state-of-the-art literature in the fields of deep learning, operations research, machine learning, statistical modeling, statistical process control and mathematical optimization\u003c/p\u003e\n\u003cp\u003e•Identifies issues and risks, develops action plans, and takes corrective actions as needed\u003c/p\u003e\n\u003cp\u003e•Undertakes special projects or assignments as required\u003c/p\u003e\n\u003cp\u003e•Performs other related duties as required\u003c/p\u003e\n\u003cp\u003eCOMPETENCIES\u003c/p\u003e\n\u003cp\u003eLearning Agility\u003c/p\u003e\n\u003cp\u003eEffective performers continuously seek new knowledge. They are curious and want to know “why”. They learn quickly and use new information effectively. They create and foster a culture of interest, curiosity, and learning.\u003c/p\u003e\n\u003cp\u003eRelationship Building\u003c/p\u003e\n\u003cp\u003eEffective performers establish and proactively maintain a broad network of relationships (e.g. colleagues, co-workers, vendors, suppliers, etc.). They value these relationships and work effectively across the organization by maintaining positive working relationships with peers and others.\u003c/p\u003e\n\u003cp\u003eHigh Standards\u003c/p\u003e\n\u003cp\u003eEffective performers possess a high inner work standard and shows pride in their work.  They consistently strive to ensure work is complete within deadlines and that all work performed is of a high quality.\u003c/p\u003e\n\u003cp\u003eOrganization \u0026amp; Planning\u003c/p\u003e\n\u003cp\u003eEffective performers have strong organizing and planning skills that allow them to be highly productive and efficient. They manage their time wisely and effectively prioritize multiple competing tasks. They follow through on tasks to ensure changes in technology are communicated effectively.\u003c/p\u003e\n\u003cp\u003eResults Orientation\u003c/p\u003e\n\u003cp\u003eEffective performers maintain appropriate focus on outcomes and accomplishments. They are motivated by achievement, and persist until the goal is reached. They convey a sense of urgency to make things happen. They respect the need to balance short- and long-term goals. They are driven by a need for closure.\u003c/p\u003e\n\u003cp\u003eCommunicativeness\u003c/p\u003e\n\u003cp\u003eEffective performers clearly and articulately convey technical and other information both orally and in writing to others in a manner appropriate to the listener. They write clearly, accurately and concisely, composing project, technical and other required documentation as required.\u003c/p\u003e\n\u003cp\u003eChange Mastery\u003c/p\u003e\n\u003cp\u003eEffective performers are adaptable. They embrace needed change and modify their behaviour when appropriate to achieve organizational objectives. They are effective in the face of ambiguity. They understand and use change management techniques to help ensure smooth transitions.\u003c/p\u003e\n\u003cp\u003eBusiness Thinking\u003c/p\u003e\n\u003cp\u003eEffective performers see the organization as a series of integrated and interlocking business processes. They understand how their work connects with and affects other areas of the organization.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eVisit BCI's career page:\u003ca href=\"https://www.bci.ca/careers/\"\u003ehttps://www.bci.ca/careers/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--77a7a7d3583c6e44e42bfc9bb4819565474f7b18/bci-logo%20PNG.png"},{"id":"ad9cf29c-4e40-4422-b615-bd4870d1f477","type":"Full Time","url":"https://jobs.github.com/positions/ad9cf29c-4e40-4422-b615-bd4870d1f477","created_at":"Wed Jul 22 15:35:06 UTC 2020","company":"BCI","company_url":"https://www.bci.ca/","location":"Victoria","title":"Senior Data Engineer","description":"\u003cp\u003eDEPARTMENT DESCRIPTION\u003c/p\u003e\n\u003cp\u003eThe Technology department is responsible for developing technology solutions that contribute to the achievement of BCI’s mission and long-term goals. The department manages the Corporation’s business applications and information technology infrastructure, providing support to a large group of financial professionals. The department is also responsible for authoring technology-related directives and conducting disaster recovery planning to minimize risk to the Corporation’s delivery of investment services.\u003c/p\u003e\n\u003cp\u003eThe Data \u0026amp; Analytics function is responsible for the governance, architecture and engineering of BCI’s data assets. It also provides reporting, insights and data science capabilities to its customers.\u003c/p\u003e\n\u003cp\u003ePOSITION DESCRIPTION\u003c/p\u003e\n\u003cp\u003eReporting to the Director, Data \u0026amp; Analytics, the Senior Data Engineer is responsible for the design, development and implementation of the data and analytics products and projects that enable data science efforts in the organization.\u003c/p\u003e\n\u003cp\u003eThe Senior Data Engineer will deliver business value to multiple business areas across the organization and works closely with internal Technology and business area stakeholders. S/he will drive data modernization and innovation, and contributes to a strong data and analytics competency for BCI.\u003c/p\u003e\n\u003cp\u003eThe position can be based in either Vancouver or Victoria with travel between the two cities.\u003c/p\u003e\n\u003cp\u003eQUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eMUST HAVE:\n•Bachelor’s Degree in Technology, Computer Science, Mathematics or a related discipline\u003c/p\u003e\n\u003cp\u003e•A minimum of 5 years of experience as a Data Engineer or Software Engineer professional\u003c/p\u003e\n\u003cp\u003e•Experience with data warehouse and data lake design, development and sustainment\u003c/p\u003e\n\u003cp\u003e•Coding skills and deep proficiency with SQL, Python, etc.\u003c/p\u003e\n\u003cp\u003e•Competent with general scripting/software development\u003c/p\u003e\n\u003cp\u003e•Understanding of data processing performance concerns and issues (configuring database server/data schema for performance, optimizing SQL)\u003c/p\u003e\n\u003cp\u003e•Experience with reporting tools (e.g. Excel, Power BI, Tableau)\u003c/p\u003e\n\u003cp\u003e•Experience with version control systems (e.g. Git)\u003c/p\u003e\n\u003cp\u003e•Experience with cloud platforms\u003c/p\u003e\n\u003cp\u003e•Strong knowledge of data modeling, data architecture and data structures\u003c/p\u003e\n\u003cp\u003e•Strong understanding Agile and DevOps, including CI/CD technologies and practices\u003c/p\u003e\n\u003cp\u003e•Excellent listening, communication, collaboration and problem-solving skills\u003c/p\u003e\n\u003cp\u003ePREFERRED:\u003c/p\u003e\n\u003cp\u003e•Knowledge of the investment management industry\u003c/p\u003e\n\u003cp\u003ePRIMARY RESPONSIBILITIES\u003c/p\u003e\n\u003cp\u003e•Collaborates with team members, other IT teams, and customers to understand the organization’s business objectives, data needs and infrastructure needs\u003c/p\u003e\n\u003cp\u003e•Provides technical leadership and creates a culture of customer-centricity, accountability and high performance\u003c/p\u003e\n\u003cp\u003e•Designs, develops and implements the data pipelines and ETL tools and workflows that enable data science efforts within the organization\u003c/p\u003e\n\u003cp\u003e•Works with Data Architects and Data Scientists on the design, development and implementation of operational, transactional and analytical modeling\u003c/p\u003e\n\u003cp\u003e•Proactively identifies risks and issues and proposes solutions to remove barriers\u003c/p\u003e\n\u003cp\u003e•Applies knowledge of DevOps practices including continuous deployment, continuous integration, test-driven development and automated testing\u003c/p\u003e\n\u003cp\u003e•Mentors junior engineers, follows best practices, performs code reviews and architects resilient infrastructure\u003c/p\u003e\n\u003cp\u003e•Solves challenging problems about scale, statistics, infrastructure reliability, latency and more\u003c/p\u003e\n\u003cp\u003e•Leads data mining and collections procedures\u003c/p\u003e\n\u003cp\u003e•Robustly sources, structures, profiles, validates and transforms data for reporting, analysis and data science purposes\u003c/p\u003e\n\u003cp\u003e•Engages with stakeholders to define, design and deliver data sourcing, analysis and reporting solutions\u003c/p\u003e\n\u003cp\u003e•Makes recommendations about the methods used to collect, analyse and manage structured and unstructured data to drive outcomes\u003c/p\u003e\n\u003cp\u003e•Develops solutions (and code) to automate and productionize data sourcing, data structuring and analytical modelling\u003c/p\u003e\n\u003cp\u003e•Analyzes data sources, evaluating and remediating data quality, designing and implementing data sets that can be consumed and re-used by the analytics community across BCI\u003c/p\u003e\n\u003cp\u003e•Helping the business interpret the results of analyses to determine the appropriate course of action\u003c/p\u003e\n\u003cp\u003e•Proactively identifies opportunities to utilize data and analytics to business advantage and prototyping for ‘proof of value’\u003c/p\u003e\n\u003cp\u003e•Assists in troubleshooting and guiding resolution of data analytics related problems in a timely and accurate fashion\u003c/p\u003e\n\u003cp\u003e•Undertakes special projects or assignments as required\u003c/p\u003e\n\u003cp\u003e•Performs other related duties as required\u003c/p\u003e\n\u003cp\u003eCOMPETENCIES\u003c/p\u003e\n\u003cp\u003eLearning Agility\u003c/p\u003e\n\u003cp\u003eEffective performers continuously seek new knowledge. They are curious and want to know “why”. They learn quickly and use new information effectively. They create and foster a culture of interest, curiosity, and learning.\u003c/p\u003e\n\u003cp\u003eRelationship Building\u003c/p\u003e\n\u003cp\u003eEffective performers establish and proactively maintain a broad network of relationships (e.g. colleagues, co-workers, vendors, suppliers, etc.). They value these relationships and work effectively across the organization by maintaining positive working relationships with peers and others.\u003c/p\u003e\n\u003cp\u003eHigh Standards\u003c/p\u003e\n\u003cp\u003eEffective performers possess a high inner work standard and shows pride in their work.  They consistently strive to ensure work is complete within deadlines and that all work performed is of a high quality.\u003c/p\u003e\n\u003cp\u003eOrganization \u0026amp; Planning\u003c/p\u003e\n\u003cp\u003eEffective performers have strong organizing and planning skills that allow them to be highly productive and efficient. They manage their time wisely and effectively prioritize multiple competing tasks. They follow through on tasks to ensure changes in technology are communicated effectively.\u003c/p\u003e\n\u003cp\u003eResults Orientation\u003c/p\u003e\n\u003cp\u003eEffective performers maintain appropriate focus on outcomes and accomplishments. They are motivated by achievement, and persist until the goal is reached. They convey a sense of urgency to make things happen. They respect the need to balance short- and long-term goals. They are driven by a need for closure.\u003c/p\u003e\n\u003cp\u003eCommunicativeness\u003c/p\u003e\n\u003cp\u003eEffective performers clearly and articulately convey technical and other information both orally and in writing to others in a manner appropriate to the listener. They write clearly, accurately and concisely, composing project, technical and other required documentation as required.\u003c/p\u003e\n\u003cp\u003eChange Mastery\u003c/p\u003e\n\u003cp\u003eEffective performers are adaptable. They embrace needed change and modify their behaviour when appropriate to achieve organizational objectives. They are effective in the face of ambiguity. They understand and use change management techniques to help ensure smooth transitions.\u003c/p\u003e\n\u003cp\u003eBusiness Thinking\u003c/p\u003e\n\u003cp\u003eEffective performers see the organization as a series of integrated and interlocking business processes. They understand how their work connects with and affects other areas of the organization.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eVisit BCI's career page: \u003ca href=\"https://www.bci.ca/careers/\"\u003ehttps://www.bci.ca/careers/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--91d1fca4128cb985005e3e5a9b28cb7cacdfd2ad/bci-logo%20PNG.png"},{"id":"58571cae-9714-49a9-a3a9-f72c1c99cff6","type":"Full Time","url":"https://jobs.github.com/positions/58571cae-9714-49a9-a3a9-f72c1c99cff6","created_at":"Wed Jul 22 08:25:01 UTC 2020","company":"International NGO Safety Organisation","company_url":"http://www.ngosafety.org","location":"The Hague, The Netherlands","title":"Full Stack Developer","description":"\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eFull-Stack Developer\u003c/p\u003e\n\u003cp\u003eThe Hague, Netherlands\u003c/p\u003e\n\u003cp\u003eOrganisation Background\u003c/p\u003e\n\u003cp\u003eThe International NGO Safety Organisation (INSO) is an international charity that supports the safety of aid workers by establishing safety coordination platforms in insecure contexts. INSO provides registered NGOs with a range of free services including real-time incident tracking, analytical reports, safety related data and mapping, crisis management support, staff orientations and training.\u003c/p\u003e\n\u003cp\u003eINSO services help NGOs with their day-to-day risk management responsibilities and improve their overall situational awareness to support evidence-based humanitarian access decisions.\u003c/p\u003e\n\u003cp\u003eFounded in 2011, the International NGO Safety Organisation has grown from innovative start-up to become a globally recognised charity and a highly valued component in the humanitarian safety coordination system. With operations in 14 countries, INSO has revolutionized the humanitarian safety coordination sector by introducing a robust and high-quality field safety platform model that has been deployed in some of the world’s most high-risk settings.\u003c/p\u003e\n\u003cp\u003eThe strong focus on humanitarian principles and exclusive NGO-only membership criteria have meant that INSO is now accepted as a standard component of modern humanitarian response offering independent frontline reporting and coordination services that save lives, strengthen operational practice and enable humanitarian access\u003c/p\u003e\n\u003cp\u003eToday the organisation provides daily support to more than 1000 NGOs in 14 of the world’s most insecure countries and has earned a strong reputation for performance, principles \u0026amp; professionalism.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cp\u003eINSO is seeking an experienced and talented individual to join our team in The Hague (Netherlands) as a Full-Stack Developer. The tentative start date for this position is 1st October 2020. However, due to travel restrictions related to the COVID-19 pandemic, the starting date may be delayed.\u003c/p\u003e\n\u003cp\u003eThe Developer will be responsible for providing substantial assistance in the design, implementation and maintenance of INSO’s Conflict \u0026amp; Humanitarian Data Centre. The system will be used in contexts where internet bandwidth is very limited or non-existent. User roles will be defined with different permissions that require interaction with each other across multiple countries. He/She will help develop the data entry and incident analysis phases of the application with the guidance of the Senior Developer. Furthermore, He/She will provide substantial programming assistance in further development and troubleshooting of INSO’s partner and service distribution portal as well as the creation of a new organizational website.\u003c/p\u003e\n\u003cp\u003eINSO’s Development Stack:\u003c/p\u003e\n\u003cp\u003eFrontend:\u003c/p\u003e\n\u003cp\u003e· Angular 8+ with Typescript\u003c/p\u003e\n\u003cp\u003e· Electron Framework (client app) and Service/Web Workers (offline web app)\u003c/p\u003e\n\u003cp\u003e· Visualization development using D3 library and JQuery\u003c/p\u003e\n\u003cp\u003e· Data storage and synchronization using Indexed DB and PouchDB\u003c/p\u003e\n\u003cp\u003e· Google Maps, OpenStreetMap, and PowerBI integration\u003c/p\u003e\n\u003cp\u003e· HTML5 with SCSS preprocessor\u003c/p\u003e\n\u003cp\u003e· OpenID Implicit Flow authentication\u003c/p\u003e\n\u003cp\u003e· i18n localization English/French\u003c/p\u003e\n\u003cp\u003e· Testing using Jasmine/Karma\u003c/p\u003e\n\u003cp\u003e· DevOps using Webpack and Docker containers\u003c/p\u003e\n\u003cp\u003eBackend:\u003c/p\u003e\n\u003cp\u003e· Node.js with Express.js framework\u003c/p\u003e\n\u003cp\u003e· Session caching using Redis\u003c/p\u003e\n\u003cp\u003e· OAuth and JWT authentication with Azure AD\u003c/p\u003e\n\u003cp\u003e· Java Spring (boot) with Maven using Apache Tomcat\u003c/p\u003e\n\u003cp\u003e· Clustering with multiple Apache CouchDB NoSQL nodes\u003c/p\u003e\n\u003cp\u003e· NRT Indexing with Apache Solr 8+ using Zookeeper\u003c/p\u003e\n\u003cp\u003e· Docker orchestration using Kubernetes\u003c/p\u003e\n\u003cp\u003e· MS SQL Server replication for 3rd party connections\u003c/p\u003e\n\u003cp\u003e· PHP with Codeigniter using Nginx\u003c/p\u003e\n\u003cp\u003e· Azure MySQL Server\u003c/p\u003e\n\u003cp\u003e· Communication with Twilio, SendGrid and BulkSMS\u003c/p\u003e\n\u003cp\u003e· Azure Serverless Functions with Queue processing\u003c/p\u003e\n\u003cp\u003e· Maintenance and scheduled tasks using cron and Bash\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eApplicants should have experience in the following:\u003c/p\u003e\n\u003cp\u003e· Strong understanding of data modeling and storage with both NoSQL and relational DBs\u003c/p\u003e\n\u003cp\u003e· Experience with RESTful APIs\u003c/p\u003e\n\u003cp\u003e· Knowledge of modern web and client development with distributed system architectures\u003c/p\u003e\n\u003cp\u003e· Familiarity with Azure and Active Directory, VM server management, DNS, and SSL techniques\u003c/p\u003e\n\u003cp\u003e· UI/UX design and organization\u003c/p\u003e\n\u003cp\u003e· Experience in “big data” processing and analysis with dynamic visualizations\u003c/p\u003e\n\u003cp\u003e· Paramount attention to detail in application and data security\u003c/p\u003e\n\u003cp\u003e· Solid understanding of performance testing, deployment strategies, and DevOps\u003c/p\u003e\n\u003cp\u003e· The ability to learn quickly and use innovative technologies\u003c/p\u003e\n\u003cp\u003e· Be a conscientious team worker who meets commitments and deadlines and takes pride in being reliable within a multi-cultural team across different time zones\u003c/p\u003e\n\u003cp\u003e· Outstanding communication skills in English\u003c/p\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cp\u003e· Communication skills in French\u003c/p\u003e\n\u003cp\u003e· Knowledge of Python\u003c/p\u003e\n\u003cp\u003e· Prior humanitarian or NGO experience\u003c/p\u003e\n\u003cp\u003e· Contributed to relevant open source projects or impressive portfolio\u003c/p\u003e\n\u003cp\u003e· Prior work in computer graphics with SVG web technologies\u003c/p\u003e\n\u003cp\u003eINSO’s Safeguarding Policy:\u003c/p\u003e\n\u003cp\u003eINSO is fully committed to safe recruitment, selection and vetting of all potential new staff, trustees and volunteers and we will ensure rigorous compliance with our Code of Conduct and Safeguarding policy throughout the recruitment process. As such, the following safe recruitment practices will be applied:\u003c/p\u003e\n\u003cp\u003e· All offers of employment will be conditional on receiving at least two satisfactory professional references.\u003c/p\u003e\n\u003cp\u003e· INSO will ask candidates about significant gaps in employment history or frequent changes of employer and address.\u003c/p\u003e\n\u003cp\u003e· All essential qualifications and relevant professional accreditations and memberships will be verified.\u003c/p\u003e\n\u003cp\u003e· The successful candidate will be required to provide a valid proof of identity (passport, ID card).\u003c/p\u003e\n\u003cp\u003e· All new hires will receive an orientation in INSO’s safeguarding policy and procedures and associated documents (Code of Conduct, Whistleblowing etc.).\u003c/p\u003e\n\u003cp\u003e· All new hires will be required to sign and abide by the Code of Conduct as a condition of employment.\u003c/p\u003e\n\u003cp\u003eTerms \u0026amp; Conditions: 1 year contract with an expected start date on 1 October in the Hague, Netherlands, €4750 per month salary, 8% vacation pay and 2.5 days annual leave per month.\u003c/p\u003e\n\u003cp\u003eHow to apply:\u003c/p\u003e\n\u003cp\u003eInterested applicants are requested to send the following and reference “INSO Developer 2020” in the subject line of the email. Only shortlisted candidates will be contacted.\u003c/p\u003e\n\u003cp\u003e· Updated CV (5 page maximum).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA cover letter explaining your motivation and interest in the position.\n· Any relevant software project samples as links or documents (optional)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease do not send any additional information (such as copies of certificates, copies of diplomas, other writing samples, etc.) and keep the total size of your application under 8MB if possible.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eInterested applicants are requested to send an email to \u003ca href=\"mailto:jobs@oso.ngosafety.org\"\u003ejobs@oso.ngosafety.org\u003c/a\u003e with reference “INSO Developer 2020” in the subject line and the following information as attachments:\u003c/p\u003e\n\u003cp\u003e· Updated CV (5 page maximum).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA cover letter explaining your motivation and interest in the position.\n· Any relevant software project samples as links or documents (optional)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease do not send any additional information (such as copies of certificates, copies of diplomas, other writing samples, etc.) and keep the total size of your application under 8MB if possible. Only shortlisted candidates will be contacted.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbldHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7bf93355fc5eb32a7614acb59204ae87ba0bab01/INSO_low%20res.jpg"},{"id":"ffc80f47-9f87-4fe1-9ba3-588152c2db5a","type":"Full Time","url":"https://jobs.github.com/positions/ffc80f47-9f87-4fe1-9ba3-588152c2db5a","created_at":"Wed Jul 22 04:13:43 UTC 2020","company":"RebelMouse","company_url":"https://www.rebelmouse.com","location":"worldwide","title":"Senior Fullstack Engineer","description":"\u003cp\u003eHere are some key items to consider:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorkflow and processes are one of the most important things in development\u003c/li\u003e\n\u003cli\u003eCertifications is the one of the most important things and I have them all\u003c/li\u003e\n\u003cli\u003eI like to join any technical discussions even those w/o real outcome for a product\u003c/li\u003e\n\u003cli\u003eI used to change companies a lot\u003c/li\u003e\n\u003cli\u003eI like tech-stack superiority wars, I always win (obviously)\u003c/li\u003e\n\u003cli\u003eI think I’m the smartest person in the company and everybody should be grateful for having a chance to work with me\u003c/li\u003e\n\u003cli\u003eI would put architecture in the first place above the product, common sense and everything else, period!\u003c/li\u003e\n\u003cli\u003eI find it very stressful when somebody touches my code\u003c/li\u003e\n\u003cli\u003eI like to write long emails describing my vision to everybody\u003c/li\u003e\n\u003cli\u003eI value boring but stable work environment over the opportunity to grow\u003c/li\u003e\n\u003cli\u003eI don’t believe management can understand my vision that is why I gave up sharing it\u003c/li\u003e\n\u003cli\u003eBeing small gear in an enterprise mechanism is what I like\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFor good or bad we don’t have any of these, here is what we have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnvironment of open minded people focused on solving real world problems-\u003c/li\u003e\n\u003cli\u003eTeam that values every member\u003c/li\u003e\n\u003cli\u003e“Complex over complicated”\u003c/li\u003e\n\u003cli\u003eCreating the best product possible that moves the needle and brings innovations to live\u003c/li\u003e\n\u003cli\u003eWe proud of how we do things but even more about what we do\u003c/li\u003e\n\u003cli\u003eNo finger pointing and blaming except for git blaming :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExciting part: Our product gives an opportunity to more than 100 enterprise clients to focus on things that matters for them and not technology behind it! At the moment total monthly audience is 90M. That means it's always going to be an opportunity to help somebody out there by building new things.\u003c/p\u003e\n\u003cp\u003eOur applications are build with Python, JavaScript (es6+), variety of frameworks as well as vanilla, Node.js, MongoDB, Redis, MySQL, Memcached Our product is cloud-native and relies on services provided by AWS. We make sure that the platform is robust and reliable enough to cover the needs of every single customer. EC2, Kubernetes - sounds familiar? We also use Docker, Istio, Prometheus, Grafana and some other fancy stuff\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRequirements\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGood grasp of functional and/or OOP design\u003c/li\u003e\n\u003cli\u003eStrong experience with Python/NodeJS\u003c/li\u003e\n\u003cli\u003eUnderstanding networking (http, tcp etc., as well as async io)\u003c/li\u003e\n\u003cli\u003eFrontend and backend performance optimizations\u003c/li\u003e\n\u003cli\u003ePositive attitude :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs a good plus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eexperience with ReactJS\u003c/li\u003e\n\u003cli\u003eperformance optimization for MongoDB, Redis and MySQL\u003c/li\u003e\n\u003cli\u003eexperience with microservices concepts\u003c/li\u003e\n\u003cli\u003eDevOps skills\u003c/li\u003e\n\u003cli\u003ebasic HTML/CSS knowledge\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease apply on \u003ca href=\"https://careers.rebelmouse.com/o/senior-fullstack-engineer\"\u003ehttps://careers.rebelmouse.com/o/senior-fullstack-engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--391a8eb2ecb75e0021fcdbee8a136b6e4797f782/btn4.png"},{"id":"aab1f50a-a7b3-4896-99c0-89e9cd9f3ea7","type":"Full Time","url":"https://jobs.github.com/positions/aab1f50a-a7b3-4896-99c0-89e9cd9f3ea7","created_at":"Tue Jul 21 11:51:30 UTC 2020","company":"Avrios International AG","company_url":"https://www.avrios.com/","location":"Berlin","title":"Full Stack Engineer (f/m/x)","description":"\u003cp\u003eFounded in 2015 by a team of serial entrepreneurs, Avrios has been building an award-winning solution for mobility management and is one of the fastest growing SaaS companies in Europe. Our platform helps companies provide tailored transportation to employees, enabling them to attract top talent while keeping transportation expenses and CO₂ emissions under control. Fueled by a passionate team composed of more than 20 nationalities, Avrios continues its growth journey of putting mobility within everyone's reach and building the mobility platform of the future.\u003c/p\u003e\n\u003cp\u003eWe are looking for \u003cstrong\u003eFull Stack Engineers\u003c/strong\u003e to join our cross-functional distributed product team that works with a dual-track agile process, to help us:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinue to quickly validate product ideas and ship working software that our customers love.\u003c/li\u003e\n\u003cli\u003eBuild customer-facing features using Angular, TypeScript, Sass and Webpack.\u003c/li\u003e\n\u003cli\u003eBuild scalable backend services, data pipelines and APIs using Amazon Web Services.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRe-imagining how our customers can engage with suppliers in the fleet industry, handling all transactions through our marketplace platform.\u003c/li\u003e\n\u003cli\u003eMaking it possible for customers on our free tier to be completely self-serviced, by automating all processes and nurturing them to be engaged customers of our product.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat you bring:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 2 years of experience as a full stack engineer.\u003c/li\u003e\n\u003cli\u003eYou can write client-side JavaScript or TypeScript using modern language features.\u003c/li\u003e\n\u003cli\u003eYou have some familiarity with Angular or are excited to learn it.\u003c/li\u003e\n\u003cli\u003eYou have experience with a backend language of choice (e.g. Java, Python, Go etc.)\u003c/li\u003e\n\u003cli\u003eDesired: Professional experience on a cross-functional product team and exposure to architectural patterns of high-scale web applications.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eWho we are looking for:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an exceptionally talented software engineer.\u003c/li\u003e\n\u003cli\u003eYou are passionate about building world-class experiences that delight our customers.\u003c/li\u003e\n\u003cli\u003eYou're proud of the code you write, but you're also pragmatic.\u003c/li\u003e\n\u003cli\u003eYou're focused, driven and can get projects across the finish line.\u003c/li\u003e\n\u003cli\u003eYou have experience running apps in production.\u003c/li\u003e\n\u003cli\u003eYou're empathetic, humble and love to help your teammates grow.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive compensation and a generous education budget\u003c/li\u003e\n\u003cli\u003eClear team objectives within a product-led company.\u003c/li\u003e\n\u003cli\u003eThe ability to influence and define what you’re building within those objectives.\u003c/li\u003e\n\u003cli\u003eA welcoming and collaborative environment with a passionate and diverse team.\u003c/li\u003e\n\u003cli\u003eA modern remote working culture that cares about results not hours spent\u003c/li\u003e\n\u003cli\u003eUse of a co-working in space in the heart of Berlin\u003c/li\u003e\n\u003cli\u003eWe encourage you to apply if this role excites you - even if you think you may not meet all requirements listed above.\u003c/li\u003e\n\u003cli\u003eWe don't accept CVs from recruitment agencies, all sent agency CVs will be treated as direct applicants\u003c/li\u003e\n\u003cli\u003eRemote candidates living in Germany are encouraged to apply\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://avrios.join.com/jobs/1212097-full-stack-engineer-f-m-x-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bberlin\"\u003ehttps://avrios.join.com/jobs/1212097-full-stack-engineer-f-m-x-berlin?pid=357a3b4531918760973f\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bengineer%2Bf%2Bm%2Bx%2B-%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--35a9227a9d049f25683ab8a77a89690e007b7ae4/Avrios-logo-new.png"},{"id":"b4bbe809-efe3-4ef1-bba1-ab0c43daef15","type":"Full Time","url":"https://jobs.github.com/positions/b4bbe809-efe3-4ef1-bba1-ab0c43daef15","created_at":"Mon Jul 20 12:54:26 UTC 2020","company":"Subscale","company_url":"http://Subscale.io","location":"Remote","title":"Backend Software Engineer","description":"\u003cp\u003eSubscale is a well-funded remote-first startup reinventing rapid manufacturing of precision parts. Here you will solve challenging problems that have never been solved before, with the autonomy to use whatever methods you think best.\u003c/p\u003e\n\u003cp\u003eSubscale’s intelligent automation uses machine learning and physics simulation to provide close tolerances and rapid turnaround at low production costs.\u003c/p\u003e\n\u003cp\u003eAs a Back-End Engineer at Subscale, you will be working with a talented and experienced multi-disciplinary team to bring our technology to market. You’ll have a wide breadth of responsibilities, such as:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesigning and integrating backends for various customer-facing web services\u003c/li\u003e\n\u003cli\u003eExpanding our factory management system while retaining robust failure-recovery\u003c/li\u003e\n\u003cli\u003eBuilding pipelines for high-scale telemetry, analytics, calibration, and metrology data\u003c/li\u003e\n\u003cli\u003eAutomating and Integrating various CAD/CAM processing tools into a unified system\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe job will grow and change throughout the product life-cycle so it’s essential that you have a self-starting attitude and are quick to learn new skills and adapt as requirements evolve.\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building complex web APIs from scratch using a python web framework\u003c/li\u003e\n\u003cli\u003eComfortable designing comprehensive database schemas for complex systems\u003c/li\u003e\n\u003cli\u003eExperience with Docker, cloud providers, and deployment infrastructure\u003c/li\u003e\n\u003cli\u003eSolid coding practices including unit testing, code reviews, and CI/CD\u003c/li\u003e\n\u003cli\u003ePassion for building new products in a fast-paced team-oriented environment\u003c/li\u003e\n\u003cli\u003eExcellent, proactive communication skills (critical since we are remote-first)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePreferred:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSome familiarity with React and basic frontend development\u003c/li\u003e\n\u003cli\u003eExperience with a systems language like C, C++, or Rust\u003c/li\u003e\n\u003cli\u003eExperience with FEA software or other physics-based simulation\u003c/li\u003e\n\u003cli\u003eExperience working with 3D data structures such as point clouds, meshes, or B-rep data\u003c/li\u003e\n\u003cli\u003eExperience/interest in applying machine learning to structured and unstructured data\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePerks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eHealthcare\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork From Anywhere\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePTO\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume and GitHub link to \u003ca href=\"mailto:jobs@subscale.io\"\u003ejobs@subscale.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaytHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4ba68161dc1b934f9303bd6a250efe0e4dae5a9d/logo%202.png"},{"id":"14f9032c-6559-4b1a-aad8-fd52f6618931","type":"Full Time","url":"https://jobs.github.com/positions/14f9032c-6559-4b1a-aad8-fd52f6618931","created_at":"Sat Jul 18 00:24:59 UTC 2020","company":"www.strategybox.com","company_url":"http://www.strategybox.com","location":"Vancouver","title":"Front End Developer","description":"\u003cp\u003eDo you find yourself looking at apps and noting how they've used negative space poorly?\u003c/p\u003e\n\u003cp\u003eWant to work with an engaged group of people who are interested in seeing you stretch yourself, deepen your craft and have fun?\u003c/p\u003e\n\u003cp\u003eStrategyBox is venture-backed platform, growing 300% month-over-month, making it easy to understand how marketing drives sales. Then using ML to recommend what to do next to drive up sales. We’re looking for a Front-End Developer to revamp our Dashboards and User Platform.\u003c/p\u003e\n\u003cp\u003eYou’d be working with a team that’s spent 10+ years leading marketing attribution for the likes of Dell and Mediacom, love to laugh and build things that work really well and help our customers grow.\u003c/p\u003e\n\u003cp\u003eWe want you to be 92 years old, looking back at your life and saying \"I did the most fulfilling work of my career at StrategyBox. I'm still in touch with people I met there today.\"\u003c/p\u003e\n\u003cp\u003eAbout StrategyBox\u003c/p\u003e\n\u003cp\u003eStrategyBox is a marketing analytics suite that puts marketing and customer data in one spot. Benchmarks performance against competitors and calculates Influencer ROI. Then recommends what to do next to drive up results.\u003c/p\u003e\n\u003cp\u003eWe are well capitalized with a sustainable, scalable business model. Our Leadership Team's ambition is a global business that runs like a Swiss watch. So we can run far, and fast, together.\u003c/p\u003e\n\u003cp\u003eWhy Work for Us\u003c/p\u003e\n\u003cp\u003eWe're an organization where 'A Players' do the best work of their careers. Think NASA in the late 60's, Mid-90's Chicago Bulls or Tom Ford-era Gucci.\u003c/p\u003e\n\u003cp\u003eWe do this by giving you the field of play, the rules of the game and clear goals.\u003c/p\u003e\n\u003cp\u003eWhether that's Accounts Payable or Database Engineering you bring your full Self to work every day to execute to your fullest potential.\u003c/p\u003e\n\u003cp\u003eOur promise to you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou understand how your work impacts the business we're building.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou'll do work that is fulfilling and fun with a group people genuinely interested in seeing you do well.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou're treated like a responsible adult. Want to take time off? Cool. Just ensure your deliverables are met when you said they were going to be.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat we ask of you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou Know What Lights You Up - you've found that thing - making order out of chaos or creating elegant code - that sparks your sense of 'Whoa. This is fun.'\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e100% Responsible - you are responsible for your thoughts, feelings and actions. You take ownership of      how you respond to situations. Owning the outcomes of your actions and the      results of your work.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe Present - you have practices to keep you 'in the moment,' and a chattering mind at bay, so you can do your best work.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIntegrity - any of your actions, messages or conversations could be reprinted on the NYTimes.com homepage and you would feel comfortable.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA Good Laugh - you realize we're not getting out of this 'Life' thing alive and you might as well laugh. A lot.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe Role\u003c/p\u003e\n\u003cp\u003eA pragmatic front-end developer is required to build up, adapt, and maintain client-side applications and interfaces for both internal and external use.  You’ll work closely with our CTO, Lead Developer and CEO to produce simple-to-use and easy-to-comprehend tools to interface with APIs.\u003c/p\u003e\n\u003cp\u003eYou Have Experience With\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e3+ years building software\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHTML, CSS and Javascript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eReact and surrounds\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWorking with APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGit\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs well as excellent communication skills, and familiarity with the computer sciences.  Some familiarity with Python, Linux and business intelligence tools would be beneficial, but is not necessary.\u003c/p\u003e\n\u003cp\u003eCandidates with public GitHub, BitBucket, or similar profile and samples preferred.\u003c/p\u003e\n\u003cp\u003eFor the right candidate, we offer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA work culture that respects your time and energy\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCompetitive salary and profit sharing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnlimited Vacation\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtended Healthcare Benefits\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA beautiful office in downtown Vancouver or option to work remotely\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSkilled and friendly coworkers with diverse interests\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested in Applying? Here's the Process:\u003c/p\u003e\n\u003cp\u003ePrepare a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile.\u003c/p\u003e\n\u003cp\u003eSend that to \u003ca href=\"mailto:jobs@strategybox.com\"\u003ejobs@strategybox.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIf selected, you'll go through three interviews:\u003c/p\u003e\n\u003cp\u003ePreliminary Interview\u003c/p\u003e\n\u003cp\u003eTechnical Review\u003c/p\u003e\n\u003cp\u003eCulture Fit Interview\u003c/p\u003e\n\u003cp\u003eFor some applicants we also will offer a short, paid project to ensure you like the work and what we're up to.\u003c/p\u003e\n\u003cp\u003eWe're looking forward to meeting you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile to \u003ca href=\"mailto:jobs@strategybox.com\"\u003ejobs@strategybox.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99e3b3f3397d9a5b63d69cb04d9c425bd97d47ff/SB_LogoTag_WEB.jpg"},{"id":"cc20d9f2-0102-4785-8253-66093d3ca5c0","type":"Full Time","url":"https://jobs.github.com/positions/cc20d9f2-0102-4785-8253-66093d3ca5c0","created_at":"Thu Jul 16 02:02:01 UTC 2020","company":"Koffie Labs","company_url":"https://www.getkoffie.com/","location":"NYC/Remote","title":"Data Engineer","description":"\u003cp\u003eKoffie is an insurance company purpose built for the autonomous vehicle era. We are taking transportation insurance out of the dark ages by using modern technology to deliver instant policies based on advanced safety and autonomous technology. As an InsurTech, Koffie is free from legacy systems and inefficient processes, our AI-driven predictive models deliver a reimagined insurance experience for fleets.\u003c/p\u003e\n\u003cp\u003eWe believe strongly in diversity of thought which comes from different backgrounds and experiences and want to hear from you, regardless of where you live. Koffie is a work from home first company but believes face time every few weeks is essential.\u003c/p\u003e\n\u003cp\u003eOur vision is to align incentives across fleets, technology providers, brokers and the automotive industry. By catalyzing the adoption of safety technology, we positively impact road safety and facilitate a more efficient supply chain. We’re backed by top-tier VCs in the fintech and mobility sectors. If you're ready to work obsessively with us to make insurance better, faster, more efficient and build products for the next 100 years of mobility, we want to hear from you.\u003c/p\u003e\n\u003cp\u003eDescription\nThis is a unique role that offers broad exposure to software engineering and data science. We are eager to find underrepresented candidates who are early in their career and don’t want to choose between engineering or data science.\u003c/p\u003e\n\u003cp\u003eWorking with data science and engineering, you will be deeply enmeshed in the critical nuances of disambiguation, normalization, standardization and other ETL skills. You will also have the opportunity to work in all stages of our software process from researching data sources to developing data pipelines and building business intelligence visualization tools.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003eDesign and build data pipelines\nRun and iterate data science experiments in the cloud and in a production environment\nSupport business intelligence and data science needs via visualization/reporting\u003c/p\u003e\n\u003cp\u003eBackground/Experience\u003c/p\u003e\n\u003cp\u003e-Undergraduate CS degree or equivalent; 2-5 years professional experience\n-Experience with python; the ideal candidate is generally comfortable with web programming, consuming APIs, data wrangling, etc.\n-ETL processes on large open/public (\u0026gt;50 GB) datasets a plus\n-Designing systems that store/query geospatial and time series data\n-Familiarity with python data engineering, data science, and visualization frameworks\n-Good understanding of classification and regression metrics\n-Curiosity for insurance and autonomous technology applied to transportation/trucking\n-Entrepreneurial mindset and comfort with ambiguity\u003c/p\u003e\n\u003cp\u003eBenefits\nFor US employees we offer a competitive salary, stock options, unlimited vacation, 100% employer paid health, vision and dental plans, commuter benefits and discounted fitness classes, generous WFH stipend, personal learning/training (for professional/industry certification) and conference budget. For remote hires outside the US, we are unable to provide employer paid health, vision and dental plans, commuter benefits and discounted fitness classes.\u003c/p\u003e\n\u003cp\u003eWe believe strongly in diversity of thought which comes from different backgrounds and experiences. Covid has helped us transform to a WFH-first company, so periodic multi-day get-togethers are an essential part of growing our team.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://apply.workable.com/j/A4566CE638\"\u003ehttps://apply.workable.com/j/A4566CE638\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e4bccde8a00566a0961a533bbed67c6026714783/koffie%20logo%20black.jpg"},{"id":"11cbce13-e6cd-4c79-b904-d292b569b22f","type":"Full Time","url":"https://jobs.github.com/positions/11cbce13-e6cd-4c79-b904-d292b569b22f","created_at":"Wed Jul 15 12:17:30 UTC 2020","company":"OpenPlay","company_url":"http:","location":"Santa Monica","title":"Software Enginee","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eHello, we’re OpenPlay!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a full-stack engineer to work with us on our web-based music distribution application. You’ll work with us to design, develop, and deploy new application features for one of the world’s largest record companies. This is a full-time position that can be local (Los Angeles) or fully remote.\u003c/p\u003e\n\u003ch2\u003eWhat’s an OpenPlay?\u003c/h2\u003e\n\u003cp\u003eWe’re a small software team making distribution and workflow products for some of the world’s largest music companies. We’re big on testing, constant incremental improvement, craftsmanship, and pragmatism, and so far have been able to use those buzzwords to quickly deliver lots of features to keep the music industry running. We strive to make well engineered software that looks great and is friendly to use. We’re collaborative, supportive, enjoy learning, and most of all enthusiastic about building new things and making old things better.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll be doing:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eRefining requirements.\u003c/strong\u003e We follow an agile process focused on rapid incremental delivery. You’ll take rough features born from an interesting idea, a customer request, or an overdue refactor (or a bug), and collaborate designing the user experience and technical direction necessary to release the next (or first) version.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eProgramming.\u003c/strong\u003e It wouldn’t be an engineering position without some programming. We try to get to this step with minimal planning time so we can see how an idea takes shape in the real world. Our languages of choice are Ruby and Javascript. We tend to practice outside-in development: most features start with a rough end-to-end (or system, or integration, etc.) test, then we attach some UI, give it an endpoint to communicate with, and finally add in the persistence layer. You’ll be responsible for your feature iterations from start to finish, but you’ll have a team to help and design support for visual polish.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eDeploying.\u003c/strong\u003e We offload and automate devops as much as possible, but a small part of every feature is still getting it deployed and ensuring it’s working as expected. We deploy features to production a few times per day on a typical day.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eSkills we’re looking for:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003ePractical experience in full stack web application development.\u003c/strong\u003e At least a few years working on both the server and client side of production web applications. Experience with any client/server development (i.e. mobile) would probably also be pretty applicable. Console game development sounds really cool but probably wouldn’t transfer over as well. TI-86 calculator programming experience wouldn’t be a great fit either.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAcademic knowledge of software development.\u003c/strong\u003e In addition to being able to make something work, you’ll need to be able to research and articulate why it’s a particularly good solution. A computer science degree is one good barometer we’re looking for, but we understand it’s not the only path to understanding engineering principles and isn't required.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eA desire to collaborate with others.\u003c/strong\u003e As a team we often discuss new and better ways to approach problems. We do code reviews and we write comments explaining our rationale when code looks smelly. If you enjoy thinking about new solutions to old problems, and can balance that with small, iterative, deliveries, you’ll probably enjoy working with us.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cp\u003eKey technology experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eRuby.\u003c/strong\u003e Experience with ruby would be ideal, but experience with other object-oriented dynamic languages would transfer over pretty well, especially python (you won’t be the only convert). Extensive experience in any programming language might fit as well. If you’re new to Ruby but enjoy object-oriented programming you’ll probably love it.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eJavascript.\u003c/strong\u003e Experience with other semi-prototypal web-browser-based scripting languages with a nonsense hodge-podge standard library would probably transfer over too, but happily for the world we’re not sure any exist. In any case, the more experience you have with Javascript the better.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTesting.\u003c/strong\u003e The heart of our workflow is a full suite of end-to-end tests that we rely on to rapidly and safely build and deploy new features and refactor old code. Prior experience with test driven development or behavior driven development would be a big plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eMore specific technologies we use:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eOur server-side code is MVC-structured and built around Sequel (ORM) and Sinatra. If you’re familiar with Rails or similar MVC frameworks you’ll feel at home pretty quickly.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur core distribution product (OpenPlay Music) is a traditional multi-page application driven by server-side HTML and using Javascript to apply bits of dynamic behavior.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur project management and workflow tool is a more recent single-page-application built in React and backed by Ruby communicating over JSON.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe enjoy both of them and think they are both appropriate technologies for different types of applications.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe do things typical of web applications like:\u003c/p\u003e\n\u003cp\u003eº Store data in and query from a relational database (PostgreSQL)\u003c/p\u003e\n\u003cp\u003eº Index data and query it with filtering and full text searching (Elasticsearch)\u003c/p\u003e\n\u003cp\u003eº Handle slow tasks with background processing\u003c/p\u003e\n\u003cp\u003eº Push notifications to clients with WebSockets\u003c/p\u003e\n\u003cp\u003eº Export XML files, PDFs, CSVs, Excel spreadsheets, and other formats that just won’t seem to go away\u003c/p\u003e\n\u003cp\u003eº Communicate with lots of external systems across all manner of APIs\u003c/p\u003e\n\u003cp\u003eº Provide a JSON API for our customers to build on top of\u003c/p\u003e\n\u003cp\u003eº Offload as much devops as possible to Heroku\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive compensation\u003c/li\u003e\n\u003cli\u003eMedical, dental, and vision insurance\u003c/li\u003e\n\u003cli\u003eWork life balance: We expect you to generally work 40 hours/week but understand that sometimes it’s summer. We might rarely have a big push where we end up working long hours. The last time this happened was in 2019 for about a week. The time before that was in 2016 for about 3 weeks.\u003c/li\u003e\n\u003cli\u003eFlexible work and vacation schedule: We have found so far that if the work is enjoyable it isn’t necessary to police when people are working. So we try to keep the work enjoyable.\u003c/li\u003e\n\u003cli\u003eFree to work remote: Our process works just as well in person or remote. It can sometimes even feel remote at the office when we’re sitting next to each other talking on Slack with our headphones in.\u003c/li\u003e\n\u003cli\u003eCompany Minecraft server with lots of odd elevated stone platforms.\u003c/li\u003e\n\u003cli\u003eOffice by the beach with a small-but-growing collection of vinyl figurines.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAll your information will be kept confidential according to EEO guidelines.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/38Xr2kJ\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/38Xr2kJ\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--768d7d0ec6983dfb25b4a5b7b4cfada6f9846a70/Openplay.jpeg"},{"id":"c41512e4-5cf6-46db-b1a0-898c069b3cec","type":"Full Time","url":"https://jobs.github.com/positions/c41512e4-5cf6-46db-b1a0-898c069b3cec","created_at":"Wed Jul 15 10:10:04 UTC 2020","company":"Future Plc","company_url":"http:","location":"Brno","title":"Senior Software Engineer","description":"\u003ch2\u003eDescription\u003c/h2\u003e\n\u003cp\u003eAbout the Team\u003c/p\u003e\n\u003cp\u003eTechnology \u0026amp; Engineering is a globally distributed central team focussed on delivering an innovative, modern, scalable and reusable proprietary tech stack. We work on a service oriented architecture model to support the business’ online operations and growth ambition.Our incredible tech stack also enables content creation, management and distribution for magazines.\u003c/p\u003e\n\u003cp\u003eOur technology \u0026amp; engineering philosophy is service oriented architecture with single responsibility service. We work on a principle of 60% design and 40% implementation with modular development to promote reuse, ease for scale and lean in terms of operational cost\u003c/p\u003e\n\u003cp\u003eOur architecture design, engineering and development solutions are based on consensus; eliminating split brain and promoting ownership. We encourage small rapid iteration approach to existing products and leverage learning to increase our level of success at the next stage. Optimisation is key and necessary until the point of diminishing return\u003c/p\u003e\n\u003cp\u003eAs a global team, communication and collaboration is as important as any of the above in order to deliver successfully.\u003c/p\u003e\n\u003cp\u003eJob Purpose\u003c/p\u003e\n\u003cp\u003eWe are currently recruiting for 2 Senior Systems Engineers to join our team. The role can be based in Bath or remotely in the UK.\u003c/p\u003e\n\u003cp\u003eAs a Senior Systems Engineer, you will be a key member of the Systems Engineering team working extremely closely with the Site Reliability Engineering (SRE) team as well as the Tech Leads in order to ensure successful on-going development of existing and new core and critical web services. You will ensure that technical solutions are of the highest possible standards.\u003c/p\u003e\n\u003cp\u003eKey Responsibilities\u003c/p\u003e\n\u003cp\u003eYou will manage development in one of the product areas including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with the Systems Engineering team to produce and agree specifications for amending or adding new functionality to primarily single responsibility web services and web applications and to produce realistic development plans for the product (including estimates and dependencies).\u003c/li\u003e\n\u003cli\u003eExtensively collaborate with the Site Reliability Engineering (SRE) team in order to enhance existing web services through development and work toward delivering efficient support and maintenance practice which includes systems deployment and monitoring and improve overall development process for developers within the Technology \u0026amp; Engineering department.\u003c/li\u003e\n\u003cli\u003eProvide technical leadership for product support to other developers across the department ensuring that problems are resolved in a methodical and timely manner and that progress is communicated effectively to all relevant parties – in particular to liaise with the Web Operations teams when resolving problems.\u003c/li\u003e\n\u003cli\u003eYou will be the system owner of one or more critical and core web services and/or systems and assist the SRE team with on-call support when and where appropriate.\u003c/li\u003e\n\u003cli\u003eEnsure that the deliverables of program design, coding, testing, documentation and implementation are undertaken in line with the specification and that they are completed on time and to a high quality.\u003c/li\u003e\n\u003cli\u003eDesign and code from the specifications, using agreed standards and tools to achieve a well-engineered result.\u003c/li\u003e\n\u003cli\u003eDocument all work in accordance with agreed standards.\u003c/li\u003e\n\u003cli\u003ePlan and test developments to ensure that the product functions as expected\u003c/li\u003e\n\u003cli\u003eMeet regularly with the other web and systems developers, project and product managers and across the Technology \u0026amp; Engineering department to ensure that the technical product designs and implementation are of a consistent standard and technical solution choices are in line with the technical development strategy, as informed by the Chief Technology Officer and the Systems Engineering team.\u003c/li\u003e\n\u003cli\u003eMaintain an awareness of developments in the industry and participate in the sharing of knowledge and ideas across the teams.\u003c/li\u003e\n\u003cli\u003eTreat all customers and colleagues with respect and to demonstrate a commitment to Future’s Equal Opportunities Policy.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease note, occasional out of hours working may be required during peak trading periods.\u003c/p\u003e\n\u003ch2\u003eRequirements\u003c/h2\u003e\n\u003cp\u003eWhat do I need to succeed?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a passionate and self-motivated worker; you’re able to work with others to analyse complex problems specifically around scalability, optimisation, resiliency and redundancy.\u003c/li\u003e\n\u003cli\u003eYou actively encourage collaboration to design the best solutions.\u003c/li\u003e\n\u003cli\u003eYou are an expert in PHP and write beautiful, SOLID, optimised code\u003c/li\u003e\n\u003cli\u003eYou have proven track record on successfully delivering web services and/or web applications\u003c/li\u003e\n\u003cli\u003eYou are able to communicate technical information to non-technical people as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEssential Knowledge, Skills \u0026amp; Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eStrong consumer facing web product development experience using OOP/OOD\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience of developing for scalable redundant and resilient web products\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eStrong understanding of distributed systems and messaging services\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHands-on experience of designing and implementing custom web services and APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience of integrating with internal and external web services and APIs\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience in automated deployment and automated regression testing.\nA systematic, disciplined and analytical approach to problem solving – paying close attention to detail\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe able to competently plan, schedule and monitor your own and others’ work\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBe familiar with, and be able to use as directed, all applicable tools, methods, procedures and standards\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave an excellent understanding of;\u003c/p\u003e\n\u003cp\u003eº Service orientated architectures\u003c/p\u003e\n\u003cp\u003eº Event driven/asynchronous architectures\u003c/p\u003e\n\u003cp\u003eº Test Driven Development\u003c/p\u003e\n\u003cp\u003eº Continuous integration and deployment practices using CI\u003c/p\u003e\n\u003cp\u003eº Containerisation via Docker, Kubernetes\u003c/p\u003e\n\u003cp\u003eº Web servers – NGINX\u003c/p\u003e\n\u003cp\u003eº NoSQL and traditional databases\u003c/p\u003e\n\u003cp\u003eº Good software engineering practices including source code versioning and code testing\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave full web-stack capability – from document database (Redis, Mongo, Solr/Lucene) and relational database (MySQL – PostgreSQL) to JavaScript to HTML/CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable Knowledge, Skills \u0026amp; Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOpen to learning new languages \u0026amp; technologies\u003c/li\u003e\n\u003cli\u003eExperience of one or more of the following languages: Golang, Python, Java, Node, Typescript\u003c/li\u003e\n\u003cli\u003eExperience of Microservice architectures\u003c/li\u003e\n\u003cli\u003eExperience of web and data caching\u003c/li\u003e\n\u003cli\u003eExperience operating global services at scale\u003c/li\u003e\n\u003cli\u003eExperience with NoSQL technologies\u003c/li\u003e\n\u003cli\u003eExperience with RESTFul services\u003c/li\u003e\n\u003cli\u003eExperience writing applications optimised for observability (tracing, metrics, structured logging)\u003c/li\u003e\n\u003cli\u003eExperience with Lambda/Serverless architectures\u003c/li\u003e\n\u003cli\u003eFamiliarity with JIRA\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eBenefits\u003c/h2\u003e\n\u003cp\u003eWhat will I get in return?\u003c/p\u003e\n\u003cp\u003eAs well as our standard benefits, we have a number of awesome perks available to our staff including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited paid time off (yes you read that right!)\u003c/li\u003e\n\u003cli\u003eWe offer structured career development to all of our people ensuring they have the skills and experience to grow. Our CTO, Kevin Li Ying joined us as a Programmer!\u003c/li\u003e\n\u003cli\u003eA share in our success- every member of staff receives a profit pool bonus at the end of our financial year\u003c/li\u003e\n\u003cli\u003eFree food (monthly munchies, bagel Fridays, fresh fruit \u0026amp; snacks and coffee and tea on tap)\u003c/li\u003e\n\u003cli\u003eCentral office locations with cool open plan working spaces as well as plenty of flexibility to work remotely\u003c/li\u003e\n\u003cli\u003eFree digital magazine subscriptions and access to back copies of our print magazines and bookazines\u003c/li\u003e\n\u003cli\u003eDiscounted gym membership and onsite health \u0026amp; wellbeing (yoga at lunch anyone?!)\u003c/li\u003e\n\u003cli\u003eAnnual Future conference – get together with your colleagues to celebrate success and look forward to what’s next\u003c/li\u003e\n\u003cli\u003eRegular staff socials arranged by our wonderful Community \u0026amp; Culture committees\u003c/li\u003e\n\u003cli\u003eHuge opportunities to learn and develop whether through professional qualifications, exposure to incredible business projects or informal lunch \u0026amp; learns, hosted by your colleagues\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eInterested in this position?\u003c/h2\u003e\n\u003cp\u003eWe are happy to get in touch with you! You can send your application by using \u003ca href=\"https://vonq.io/2CpxZyN\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/2CpxZyN\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de57b3345bdec3a420dec96845137ed48fe11333/Future.jpg"},{"id":"377a1ad3-eea3-42bd-846a-7beff0069797","type":"Full Time","url":"https://jobs.github.com/positions/377a1ad3-eea3-42bd-846a-7beff0069797","created_at":"Tue Jul 14 09:45:02 UTC 2020","company":"api.video","company_url":"https://jobs.api.video","location":"Bordeaux","title":"Backend Engineer - Core Team Développeur PHP","description":"\u003cp\u003e\u003cstrong\u003e[CDI] Backend Engineer - Core Team Développeur PHP - 1\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://api.video/\"\u003e\u003cstrong\u003eapi.video\u003c/strong\u003e\u003c/a\u003e \u003cstrong\u003ea pour mission de connecter les individus via leurs caméras\u003c/strong\u003e.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNous sommes l'\u003cstrong\u003eAPI-1st platform pour la vidéo\u003c/strong\u003e en ligne avec pour objectif de devenir un nouveau standard, au même titre que Stripe pour les paiements, Twilio pour les SMS ou Sendgrid pour les e-mails.\u003c/li\u003e\n\u003cli\u003eNous bâtissons notre \u003cstrong\u003einfrastructure EDGE\u003c/strong\u003e pour apporter au Marché le premier backbone dédié à la vidéo.\u003c/li\u003e\n\u003cli\u003eNous avons réalisé une première levée de fonds d'amorçage de \u003ca href=\"https://techcrunch.com/2020/06/24/api-video/\"\u003e\u003cstrong\u003e$5.5M en juin 2020\u003c/strong\u003e\u003c/a\u003e auprès de plusieurs fonds d'investissement nationaux et internationaux (\u003ca href=\"https://www.blossomcap.com/\"\u003e\u003cstrong\u003eBlossom Capital\u003c/strong\u003e\u003c/a\u003e, \u003ca href=\"https://www.kimaventures.com/\"\u003e\u003cstrong\u003eKima Ventures\u003c/strong\u003e\u003c/a\u003e...) et de nombreux \u003ca href=\"https://www.crunchbase.com/funding_round/api-video-angel--81c5d31d\"\u003e\u003cstrong\u003eentrepreneurs réputés\u003c/strong\u003e\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEn nous rejoignant, vous travaillerez dans un environnement international de très haut niveau, adressant des challenges qui impactent des millions de personnes\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLe poste\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAu sein de l'équipe Core Team, vous participerez à la conception et au développement des webservices publics et privés permettant aux développeurs de plus de 100 pays d'intégrer rapidement toutes les fonctionnalités nécessaires pour diffuser des vidéos à la demande ou en direct dans leurs applications et services.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVotre rôle\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAu sein de l'équipe de développement, vous contribuerez activement au développement d'api.video:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003een concevant et développant des micro-services scalables \u003c/li\u003e\n\u003cli\u003een réalisant des tests (unitaires, fonctionnels et de mutation)\u003c/li\u003e\n\u003cli\u003een rédigeant et documentant des API privées et/ou publiques\u003c/li\u003e\n\u003cli\u003een intervenant sur la maintenance corrective et évolutive\u003c/li\u003e\n\u003cli\u003een étant force de proposition (veille, technologies, méthodologie…)\u003c/li\u003e\n\u003cli\u003een partageant vos connaissances, assurer la sécurité, la qualité et la scalabilité de vos travaux\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eVotre profil\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDe formation bac +5, vous avez acquis une expérience comprise entre 3 et 5 ans en conception / développement PHP Orienté Objet et Golang.\u003c/p\u003e\n\u003cp\u003ePassionné(e), curieux(se), rigoureux(se) et autonome, vous aimez travailler avec une équipe à taille humaine, collaborative et responsable. Vous avez soif de connaissances dans les domaines les plus à la pointe de l’industrie; vous êtes ouvert à de la formation, à assister à des conférences afin de monter en compétence.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompétences attendues\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaîtrise des design patterns fondamentaux (Factory, Strategy, Observer…)\u003c/li\u003e\n\u003cli\u003ePHP7 / Symfony \u0026gt;= 4.0\u003c/li\u003e\n\u003cli\u003eGolang\u003c/li\u003e\n\u003cli\u003eRabbitMQ\u003c/li\u003e\n\u003cli\u003eEvent Sourcing\u003c/li\u003e\n\u003cli\u003eRespect des meilleurs pratiques (standards PSR, règles DRY, KISS…).\u003c/li\u003e\n\u003cli\u003eMaîtrise de Composer, Git (GitLab), et de l’environnement Linux\u003c/li\u003e\n\u003cli\u003eMaîtrise des tests unitaires, TDD et autres best practices de développement\u003c/li\u003e\n\u003cli\u003eConnaissances en matière de web-services RESTful\u003c/li\u003e\n\u003cli\u003eConnaissances en matière d'architecture micro-services, communication asynchrone et problématiques de scalabilité sont un plus.\u003c/li\u003e\n\u003cli\u003eConnaissances de Python\u003c/li\u003e\n\u003cli\u003eConnaissances de Docker est un plus (optionnel).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNotre stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNginx, PHP 7.4, Symfony, PostgreSQL, Redis, Docker, ElasticSearch/Kibana, Python, NodeJS, RabbitMQ\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRémunération\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEntre 50.000€ et 60.000€ selon profil\u003c/li\u003e\n\u003cli\u003eEquity (BSCPE)\u003c/li\u003e\n\u003cli\u003eBonus\u003c/li\u003e\n\u003cli\u003eMutuelle\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.api.video/#section-109129\"\u003e\u003cstrong\u003e\u0026gt;\u0026gt; Et quelques uns de nos avantages\u003c/strong\u003e\u003c/a\u003e !\u003cimg src=\"https://camo.githubusercontent.com/19c4abf1bc5bf8ea978622c3b98286c4090a3c82/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313732323731\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIntéressé(e) ?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEnvoyez-nous sans tarder votre CV et lettre de motivation. Cliquez sur 'Postuler maintenant'.\u003cimg src=\"https://camo.githubusercontent.com/19c4abf1bc5bf8ea978622c3b98286c4090a3c82/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313732323731\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/82UDW9u\"\u003eClick here to apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1dHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d5d554b165fadda2bda8961b1e18ce6082af061a/api.video%20logo.png"},{"id":"3c98aa7e-baf1-4e24-9b4a-4f34f0e06755","type":"Full Time","url":"https://jobs.github.com/positions/3c98aa7e-baf1-4e24-9b4a-4f34f0e06755","created_at":"Mon Jul 13 08:24:58 UTC 2020","company":"Instrument Systems Optische Messtechnik GmbH","company_url":"https://www.instrumentsystems.com/en/","location":"München","title":"Softwareentwickler Optische Messtechnik (m/w/d)","description":"\u003cp\u003eInstrument Systems setzt mit hochpräzisen Array-Spektrometern, Farbmesskameras sowie anspruchsvollen System- und Softwarelösungen weltweit Maßstäbe in der Lichtmesstechnik. Internationale Hersteller von LED-Leuchten, Displaytechnik und Automobilzubehör sowie alle wichtigen Prüflabore und Forschungsinstitute zählen zu unseren Kunden. Mit über 280 Mitarbeitern entwickeln und fertigen wir Geräte von höchster Qualität an den Standorten München und Berlin. Als Tochterunternehmen von Konica Minolta profitieren wir dabei von einem starken und globalen Netzwerk.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIhre Aufgaben:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEigenständige und gewissenhafte Umsetzung der seitens des Produkt Owners formulierten Anforderungen in Software für unser internationales und namhaftes Kundenportfolio\u003c/li\u003e\n\u003cli\u003eVerantwortung der bedarfsgerechten und korrekten Implementierung unter Windows in C++ mit Qt unter Einsatz von klassischen und agilen Methoden (Scrum etc.)\u003c/li\u003e\n\u003cli\u003eSicherstellung der Qualität und Wartbarkeit der Software, zum Beispiel durch automatisierte Tests und Code Reviews\u003c/li\u003e\n\u003cli\u003eAufnahme, Untersuchung und Besprechung eventueller anwender-/kundenseitiger Probleme sowie deren Behebung (Bugfixing)\u003c/li\u003e\n\u003cli\u003eSoftware Engineering stets mit Nähe zu unserer Hardware und Geräten in Abstimmung mit internen Ansprechpartnern im R\u0026amp;D Department\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIhre Voraussetzungen:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAbgeschlossenes Studium der Ingenieurs- oder Naturwissenschaften, z.B. Informatik, Computational Engineering, Elektro- und Informationstechnik, Physik oder eine vergleichbare Berufsausbildung mit entsprechender einschlägiger Berufserfahrung\u003c/li\u003e\n\u003cli\u003eFundierte Kenntnisse in der objektorientierten Softwareentwicklung in C++\u003c/li\u003e\n\u003cli\u003eIdealerweise praktische Erfahrung mit Qt, macOS sowie in der hardwarenahen Softwareentwicklung\u003c/li\u003e\n\u003cli\u003eKenntnisse in der (Licht-)Messtechnik und Optik, in der Bildverarbeitung sowie über Kalibrieranwendungen, Laborsoftware und SDKs ebenso wie in Git, OpenCV, Python, Cmake und GUI Programmierung wären wünschenswert\u003c/li\u003e\n\u003cli\u003eOptional sind zudem Erfahrungen in der Koordination von Projekten\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWährend einer intensiven Einarbeitungsphase, in der Ihnen erfahrene Kollegen mit Rat und Tat zur Seite stehen, haben Sie die Möglichkeit, unsere Produkte, Dienstleistungen und Entwicklungsmethoden kennenzulernen. Als Mitglied unseres wachsenden, derzeit fünfzehnköpfigen Teams übernehmen Sie dabei Schritt für Schritt die Verantwortung für Ihre Software, deren Entwicklung Sie proaktiv vorantreiben.\u003c/p\u003e\n\u003cp\u003eAls innovationsstarkes Technologieunternehmen bauen wir auf das Engagement, die Qualifikation und die Kreativität unser Mitarbeiterinnen und Mitarbeiter. Sie übernehmen gerne Verantwortung für Ihren Aufgabenbereich und möchten sich in herausfordernden Projekten beweisen? Dann freuen wir uns über Ihre aussagekräftige Bewerbung unter Angabe Ihrer Gehaltsvorstellungen.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/0bdd1c89a1847bd51928d815c8d8ed18ae80e52e/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f61306261386662666162663166656137306439363961316431313061633431346466373664313665393136663931313138653730393330303432663531623261\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tracking.gohiring.com/h/84dfaf4e2a29b4b20e4c685856e176bb41459ca076d30cba93e21597f3f29297\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2072373de4cbd8945c841efa67cbc3613fad417/Instrument%20Systems.png"},{"id":"9c455180-ecca-11e8-886b-ae327644a48e","type":"Full Time","url":"https://jobs.github.com/positions/9c455180-ecca-11e8-886b-ae327644a48e","created_at":"Tue Nov 20 13:52:15 UTC 2018","company":"Huawei","company_url":"https://www.huawei.com","location":"Munich, Germany","title":"Senior Software Engineer (m/f)","description":"\u003cp\u003eHuawei is a leading provider of information and communications solutions. Our products have been deployed in over 140 countries serving more than one third of the world’s population. For the Trusted System Protection (TSP) team within the Cyber Security and Privacy Protection Laboratory (CSPL) in Munich, Germany we are currently looking for a Senior Software Engineer enthusiastic to work on cutting-edge security technologies and to contribute to the security architecture of future Huawei products in a diverse range of verticals, from telecom to cloud and IoT platforms.\u003c/p\u003e\n\u003ch3\u003eYour responsibilities\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, implement, test and document advanced security technology prototypes for trusted computing, system integrity protection and platform resilience\u003c/li\u003e\n\u003cli\u003eAnalyze product architecture and source code and collaborate with product line engineers to adapt the developed prototypes to product architectures\u003c/li\u003e\n\u003cli\u003eContribute to joint research projects with our European partners from academia and industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eOur requirements\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in designing, implementing and debugging embedded firmware and applications in C, for ARMv7/8-A, ARMv7/8-M, other embedded architectures or x86\u003c/li\u003e\n\u003cli\u003eProfessional knowledge in one or more of following areas:\n\u003cul\u003e\n\u003cli\u003eMicrocontroller and application processor architectures, DeviceTree, board bring-up, Secure Boot, flash storage, buses, Secure Update\u003c/li\u003e\n\u003cli\u003eLinux OS kernel internals, memory management, containers, virtualization, security features\u003c/li\u003e\n\u003cli\u003eDevelopment with common security protocols (e.g. TLS, IPSec, OAuth 2.0 etc.), crypto libraries (e.g. OpenSSL, mbedTLS), PKCS#11 or Linux kernel crypto API, X.509 certificates and PKI\u003c/li\u003e\n\u003cli\u003eLinux – network / system tools / command line interface / scripting\u003c/li\u003e\n\u003cli\u003eCode debugging techniques\u003c/li\u003e\n\u003cli\u003eProficiency in English\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eFollowing are desirable:\n\u003cul\u003e\n\u003cli\u003eTrusted Computing\u003c/li\u003e\n\u003cli\u003eHardware security architectures and best practices\u003c/li\u003e\n\u003cli\u003ePython, Go; Javascript, Node.JS and micro service architectures\u003c/li\u003e\n\u003cli\u003eExperience with cloud technologies such as OpenStack and containers (Docker/Kubernetes)\u003c/li\u003e\n\u003cli\u003eDevOps methodologies such as agile development and continuous delivery\u003c/li\u003e\n\u003cli\u003eExperience in contributing to open-source projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCandidate should be self-motivated to research and compare new software technologies and be in a position to rapidly become accustomed to them in a relatively short period of time.\u003c/p\u003e\n\u003cp\u003eAble to independently design, build, and maintain efficient, reusable and secure code. Identify potential bottlenecks and bugs and devise solutions to the problems. Analyze existing code and identify points of improvement.\u003c/p\u003e\n\u003cp\u003eCapable to analyze complex software architectures and prioritize development tasks to maximize efficiency and output. Able to troubleshoot problems in an existing code base with limited documentation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your CV to \u003ca href=\"mailto:jane.jeffreys@huawei.com\"\u003ejane.jeffreys@huawei.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb8499ec0b8cfed521539de0c702dd3bf1c2b87f/8ed5a22c-7b16-41b0-9320-c538c2717293"},{"id":"07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","type":"Full Time","url":"https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011","created_at":"Tue Nov 20 12:09:59 UTC 2018","company":"Mindhive","company_url":"http://www.mindhive.org","location":"Brisbane CBD Australia","title":"Senior Front End and Backend Developers","description":"\u003cp\u003e\u003cstrong\u003eMINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMindhive\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.\u003c/p\u003e\n\u003cp\u003eSince completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR BACKEND DEVELOPER ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a backend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eCloud services\nDatabase\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:\u003c/p\u003e\n\u003cp\u003eDevelop cloud-based API services\nDevelop in-house \u0026amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDetailed understanding of cloud architecture(s)\nDetailed knowledge of Python \u0026amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols \u0026amp; certificates\nBonus: detailed knowledge of machine learning \u0026amp; AI\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSENIOR FRONTEND DEVELOPER ROLE OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a frontend developer, you will help design, implement, deploy \u0026amp; support Mindhive’s platform which includes (and not limited to):\u003c/p\u003e\n\u003cp\u003eWeb application\nMobile application\nIntegrations (in-house \u0026amp; third party)\nTests (unit \u0026amp; integration)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll do\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePrimary responsibility: Implement UX/UI for mobile first web and mobile apps\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional key responsibilities include:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUtilise any and all relevant frameworks, libraries and techniques:\u003c/p\u003e\n\u003cp\u003eJavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house \u0026amp; third party)\nReview and inform database models are in alignment with frontend view models \u0026amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you’ll bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eExperience with current industry design tools (e.g. Figma)\u003c/p\u003e\n\u003cp\u003eUnderstanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking \u0026amp; abstract, technical problem solving\nProactivity\nCollaboration\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow do I level up?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRoles within reach for the employee - Development Team Lead\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBespoke Requirements / Additional Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDevelop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:career@mindhive.it\"\u003ecareer@mindhive.it\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"},{"id":"7d0d5cf0-ec1f-11e8-9834-c8e30f51c014","type":"Full Time","url":"https://jobs.github.com/positions/7d0d5cf0-ec1f-11e8-9834-c8e30f51c014","created_at":"Mon Nov 19 17:21:35 UTC 2018","company":"Simons Foundation","company_url":null,"location":"New York, New York","title":"Web Developer","description":"\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.\u003c/p\u003e\n\u003cp\u003eESSENTIAL FUNCTIONS/RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress\u003c/li\u003e\n\u003cli\u003eWork collaboratively and closely with editors, front-end designers, web producers and other developers\u003c/li\u003e\n\u003cli\u003eEffectively manage priorities for multiple concurrent projects\u003c/li\u003e\n\u003cli\u003eCommunicate with stakeholders to gather requirements and ensure their needs are being met\u003c/li\u003e\n\u003cli\u003eAdapt to changing requirements\u003c/li\u003e\n\u003cli\u003ePerform any other duties or tasks as assigned or required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMINIMUM QUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor's degree is required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient with WordPress, with 3+ years of experience developing custom WP sites\u003c/li\u003e\n\u003cli\u003eAdvanced expertise with PHP and MySQL\u003c/li\u003e\n\u003cli\u003eDeep understanding of HTML and CSS\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript and jQuery\u003c/li\u003e\n\u003cli\u003eExperience with React or similar JS libraries or frameworks\u003c/li\u003e\n\u003cli\u003eExperience with responsive web development\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eProficient with version control tools, such as Git and SVN.\u003c/li\u003e\n\u003cli\u003ePortfolio of work products that function well on multiple device types\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in User Experience and User Interface design\u003c/li\u003e\n\u003cli\u003eExperience with Python and Django\u003c/li\u003e\n\u003cli\u003eExperience with responsive web design, integration and usability testing\u003c/li\u003e\n\u003cli\u003eExperience with high-volume websites and/ or journalistic websites\u003c/li\u003e\n\u003cli\u003eComfort with Adobe Creative Cloud\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTHE SIMONS FOUNDATION'S DIVERSITY COMMITMENT\u003c/p\u003e\n\u003cp\u003eMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.\u003c/p\u003e\n\u003cp\u003eApply Here:   \u003ca href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\"\u003ehttp://www.Click2apply.net/tnq3zqdz2zmwb8qt\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105651217\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\"\u003ehttp://www.Click2apply.net/tnq3zqdz2zmwb8qt\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cec1fa3eb8f8a921945829b6e04fc43744f727e/29ad9da4-09d2-432c-bd49-6ad83582c9e8"},{"id":"cd535970-ec11-11e8-89ae-2e904411ec0e","type":"Full Time","url":"https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e","created_at":"Mon Nov 19 15:44:44 UTC 2018","company":"Aon Cyber Solutions","company_url":"http://www.strozfriedberg.com/careers","location":"NY or LA","title":"Cybersecurity Firm Seeks Senior Developer","description":"\u003cp\u003eAon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.\u003c/p\u003e\n\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePosition Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of this position include but are not limited to the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.\u003c/li\u003e\n\u003cli\u003eServe as a senior developer on multiple product teams.\u003c/li\u003e\n\u003cli\u003eCreate user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.\u003c/li\u003e\n\u003cli\u003eTranslate high-level requirements into working prototypes to generate user feedback and discussion.\u003c/li\u003e\n\u003cli\u003eAdapt and apply cutting edge computer science to highly technical domains.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.\u003c/li\u003e\n\u003cli\u003eMentor other developers.\u003c/li\u003e\n\u003cli\u003eContribute to a positive, collaborative culture for innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineer experience.\u003c/li\u003e\n\u003cli\u003eProficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTTP and REST web services implementation.\u003c/li\u003e\n\u003cli\u003eTest driven development and unit testing frameworks.\u003c/li\u003e\n\u003cli\u003eModern DevOps experience.\u003c/li\u003e\n\u003cli\u003eStandard software engineering tools (git, Jenkins, JIRA).\u003c/li\u003e\n\u003cli\u003eThe proven ability to see things as they should be, and to realize that vision.\u003c/li\u003e\n\u003cli\u003eComfort with agile development and remote team environments.\u003c/li\u003e\n\u003cli\u003eExcellence in verbal and written communication.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003cli\u003ePython 3 and web frameworks such as Django or Flask.\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; relational database modeling.\u003c/li\u003e\n\u003cli\u003eExperience in deployment to AWS, especially serverless technologies.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of JWT and various web security models.\u003c/li\u003e\n\u003cli\u003eD3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).\u003c/li\u003e\n\u003cli\u003eElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.\u003c/li\u003e\n\u003cli\u003eJava 8 and other JVM-based languages.\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and optimization.\u003c/li\u003e\n\u003cli\u003eMobile development using Native or Cross-platform (Xamarin, Ionic, React Native).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"2744c836-e97b-11e8-8236-5be6ba23f176","type":"Full Time","url":"https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176","created_at":"Fri Nov 16 08:41:52 UTC 2018","company":"Piktochart Sdn Bhd","company_url":null,"location":"Europe","title":"DevOps (Remote - Europe)","description":"\u003cp\u003eDear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!\u003c/p\u003e\n\u003cp\u003eYour mission:\u003c/p\u003e\n\u003cp\u003eDesign scalable and secure web infrastructure on GCP \u0026amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting\u003c/p\u003e\n\u003cp\u003eYou offer :\u003c/p\u003e\n\u003cp\u003e3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack\u003c/p\u003e\n\u003cp\u003eExtra points if you have:\u003c/p\u003e\n\u003cp\u003eExperience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations\u003c/p\u003e\n\u003cp\u003eLocation :\u003c/p\u003e\n\u003cp\u003eRemote (Already based in Europe or willing to work in EU timezone)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here : \u003ca href=\"https://grnh.se/e0769a2c1\"\u003ehttps://grnh.se/e0769a2c1\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"},{"id":"28dec9da-e90d-11e8-8317-fd99c2c2fb01","type":"Full Time","url":"https://jobs.github.com/positions/28dec9da-e90d-11e8-8317-fd99c2c2fb01","created_at":"Thu Nov 15 19:33:10 UTC 2018","company":"Acadian Asset Management","company_url":"https://www.acadian-asset.com/","location":"Boston, MA","title":"Senior Quantitative Developer, Multi-Asset Class Strategies ","description":"\u003cp\u003ePosition Overview:\nWe are looking for a senior quantitative developer to join our Multi-Asset Class Strategies (MACS) team, who will own all aspects of quantitative model development for the team – including design, implementation, visualization and maintenance. MACS is a new and growing business at Acadian and focuses on all major global asset classes including: Equities, Fixed Income, Currencies, Commodities and Options/Volatility. As a member of the investment team, this person will closely collaborate with PMs and quantitative researchers and will have opportunities to contribute to research and investment decisions.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResponsible for all aspects of quantitative model development for the MACS Team\u003c/li\u003e\n\u003cli\u003eWork with PMs and researchers to design and implement sophisticated quantitative multi-asset models\u003c/li\u003e\n\u003cli\u003eDesign and implement state of the art model visualization capabilities\u003c/li\u003e\n\u003cli\u003eMaintain all aspects of the models including daily production jobs\u003c/li\u003e\n\u003cli\u003eBuild systems to gather, cleanse and integrate data from various sources\u003c/li\u003e\n\u003cli\u003eApply advanced algorithms from the field of quantitative finance and computational science to assist in the research of macroeconomic and financial variables\u003c/li\u003e\n\u003cli\u003eContribute to the MACS research agenda and investment decisions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMinimum 7+ years of experience as a quantitative developer for an investment firm\u003c/li\u003e\n\u003cli\u003eMaster’s degree with an outstanding academic record in a technical field such as mathematics, science or engineering; PhD degree preferred\u003c/li\u003e\n\u003cli\u003eHands on development experience with Python (Pandas, Numpy) for modeling/analytical work and SQL for data access and architecture; JavaScript experience for visualization a plus\u003c/li\u003e\n\u003cli\u003eVery strong mathematical skills; experience with Bayesian estimation and optimization is a plus\u003c/li\u003e\n\u003cli\u003eProficiency in multi-asset class data series and operating data delivery platforms\u003c/li\u003e\n\u003cli\u003eSuperior software, database design and programming skills to move quickly from concept to solution\u003c/li\u003e\n\u003cli\u003eWorld-class analytic skills and the ability to clearly articulate approach, process and results in verbal, graphical and written form\u003c/li\u003e\n\u003cli\u003eCreativity, enthusiasm, collegiality and the ability to excel in a self-starting environment\u003c/li\u003e\n\u003cli\u003eDrive and humility to deliver on high value projects and roll up your sleeves attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--581ce0319cf361a6680906a74565427148d2f9e2/1e0bbfdc-4638-486b-975a-0906de4dfa19"},{"id":"47328346-e90c-11e8-9429-c09930ae6ec9","type":"Full Time","url":"https://jobs.github.com/positions/47328346-e90c-11e8-9429-c09930ae6ec9","created_at":"Thu Nov 15 19:26:24 UTC 2018","company":"Acadian Asset Management","company_url":"http://acadian-asset.com","location":"Boston, MA","title":"Full Stack Developer \u0026 Senior Analyst (Investment Analytics)","description":"\u003cp\u003ePosition Overview:\nWe are seeking an experienced Software Engineer to help us design and build Acadian’s advanced browser-based, interactive, analytical platform that helps us better understand, explain, and improve our quantitative investment process. This is a hands-on, full-stack development role that provides growth and learning opportunities. The Software Engineer will utilize and hone a variety of technical skills while gaining and applying quantitative investment knowledge. Our small team is embedded within the investment group, providing the opportunity to see your work in action. Join us to leverage your software development skills and work with world class technology and investment experts.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, build, test, and support multi-tiered distributed, clustered, web-based applications and platforms\u003c/li\u003e\n\u003cli\u003eEngineer, design, and build scalable, interactive, responsive, informative, and beautiful data visualization and exploration tools\u003c/li\u003e\n\u003cli\u003eTeam up with quantitative portfolio managers and researchers to develop and execute process improvement initiatives through software development\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building browser-based applications using JavaScript, CSS, and HTML\u003c/li\u003e\n\u003cli\u003eExperience programming using a server-side scripting language such as Python (Node, Ruby, Julia, etc.)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent knowledge and technical work experience\u003c/li\u003e\n\u003cli\u003eHands on experience running http server such as Apache / NGINX\u003c/li\u003e\n\u003cli\u003ePrior investment/financial industry knowledge is not required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther technologies we use:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSQL, NoSQL, MongoDB, Redis\u003c/li\u003e\n\u003cli\u003eNumpy, Scipy, Pandas\u003c/li\u003e\n\u003cli\u003eD3, AngularJS, Node\u003c/li\u003e\n\u003cli\u003eDocker, Slurm, ZeroMQ, AWS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIt is the policy of Acadian Asset Management LLC to provide equal employment opportunity to all qualified persons without regard to race, creed, color, sex, age, national origin, marital status, veteran status, citizenship status, disability, or sexual orientation.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.acadian-asset.com/careers\"\u003ehttps://www.acadian-asset.com/careers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--703f54fc6dc8eda27790b08f4867a4593f252f09/e875225d-b3cc-454b-9e2f-a7e80cdb65fa"},{"id":"728d85b4-e8d9-11e8-95cd-f13299063e9d","type":"Full Time","url":"https://jobs.github.com/positions/728d85b4-e8d9-11e8-95cd-f13299063e9d","created_at":"Thu Nov 15 13:22:21 UTC 2018","company":"Stylight GmbH","company_url":"https://www.stylight.com/","location":"Munich, Germany","title":"Software Engineer (m/f)","description":"\u003cp\u003eFor our office in Munich, we are looking for a Software Engineer to join our team. If you like thinking outside the box and collaborating with teammates to develop solutions to complex problems— this is the place for you!\u003c/p\u003e\n\u003cp\u003eYour Team\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorks in an Agile environment to create internal tools in diverse areas such as performance marketing, SEO, and editorial content marketing.\u003c/li\u003e\n\u003cli\u003eCodes primarily in Python (mostly for backend applications) and is committed to the quality and health of their codebase.\u003c/li\u003e\n\u003cli\u003eValues the learning and growth mindset and has dedicated time for self-driven, personal development.\u003c/li\u003e\n\u003cli\u003eHas low management overhead and a high level of trust in one another; enjoys autonomous work as well as pair programming.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Responsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eConsider complex logical problems and develop pragmatic solutions with regard to relative effort and business value.\u003c/li\u003e\n\u003cli\u003eContinue to breakup a monolithic app into microservices while creating APIs used by other teams in Stylight’s value chain.\u003c/li\u003e\n\u003cli\u003eOwn service stacks from design, development, \u0026amp; testing to continuous integration, monitoring, \u0026amp; user support.\u003c/li\u003e\n\u003cli\u003eExplain technical concepts to non-technical colleagues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Profile\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe hope you love Python and have experience with it too!  If not, we expect you to have a strong desire to learn and significant experience in another programming language.\u003c/li\u003e\n\u003cli\u003eYou have a background in computer science either from a bachelor's degree program and/or work experience.\u003c/li\u003e\n\u003cli\u003eYou have proficient English skills and are able to communicate honestly and openly with your colleagues.\u003c/li\u003e\n\u003cli\u003eYou are a motivated, compassionate individual who enjoys collaboration and is eager to learn from and teach others.\u003c/li\u003e\n\u003cli\u003eSQL experience is a nice plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy join Stylight?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have an international, fun, and inclusive culture!  Our team represents over 20 nationalities.\u003c/li\u003e\n\u003cli\u003eWe are family-friendly and enjoy spending time with one another outside of working hours from board game evenings and BBQs to ping pong tournaments and Christmas tree decorating.\u003c/li\u003e\n\u003cli\u003eStylight is #1 Meetup organizer in Munich, deeply involved in the local tech community, and organizer of daho.am, our own annual developer conference.\u003c/li\u003e\n\u003cli\u003eA personal development budget is given to you to use throughout the year for personal growth.\u003c/li\u003e\n\u003cli\u003eWe have a beautiful office space which is in the city-center, just a 10-minute walk to the nearest Biergarten.\u003c/li\u003e\n\u003cli\u003eWant to know more? Check out: about.stylight.com and tech.stylight.com.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the Challenge?\u003c/p\u003e\n\u003cp\u003eThen don’t hesitate and apply today at about.stylight.com/jobs. We look forward to your complete application (CV, cover letter)! Your contact: Carina Meyer.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply at about.stylight.com/jobs!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b29261ac99368f87eb6bc2df80122e7ea213932c/787c4fda-3185-4f0c-8e04-ab47802c6f4a"},{"id":"0b6885c4-e8d8-11e8-96fd-a4688df0d66b","type":"Full Time","url":"https://jobs.github.com/positions/0b6885c4-e8d8-11e8-96fd-a4688df0d66b","created_at":"Thu Nov 15 13:12:21 UTC 2018","company":"Stylight GmbH","company_url":"https://www.stylight.com","location":"Munich, Germany","title":"Senior Software Engineer (m/f)","description":"\u003cp\u003eWe are looking for an experienced Software Engineer to join our team in Munich. You’re interested in further optimizing and automating the technical integration of our partner shops and delivering high quality software is your number one priority? Then Stylight is your place to be.\u003c/p\u003e\n\u003cp\u003eYour Team\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIs responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners.\u003c/li\u003e\n\u003cli\u003eCodes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase.\u003c/li\u003e\n\u003cli\u003eWorks in an agile and cross-functional environment alongside our sales and partner managers.\u003c/li\u003e\n\u003cli\u003eEnjoys autonomous work as well as pair programming, code reviews and learning together.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Responsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnsuring your team ships quality products and code in accordance with business needs.\u003c/li\u003e\n\u003cli\u003eBuild, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.\u003c/li\u003e\n\u003cli\u003eOwn services from design, development, and testing to continuous integration, monitoring, and support.\u003c/li\u003e\n\u003cli\u003eEnjoy what you do, and be ready to research and learn new technologies.\u003c/li\u003e\n\u003cli\u003eExplain technical topics to non-technical colleagues and advocate for your team across the company.\u003c/li\u003e\n\u003cli\u003eMentor, lead, and support other engineers to foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Profile\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou bring hands-on experience in software development, ideally 5+ years and have experience in designing, building and operating complex, scalable systems.\u003c/li\u003e\n\u003cli\u003eYou have significant Python experience and are ready to share what you’ve learned with others.\u003c/li\u003e\n\u003cli\u003eYou want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy.\u003c/li\u003e\n\u003cli\u003eYou are opinionated and outspoken on engineering best practices, but can still maintain friends.\u003c/li\u003e\n\u003cli\u003eYou have solid experience with both relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eYou have proficient English skills and are able to communicate honestly and openly with your colleagues.\u003c/li\u003e\n\u003cli\u003eYou’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee.\u003c/li\u003e\n\u003cli\u003eExperience with Docker, AWS, and microservice architectures are a very nice plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy join Stylight?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.\u003c/li\u003e\n\u003cli\u003eWe organize daho.am, our own annual developer conference. Top-notch speakers and over 1,000 attendees.\u003c/li\u003e\n\u003cli\u003eInternational \u0026amp; highly motivated environment with open business culture in all departments.\u003c/li\u003e\n\u003cli\u003eHands-on work after quick ramp up \u0026amp; openness to new solutions and improvements.\u003c/li\u003e\n\u003cli\u003eA personal development budget is given to you to use throughout the year for personal growth.\u003c/li\u003e\n\u003cli\u003eWe have one of the coolest office spaces in Munich (and actually in Germany).\u003c/li\u003e\n\u003cli\u003eExperience Munich: Our office is in the city-center, and just a 10-minute walk to the nearest Biergarten.\u003c/li\u003e\n\u003cli\u003eWant to know more? Check out: about.stylight.com and tech.stylight.com.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the Challenge?\u003c/p\u003e\n\u003cp\u003eThen do not hesitate and apply today on about.stylight.com/jobs. We are looking forward to receiving your complete application (CV, cover letter) in English or German! Your contact: Carina Meyer.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply at about.stylight.com/jobs!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDlXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--aefc2a286e55b1426f3cf4424719dd1316033ef3/f2c8b944-fbd2-4be4-8f71-47be0ff73cc3"},{"id":"62f8d66a-e8d6-11e8-9847-c1b90d211139","type":"Full Time","url":"https://jobs.github.com/positions/62f8d66a-e8d6-11e8-9847-c1b90d211139","created_at":"Thu Nov 15 13:00:53 UTC 2018","company":"Stylight GmbH","company_url":"https://www.stylight.com","location":"Munich, Germany","title":"Lead Engineer (m/f)","description":"\u003cp\u003eWe are looking for a Lead Software Engineer to join our team in Munich. You’re interested in further optimizing and automating the technical integration of our partner shops and delivering high quality software is your number one priority? Then Stylight is your place to be.\u003c/p\u003e\n\u003cp\u003eYour Team\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIs responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners.\u003c/li\u003e\n\u003cli\u003eCodes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase.\u003c/li\u003e\n\u003cli\u003eWorks in an agile and cross-functional environment alongside our sales and partner managers.\u003c/li\u003e\n\u003cli\u003eEnjoys autonomous work as well as pair programming, code reviews and learning together.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Responsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnsuring your team ships quality products and code in accordance with business needs.\u003c/li\u003e\n\u003cli\u003eBuild, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team.\u003c/li\u003e\n\u003cli\u003eOwn services from design, development, and testing to continuous integration, monitoring, and support.\u003c/li\u003e\n\u003cli\u003eEnjoy what you do, and be ready to research and learn new technologies.\u003c/li\u003e\n\u003cli\u003eExplain technical topics to non-technical colleagues and advocate for your team across the company.\u003c/li\u003e\n\u003cli\u003eMentor, lead, and support other engineers to foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Profile\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou bring hands-on experience in software development, ideally 5+ years and have experience in designing, building and operating complex, scalable systems.\u003c/li\u003e\n\u003cli\u003eYou have significant Python experience and are ready to share what you’ve learned with others.\u003c/li\u003e\n\u003cli\u003eYou want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy.\u003c/li\u003e\n\u003cli\u003eYou are opinionated and outspoken on engineering best practices, but can still maintain friends.\u003c/li\u003e\n\u003cli\u003eYou have solid experience with both relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eYou have proficient English skills and are able to communicate honestly and openly with your colleagues.\u003c/li\u003e\n\u003cli\u003eYou’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee.\u003c/li\u003e\n\u003cli\u003eExperience with Docker, AWS, and microservice architectures are a very nice plus.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy join Stylight?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community.\u003c/li\u003e\n\u003cli\u003eWe organize daho.am, our own annual developer conference. Top-notch speakers and over 1,000 attendees.\u003c/li\u003e\n\u003cli\u003eInternational \u0026amp; highly motivated environment with open business culture in all departments.\u003c/li\u003e\n\u003cli\u003eHands-on work after quick ramp up \u0026amp; openness to new solutions and improvements.\u003c/li\u003e\n\u003cli\u003eA personal development budget is given to you to use throughout the year for personal growth.\u003c/li\u003e\n\u003cli\u003eWe have one of the coolest office spaces in Munich (and actually in Germany).\u003c/li\u003e\n\u003cli\u003eExperience Munich: Our office is in the city-center, and just a 10-minute walk to the nearest Biergarten.\u003c/li\u003e\n\u003cli\u003eWant to know more? Check out: about.stylight.com and tech.stylight.com.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the Challenge?\u003c/p\u003e\n\u003cp\u003eThen do not hesitate and apply today! We are looking forward to receiving your complete application (CV, cover letter) in English or German! Your contact: Carina Meyer.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePleas apply at about.stylight.com/jobs!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdDVXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a1ce7309a39c5d747fd02eafdd31d918aa5d2fa4/759b760f-982e-4395-aeef-1e146d2f3a0c"},{"id":"76fcadae-e84e-11e8-88fc-96a168773892","type":"Full Time","url":"https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892","created_at":"Wed Nov 14 20:50:03 UTC 2018","company":"NBCUniversal","company_url":"https://www.nbcunicareers.com/","location":"Universal City, CA","title":"Media Software Engineer","description":"\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"b0332ea6-e82e-11e8-83b0-deabde06afe8","type":"Full Time","url":"https://jobs.github.com/positions/b0332ea6-e82e-11e8-83b0-deabde06afe8","created_at":"Wed Nov 14 17:01:38 UTC 2018","company":"Autodesk","company_url":null,"location":"Portland, OR or Offsite- USA","title":"Technical Lead, GitHub Solutions","description":"\u003cp\u003eTechnical Lead, GitHub Solutions\nLocation: Portland, OR or Offsite- United States\nJob ID: 18WD30442\u003c/p\u003e\n\u003cp\u003ePosition Overview\u003c/p\u003e\n\u003cp\u003eHave you ever wanted to work for one of the best companies in the industry? Ever wanted to use your knowledge of Git and GitHub to create a development solution that is used by hundreds of Engineering teams? Ever wanted to change the way software is developed and built using continuous integration pipelines?\u003c/p\u003e\n\u003cp\u003eTo maintain our leadership position in a fast moving, ever-changing, competitive environment, Autodesk’s Engineering organization is going through many significant transformations. Therefore, this is a fantastic time to join the company and make an impact.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrategic Leadership\n\u003cul\u003e\n\u003cli\u003eEvangelize the benefits of Git and GitHub, especially as they benefit CI/CD (Continuous Integration and Delivery) and the creation of highly collaborative development environments\u003c/li\u003e\n\u003cli\u003eBuild a close working relationship with product Architects across the company. Work with them to get consensus on the solutions selected\u003c/li\u003e\n\u003cli\u003eExpand the CI development solution to include tools such as Artifactory, Codacy, Code Coverage, IDEs, and more\u003c/li\u003e\n\u003cli\u003ePromote and implement state-of-the-art SCM branching and submission practices that support modern development practices and a CI/CD development methodology\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eBuild solutions that work at scale\n\u003cul\u003e\n\u003cli\u003eAutodesk has many very large codebases. We will push tools to the limit and beyond. Be the leader that designs and develops solutions (both inner-source and open-source) with Git and GitHub that work at scale\u003c/li\u003e\n\u003cli\u003eEnsure your customers have an excellent experience using GitHub and the development solutions built around it\u003c/li\u003e\n\u003cli\u003eWith 4000 users, resiliency is a critical requirement in our development tools. Architect, then build out the solutions needed to ensure tools are reliable, HA, scalable, monitored, and resilient\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMinimum Qualifications\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS in Computer Science, Engineering or equivalent with an excellent academic background\u003c/li\u003e\n\u003cli\u003e5+ years of work experience in commercial software development\u003c/li\u003e\n\u003cli\u003e2+ years of technical hands-on experience with Git and GitHub\u003c/li\u003e\n\u003cli\u003eStrong knowledge of other SCM tools such as Perforce and TFS would be a benefit\u003c/li\u003e\n\u003cli\u003eStrong knowledge of CI/CD tools and methodologies, Jenkins\u003c/li\u003e\n\u003cli\u003eExperience with these languages. Perl, Python, Go, Groovy, Bash, Rust\u003c/li\u003e\n\u003cli\u003eAre a team player who cares about making the team and customers successful\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTop Signs That You're the Right Candidate\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a strong interest in creating great development solutions built on top of Git and GitHub\nThis is a passion, not just a job\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout Autodesk\u003c/p\u003e\n\u003cp\u003eWith Autodesk software, you have the power to Make Anything. The future of making is here, bringing with it radical changes in the way things are designed, made, and used. It's disrupting every industry: architecture, engineering, and construction; manufacturing; and media and entertainment. With the right knowledge and tools, this disruption is your opportunity. Our software is used by everyone - from design professionals, engineers and architects to digital scientists, students and hobbyists. We constantly explore new ways to integrate all dimensions of diversity across our employees, customers, partners, and communities. Our ultimate goal is to expand opportunities for anyone to imagine, design, and make a better world.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=18WD30442\u0026amp;tz=GMT-08%3A00\"\u003ehttps://autodesk.taleo.net/careersection/adsk_gen/jobdetail.ftl?job=18WD30442\u0026amp;tz=GMT-08%3A00\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1pXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--635e876f0cb800a040241bd22e6567ba9d6b2b8b/234d448d-dfab-42fa-8e7a-5f982e2dbb56"},{"id":"dc5e367e-e74d-11e8-83b6-bff5f2b12e4f","type":"Full Time","url":"https://jobs.github.com/positions/dc5e367e-e74d-11e8-83b6-bff5f2b12e4f","created_at":"Tue Nov 13 14:11:38 UTC 2018","company":"VONQ","company_url":"http://www.vonq.com","location":"Rotterdam","title":"DevOps Engineer","description":"\u003cp\u003eYou are a DevOps or System Engineer who can’t wait to be part of a growing team and to make actual impact. At VONQ we do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!\u003c/p\u003e\n\u003cp\u003eDevOps Engineer\nRotterdam, fulltime, ASAP\u003c/p\u003e\n\u003cp\u003eBe part of our journey and bring our development process, infrastructure and engineering practices to the next level\nAs our System Engineer you will be the one leading critical platform development efforts. What you’ll actually be contributing to? Our core product, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.\u003c/p\u003e\n\u003cp\u003eWe have an ambitious roadmap for the upcoming period. Your part in the process? We will start to utilise a number of various DevOps practices - and that’s where you come in!\u003c/p\u003e\n\u003cp\u003eYou will be part of an international and experienced Engineering department consisting of Backend and Frontend Developers, Data Engineers, an Agile Coach and a CTO.\u003c/p\u003e\n\u003cp\u003eYour day-to-day job in a nutshell as VONQ’s DevOps Engineer\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMake fully functional environments available on demand for the development team\nProvide guidance and support on application architecture as we move to a container based architecture\u003c/li\u003e\n\u003cli\u003eEnsure a smooth flow of work for all of our development teams\u003c/li\u003e\n\u003cli\u003eEnable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure\u003c/li\u003e\n\u003cli\u003eYou'll work autonomously to make our architectural and business goals a reality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGreat understanding of DevOps practices and an Agile mindset, that is you!\nThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years relevant experience\u003c/li\u003e\n\u003cli\u003eExcellent communication skills in English\u003c/li\u003e\n\u003cli\u003eExperience working in application development, systems or IT operations\u003c/li\u003e\n\u003cli\u003eExperience with Cloud and container technologies (e.g. AWS, docker, rocket)\u003c/li\u003e\n\u003cli\u003eGreat understanding DevOps practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)\u003c/li\u003e\n\u003cli\u003eYou can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)\u003c/li\u003e\n\u003cli\u003eExperience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo\u003c/li\u003e\n\u003cli\u003eExperience in contributing to the systems architecture of a company\u003c/li\u003e\n\u003cli\u003eLast but not least, you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with application development (e.g. PHP, Scala, Ruby, Golang)\u003c/li\u003e\n\u003cli\u003eExperience with data engineering (e.g. spark, scala, databricks)\u003c/li\u003e\n\u003cli\u003eWorked as part of a distributed (or international) team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is why you should join our team\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.\nOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!\u003c/p\u003e\n\u003cp\u003eWe have legendary company outing, beers on Friday and lots of FUN!\u003c/p\u003e\n\u003cp\u003eThere is more! We offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA good salary and 8% holiday allowance\u003c/li\u003e\n\u003cli\u003e100% commuting expenses compensation\u003c/li\u003e\n\u003cli\u003ePension contribution\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eUnlimited (paid!) holidays\u003c/li\u003e\n\u003cli\u003eTime and budget for training\u003c/li\u003e\n\u003cli\u003eRelocation support, and more!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eUp for the challenge? Join VONQ as System Engineer and make things happen! Please apply by using this application link\n. Questions? Contact Sarah (Recruiter) -\u0026gt; sarahellithy(at)vonq.com.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply by using this application link\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42ef9e87e92144f85a34863593358a683954179e/d08b7e6a-0293-4795-9808-a6b527efd7da"},{"id":"4cd29974-e48b-11e8-8478-fb9810f86b79","type":"Full Time","url":"https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79","created_at":"Sat Nov 10 02:02:55 UTC 2018","company":"Sesame","company_url":"http://sesamecare.com","location":"New York; Berlin","title":"Software engineer (back end)","description":"\u003cp\u003eWe’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.\u003c/p\u003e\n\u003cp\u003eOur all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.\u003c/p\u003e\n\u003cp\u003eWe believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.\u003c/p\u003e\n\u003cp\u003eWe’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.\u003c/p\u003e\n\u003cp\u003eWe must be on to something, since we’re proud to say:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have engineering teams in New York and Berlin\u003c/li\u003e\n\u003cli\u003eWe've raised millions in funding to grow U.S. operations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWant to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComfortable with Java and microservices.\u003c/li\u003e\n\u003cli\u003eYou seek and prefer simple solutions to complex problems.\u003c/li\u003e\n\u003cli\u003eYou strive to write clean, quality code and enjoy doing it.\u003c/li\u003e\n\u003cli\u003eYou maintain a healthy balance between perfectionism and actually getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.\u003c/li\u003e\n\u003cli\u003eYou love developing software. You have 2+ years of industry experience.\u003c/li\u003e\n\u003cli\u003eYou are a strong team player, have strong writing skills, and enjoy collaborating with others.\u003c/li\u003e\n\u003cli\u003eYou are attuned to the fundamentals of user design and user experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur technology stack includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava 10\u003c/li\u003e\n\u003cli\u003eSpring Boot\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePub/Sub\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eNodeJs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur Offer:\u003c/strong\u003e\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePerks:\u003c/strong\u003e\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.\u003c/p\u003e\n\u003cp\u003eSesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"},{"id":"9999f1f0-e448-11e8-966e-602e38acf303","type":"Full Time","url":"https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303","created_at":"Fri Nov 09 21:36:14 UTC 2018","company":"BlueVine","company_url":"http://bluevine.com","location":"Redwood City, Ca","title":"Senior Python Developer","description":"\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"},{"id":"dc428b94-e42e-11e8-91e2-23879ca9e8b0","type":"Full Time","url":"https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0","created_at":"Fri Nov 09 14:51:11 UTC 2018","company":"New York University","company_url":null,"location":"New York, New York 10001","title":"Technology Solutions Developer","description":"\u003cp\u003eAs a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.\u003c/p\u003e\n\u003cp\u003eUS\u003c/p\u003e\n\u003cp\u003eThe Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.\u003c/p\u003e\n\u003cp\u003eOur group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.\u003c/p\u003e\n\u003cp\u003eYOU\u003c/p\u003e\n\u003cp\u003eWe're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!\u003c/p\u003e\n\u003cp\u003eWHY\u003c/p\u003e\n\u003cp\u003eAs an employee of NYU Law, you would receive NYU's benefits (\u003ca href=\"https://www.nyu.edu/employees/benefit.html\"\u003ehttps://www.nyu.edu/employees/benefit.html\u003c/a\u003e), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.\u003c/p\u003e\n\u003cp\u003eRequired Education:\nBachelor's degree.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003ePreferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.\u003c/p\u003e\n\u003cp\u003eRequired Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.\u003c/p\u003e\n\u003cp\u003ePreferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)\u003c/p\u003e\n\u003cp\u003eEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105491972\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"f61bcf90-e400-11e8-8ff5-71d2e066e687","type":"Full Time","url":"https://jobs.github.com/positions/f61bcf90-e400-11e8-8ff5-71d2e066e687","created_at":"Fri Nov 09 09:23:05 UTC 2018","company":"University of Cambridge","company_url":"https://www.gen.cam.ac.uk/","location":"Cambridge, UK","title":"Research Software Engineer","description":"\u003cp\u003e\u003cstrong\u003eResearch Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAre you passionate about open source and making user friendly client-side web applications? We’re a small team comprised of five developers (six, if you join us!) and a biologist, looking for a developer to help us create client-side applications for the open source \u003ca href=\"http://www.intermine.org\"\u003eInterMine\u003c/a\u003e data warehouse platform. Using JavaScript and ClojureScript, the successful applicant will create tools to query and display complex biological data.\u003c/p\u003e\n\u003cp\u003eWe have a lot of fun problems to solve, using the best technologies. How do you let naive users search complex biological data sets? How do you visualise data to let people absorb complicated relationships quickly? How can we use technology to get scientists the answers and data they need? We’re deeply committed to open source and the open science movement. We’re passionate about standards and making scientific data available to everyone.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur Stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eInterMine​ is an open source Java-based data warehouse, integrating biological data in varied formats into a PostgreSQL database. InterMine also includes ​ web services with client libraries​ in R, Python, Perl, Ruby, Java, and JavaScript, and a legacy JSP-based UI. We’ve also developed ​ BlueGenes​ -- our new user interface powered by Clojure. See our current projects on ​\u003ca href=\"https://github.com/intermine/\"\u003eGitHub​\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for an enthusiastic problem solver willing to learn and try new technologies. You’ll be able to show us beautiful interfaces you’ve made. You’ll be comfortable with HTML, CSS, Javascript, and working with the DOM. Note that previous experience with Clojure and / or biology is not required. However an interest and willingness to learn is!\u003c/p\u003e\n\u003cp\u003ePlease see the \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ejob advert\u003c/a\u003e for specific details.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat We Offer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a member of a small team, you’ll have the chance to learn and extend your skills significantly. Opportunities include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003einteracting with a ​ worldwide community of open-source contributors​ .\u003c/li\u003e\n\u003cli\u003ementoring students through programs such as ​ Google Summer of Code​ .\u003c/li\u003e\n\u003cli\u003euser testing your applications, both in person and via video conferencing.\u003c/li\u003e\n\u003cli\u003epresenting/co-authoring academic papers, posters, and talks at technical and\nacademic conferences.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe offer very competitive salaries and a generous benefits package (see\n\u003ca href=\"http://www.jobs.cam.ac.uk/offer%E2%80%8B\"\u003ehttp://www.jobs.cam.ac.uk/offer​\u003c/a\u003e for the full list).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e33 days annual holiday\u003c/li\u003e\n\u003cli\u003e37.5 hour work week\u003c/li\u003e\n\u003cli\u003eUniversity pension\u003c/li\u003e\n\u003cli\u003eChild care and bike to work salary sacrifice schemes\u003c/li\u003e\n\u003cli\u003eAccess to ​ University sports facilities\u003c/li\u003e\n\u003cli\u003eFamily friendly benefits​ like maternity, paternity and parental leave, flexible\nworking and career break schemes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply: \u003ca href=\"http://www.jobs.cam.ac.uk/job/19504/\"\u003ehttp://www.jobs.cam.ac.uk/job/19504/\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"ea4a734e-c8c9-11e8-9b99-00d03040101f","type":"Full Time","url":"https://jobs.github.com/positions/ea4a734e-c8c9-11e8-9b99-00d03040101f","created_at":"Wed Nov 07 12:46:04 UTC 2018","company":"Norwegian Block Exchange AS","company_url":null,"location":"Oslo, Norway or Remote","title":"Software Developer","description":"\u003cp\u003e\u003cstrong\u003eHelp us accelerate the world’s transformation to digital assets.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNorwegian Block Exchange (NBX) is building the best cryptocurrency exchange and digital ecosystems for consumers and institutions, optimizing ways for businesses across industries to operate. NBX will lead the community for distributed ledger technologies and other digital assets through security, integrity and customer experience.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat makes this a great place to work?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo reach our goals, we are starting from scratch building the company by using the best in class solutions and technology:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNBX has global ambitions with no legacy code in a greenfield project.\u003c/li\u003e\n\u003cli\u003eHelp shaping architecture and technology choices for the future.\u003c/li\u003e\n\u003cli\u003eWe believe in a healthy work-life balance and flexible working hours.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a software developer on the NBX tech team you'll be part of a 10-15 person agile team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eParticipating in all areas of application development life-cycle.\u003c/li\u003e\n\u003cli\u003eShip updates in CI/CD pipelines.\u003c/li\u003e\n\u003cli\u003eOur current tech stack:\nGCP, Kubernetes, Docker, React-Redux, Python, Go, Kafka, Cassandra.\u003c/li\u003e\n\u003cli\u003eFuture ambitions for our tech stack:\nMulti cloud, Global reach, AI \u0026amp; Machine Learning, Blockchain as a service, Smart contracts as a service.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for experienced software developers to help us achieve our high ambitions:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience developing microservices for large scale production services.\u003c/li\u003e\n\u003cli\u003eGood work ethics is necessary. As teams will be working independently within their areas of responsibility.\u003c/li\u003e\n\u003cli\u003eTechnology agnostic and eager to learn new languages, frameworks, patterns etc.\u003c/li\u003e\n\u003cli\u003eExcellent communication skills, both verbal and written.\u003c/li\u003e\n\u003cli\u003eBachelor's degree or higher in Computer Science/Engineering, or equivalent is preferred.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:join@nbx.com\"\u003ejoin@nbx.com\u003c/a\u003e,\nLinks to github repositories or similar are welcome\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d1c2a88373950aba7070ca4f32b212fbe54b62ab/f1f41d14-8e9f-4c73-889c-88248676e147"},{"id":"e5f347ea-e277-11e8-989d-9bece5ee00a0","type":"Full Time","url":"https://jobs.github.com/positions/e5f347ea-e277-11e8-989d-9bece5ee00a0","created_at":"Wed Nov 07 10:55:22 UTC 2018","company":"Alasco GmbH","company_url":"https://www.alasco.de/","location":"Munich","title":"Frontend Engineer (m/f)","description":"\u003cp\u003eAlasco helps construction companies complete projects on time and budget. We digitalize the processes in construction planning and execution by offering a cloud based workflow platform. Alasco has been founded in 2018 by three well-known tech entrepreneurs in Munich (Anselm Bauer, Benjamin Günther, Sebastian Schuon) to enable more and higher quality buildings for everybody. If you are interested in participating in a startup early on, do join our cause!\u003c/p\u003e\n\u003cp\u003e•Your Responsibilities: Together with your team, you ship new features for our cloud platform. You will participate in all SCRUM meetings and contribute to improve both the product and your team. After learning about the customers needs and processes you strive to solve them and to deliver the best possible experience for our users by empowering them through an effective and intuitive UI\u003c/p\u003e\n\u003cp\u003e•Your Profile: You have mastered one frontend framework (preferably react) and have experience in collaborating with designers, bringing wireframes to life. You strive for re-usability. Styling elements is a no-go, let’s use classes and variables for that! Previously you have been part of an agile development team. Besides being fluent in English, we want to you to have a desire to learn and grow!\u003c/p\u003e\n\u003cp\u003e•Our Profile\nWe are a small team of software engineers, partly distributed. For our work we use a python/django/postgres stack in the backend and use react/bootstrap in the frontend. All running on AWS. We believe in DevOps, Continuous Integration and Testing (and live it) and work as a SCRUM team, with open boards and retros. We strive hard to balance development speed and software quality and care about the personal growth of our team members!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eSubmit your application through \u003ca href=\"https://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d\"\u003ehttps://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb05XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--834caeaebed8c5a2c4f9fc769ba05f9a69539cd6/4317ab46-3da3-432d-b505-e73e17ad3eea"}]